{
  "chapIndex": "JAMB",
  "text": "The Joint admissions and Matriculation Board (JAMB) was established by an Act of 1978, subsequently amended in 1989 and 1993. By the virtue of the Act, the Board is empowered to be responsible for the:\n\n    general control over the conduct of matriculation examinations into all Universities, Monotechnics, Polytechnics and Colleges of Education;\n    appointment of examiners, moderators, invigilators, members of the subject panels and committees and other persons with respect to matriculation examinations;\n    placement of suitably qualified candidates in the tertiary institutions in collaboration with those institutions.\n\nIn furtherance of these functions, the Board conducts a matriculation examination for candidates seeking admissions to tertiary institutions within the country. This examination is known as the Unified Tertiary Matriculation Examination (UTME).\nEligibility for the Examination\n\nThose eligible to sit the UTME are holders of the following qualifications or their equivalents:\n\n    the West African School Certificate (WASC)\n    the Senior Secondary School Certificate (SSCE)\n    the National Technical Certificate or the National Business Certificate (NTC/NBC)\n    Teachers’ Grade II Certificate\n\nCandidates who have sat or are scheduled to sit for examinations in any of these qualifications in the year of application may also sit for the UTME.\nStructure of the Examination\n\nThe UTME is conducted once a year in the computer based test mode. The test is a two-hour multiple-choice in four subjects, with a compulsory paper, the Use of English and three other subjects of a candidate’s choice. Prospective candidates are advised to seek the advice of their teachers, parents/guardians or career counselors in their choice of elective subjects for the UTME.\n\nCandidates are advised to visit the CBT practice test platform to familiarize themselves with features of the computer-based test at no extra cost.\nAdmission Requirements\n\nProspective candidates for the UTME are to note that for them to secure admissions into tertiary education programme, they have to:\n\n    attain an appreciable standard of pass in the UTME in the relevant subjects;\n    have credit passes in five relevant subjects in the appropriate WAEC/NECO SSCE/Teachers’ Grade II examination.\n\nThe credit/merit passes in question should be attained at not more than two sittings. Normally, credit passes Mathematics and English Language are required for all tertiary education courses except where it is stated other wise. In addition to the general entry requirements specified above, candidates must meet any other specific entry.\n\nCandidates are therefore advised to consult the appropriate sections of the UTME/DE brochure for information about the specific entry requirements for different programmes. It is also important to note that admissions are subject to general guidelines enunciated from time to time by the proprietors of higher educational institutions. Such guidelines may set out admissions quotas or implementation principles which the Board and the institutions are expected to uphold.\nBeware of Examination Malpractice\n\nIncreasingly, candidates, examination officials and other persons are yielding to the temptation to cheat in examinations. Cheating (or aiding or abetting cheating) in examinations is criminal act punishable in law. The Examination, Malpractices Decree 1999 provides penalties for persons convicted of examination malpractice. Punishment provided include imprisonment for 3-5 years or a fine of ₦50,000 or more, or both prison sentence and fine. By provision of the decree, the following are considered criminal acts:\n\nCheating, use of electronic device, impersonation, collusion with others with the intent to cheat or secure unfair advantage for self or for another, disturbance at examinations, misconduct in the course of an examination, failure to obey lawful orders of supervisors, proctors or agents of the examination body, forgery of result notification, breach of duty, conspiracy, aiding, multiple application, etc."
}