{
  "chapIndex": "Account",
  "text": "1. Nature and Significance of Accounting\n\n \n\nTopics: \n\n \n\na.Development of accounting (including branches of accounting)\nb. Objectives of bookkeeping and accounting;\nc. Users and characteristics of Accounting information\nd. Principles, concepts and conventions of accounting (nature, significance and application)\ne. Role of accounting records and information\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. differentiate between bookkeeping and accounting;\nii. use the historical background of bookkeeping and accounting for future development;\niii. apply the right principles, concepts and conventions to solving accounting problems;\niv. examine the role of accounting records and information in decision making.\nv. List the branches of Accounting such as Cost Accounting, Management Accounting, Auditing, Financial Accounting and Taxation.\n\n \n2. Principles of Double Entry\n\n \n\nTopics: \n\n\na. Functions of source documents\nb. Books of original entry\nc. Accounting equation\nd. The ledger and its classifications\ne. Trial balance\nf. Types and treatment of errors and uses of suspense account\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. relate the various source documents to their uses;\nii. relate source documents to the various books of original entry;\niii. determine the effect of changes in elements of accounting equation;\niv. identify the role of double entry and use it to post transactions into various divisions of the ledger;\nv. balance off ledger accounts;\nvi. extract a trial balance from balances and determine its uses;\nvii. identify various types of errors and their necessary corrections;\nviii. create a suspense account.\n\n \n3. Ethics in Accounting\n\n \n\nTopics: \n\n\na. Objectives\nb. Qualities of an Accountant\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. use ethics in preparing and presenting Accounting Reports;\nii. list qualities of an Accountant such as honesty, integrity, transparency, accountability and fairness.\n \n4. Cashbook\n\n \n\nTopics: \n\n\na. Columnar cashbooks\nb. Discounts\nc. Petty cashbook and the imprest system\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. determine the cash float;\nii. differentiate between two and three columnar cashbooks and how transactions are recorded in them;\niii. differentiate between trade and cash discounts;\niv. examine the effects of trade and cash discounts in the books of accounts.\nv. Identify various petty cash expense;\n\n \n5. Bank Transactions and Reconciliation Statements\n\n \n\nTopics: \n\n\na. Instrument of bank transactions\nb. e-banking system\nc. Courses of discrepancies between cashbook and bank statement\nd. Bank reconciliation statement\n\n \n\nObjectives:\n\nCandidates should be able to :\ni. identify bank documents such as cheques, pay-in-slips, credit and debit cards and their uses;\nii. assess the impact of automated credit system, credit transfers, interbank transfers and direct debit on cash balances;\niii. list factors that cause discrepancies between balances of cashbook and bank statements\niv. prepare adjusted cashbook balance\nv. prepare bank reconciliation statements.\n\n \n6. The Final Accounts of a Sole Trader\n\n Topics:\n\n\na. Income statement (Trading and profit and loss account)\nb. Statement of financial position (Balance sheet)\nc. Adjustments:\ni. provision for bad and doubtful debt\nii. provision for discounts\niii. provision for depreciation using straight-line and reducing balance methods\niv. accruals and prepayments\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. determine the cost of sales, gross profit and net profit of a sole trader;\nii. identify fixed assets, current assets, long- term liabilities, current liabilities and proprietor's capital;\niii. compute adjustable items on the related expenditure and income in the profit and loss account;\niv. relate the adjustable items and their corresponding disclosure in the statement of financial position;\nv. differentiate between bad debts and provision for bad and doubtful debts.\n\n \n7. Stock Valuation\n\n \n\nTopics:\n\n\na. Methods of cost determination using FIFO, LIFO and simple average\nb. The advantages and disadvantages of the methods\nc. The importance of stock valuation\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. determine the cost of materials issued to production or cost of goods sold using FIFO, LIFO and simple average;\nii. calculate the closing stock of materials or finished goods using FIFO, LIFO and simple average;\niii. compare the advantages and disadvantages of each method of stock valuation;\niv. determine the effects of stock valuation on trading, profits and cost of goods sold.\n \n8. Control Accounts and Self-balancing Ledgers\n\n \n\nTopics: \n\n\na. Importance of control accounts\nb. Purchases ledger control account\nc. Sales ledger control account\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. determine the importance of control accounts in a business enterprise;\nii. differentiate between sales ledger control account and purchases ledger control account;\niii. identify the individual elements of control accounts;\niv. prepare the control accounts\n \n9. Incomplete Records and Single Entry\n\n \n\nTopics:\n\n\na. Conversion of single entry to double entry\nb. Determination of missing figures\nc. Preparation of final accounts from incomplete records\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. determine proprietor's capital using statement of affairs;\nii. determine the amount of sales, purchases, cash balances, debtors, creditors and expenses by converting single entry to double entry;\niii. use accounting equations and gross profit percentage to determine gross profit or cost of sales.\n \n10. Manufacturing Accounts\n\n \n\nTopics: \n\n\na. Cost classification\nb. Cost apportionment\nc. Preparation of manufacturing account\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. calculate prime cost, production overhead, production cost and total cost;\nii. determine the basis of apportionment into production, administration, selling and distribution.\n\n \n11. Accounts of Not-For-Profit-Making Organizations.\n\n \n\nTopics:\n\n\na. Objectives of Not-For-Profit-Making organizations\nb. Receipts and payments account\nc. Income and expenditure account\nd. Statement of financial position (Balance sheet)\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. distinguish between the features of Not-for-profit-making organizations;\nii. determine the subscription income, subscription in arrears and in advance;\niii. compute the cash balances and accumulated funds, surplus and deficit for the period from all sources.\niv. Prepare:\na. receipts and payments account\nb. income and expenditure account\nc. statement of financial position\n\n \n12. Departmental Accounts\n\n Topics: \n\n\na. Objectives\nb. Apportionment of expenses\nc. Departmental trading and profit and loss account\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. identify the reasons for departmental accounts;\nii. determine the expenses associated with individual departments;\niii. compute departmental profits or losses.\n \n13. Branch Accounts\n\n \n\nTopics:\n\n\na. Objectives\nb. Branch accounts in the head office books\nc. Head office account\nd. Reconciliation of branch and head office books\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. determine the reasons for branch accounts;\nii. calculate profits and losses from branches;\niii.determine the sources of differences and reconcile them.\n \n14. Joint Venture Accounts\n\n \n\nTopics: \n\n\na. Objectives\nb. Personal accounts of venturers\nc. Memorandum Joint venture accounts\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. identify the objectives of Joint Venture;\nii. determine the profit or loss of the Joint Venture;\niii.determine the profit or loss of each venture.\n \n15. Partnership Accounts\n\n \n\nTopics:\n\n\na. Formation of partnership\nb. Profit and loss account\nc. Appropriation account\nd. Partners current and capital accounts\ne. Treatment of goodwill\nf. Admission/retirement of a partner\ng. Dissolution of partnership\nh. Conversion of a partnership to a company\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. determine the instruments of partnership formation;\nii. categorize all accounts necessary for partnership;\niii. determine the effects of admission and retirement of a partner;\niv. prepare revaluation account\nv. identify the accounts required for dissolution and conversion to a company;\nvi. determine the partners share of profits or losses\n \n16. Introduction to Company Accounts\n\n \n\nTopics:\n\n\na. Formation and classification of companies\nb. Issue of shares and debentures\nc. Final accounts of companies\nd. Interpretation of accounts using ratios.\ne. Distinction between capital and revenue reserves\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. differentiate between types of companies;\nii. identify the processes and procedures of recording the issue of shares and debentures;\niii. compute elements of final accounts of companies;\niv. Interpret the accounts for decision making using ratios such as current, acid test and stock turnover.\n \n17. Public Sector Accounting\n\n \n\nTopics:\n\n\na. Comparison of cash and accrual basis of accounting\nb. Sources of government revenue\nc. Capital and recurrent expenditure\nd. Consolidated revenue fund\ne. Statement of assets and liabilities\nf. Responsibilities and powers of:\ni. The Accountant General\nii. The Auditor General\ni. The Minister of Finance\nii. The Treasurer of local government\ng. Instruments of financial regulation\n\n \n\nObjectives: \n\nCandidates should be able to:\ni. differentiate between public sector accounting and private sector accounting;\nii. identify the sources of government revenue;\niii. differentiate between capital and recurrent expenditure;\niii. calculate consolidated revenue fund and determine the values of assets and liabilities;\niv. analyse the duties of the Accountant General, the Auditor General, the Minister of Finance and the Treasurer of local government;\nv. distinguish between the elements of control in government accounting procedures e.g. virement, warrant, votes, authority to incur expenditure, budget and due process certificate.\n \n18. Information Technology in Accounting\n\n \n\nTopics:\n\n\na. Manual and computerized accounting processing system\nb. Processes involved in data processing\nc. Computer hardware and software\nd. Advantages and disadvantages of manual and computerized accounting processing system\n\n Objectives:\n\nCandidates should be able to:\ni. relate and differentiate between manual and computerized accounting processing system;\nii. identify the processes involved in data processing;\niii. relate the different components of computer;\niv. identify the advantages and disadvantages of manual and computerized accounting processing system\n\n\n \n\nRECOMMENDED TEXTS\n\n\nAbdullahi D. Z. (2014) Modern Financial Accounting, Husab Global Press Concept Ltd.\n\nAdeifa O. Ajileye, J. O and Oluwasanna, R. O (2001) Get your Financial Accounting Right. Book One:\nOyo, Tenlad Press International.\n\nAjileye, J. O. and Adetifa O. (2001); Get your Financial Accounting Right, Book Two: Lagos:\nDe Hadey Printing Services\n\nAkinduko, A. O (2001) Basic Accounting: Akure: Spetins\n\nAwoyemi, E. O. (1989) A guide to Government Accounting and Internal Audit, Ibadan: Onibonje Press\n\nDodge, R. (2002) Foundation of Business Accounting, (Second Edition), Bershire: Chapman and Hall\n\nEkwere, A. B. (1997) Contemporary Accounting, Abuja: Aflon Finance (Control and Management) Act 1959\n\nEkwue K. C. (2010) Principles of Accounts, Book 1 & 2, Adson Publishing Company, Onitsha\n\nFemi L. (2013) Simplified and Amplified Financial Accounting\n\nFrankwood and Alan S. (2002) Frankwood's Business Accounting, Prentice Hall International Edition\n\nHassan M. M. (2001), Government Accounting, Lagos: Malthouse Press Limited\n\nIgben, R. O. (2004) Financial Accounting Made Simple (Vol. I) Lagos: Roi Publishers\n\nLonge, O. A. and Kazeem, R. A (2006) Essential Financial Accounting for Senior Secondary Schools:\nLagos: Tonad Publishers Limited\n\nMillichamp, A. H. (1989) Foundation Accounting: An Introduction manual for Accounting Students,\nLondon: DP Publications\n\nOkwoli, A. A. (1995) Financial Accounting, Zaria: Tamaza Publishers\n\nOshisami, K. (1997) Government Accounting and Financial Control: Ibadan: Spectrum\nWisdomline Pass at Once JAMB."
}