{
  "chapIndex": "",
  "text": "SECTION A: General Agriculture\n\n \n1. Meaning and Scope of Agriculture\n\n \n\nTopics:\n\n \n\na. Definition of Agriculture\n\nb. Branches of Agriculture\n\nc. Types of Agriculture i.e subsistence and commercial\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\n    use the definition of Agriculture in modern terms as it relates to production, processing and marketing.\n    differentiate between the various branches of Agriculture.\n    Differentiate between the various types of Agriculture\n\n \n\n \n2. Importance of Agriculture\n\n \n\nTopics:\n\n \n\ni. Provision of raw materials for agro-allied industries\nii. Provision of employment\niii. Development of rural areas, etc\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\n    relate agro-allied industries to their respective raw materials\n    relate the various contributions of Agriculture to economic development in West Africa.\n\n \n3. Agricultural Ecology\n\n \n\nTopics:\n\n \n\na. Ecological zones of West Africa\n\nb. Agricultural products of each ecological zone\nc. Environmental factors and their effects on crop and livestock production\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\n    differentiate between the features of the ecological zones in West Africa.\n    classify agricultural products according to each ecological zone.\n    differentiate abiotic from biotic factors affecting agricultural production.\n\n \n4. Genetics\n\n \n\nTopics:\n\n \n\na. First and second laws of Mendel\nb. Cell division\nc. Terminologies e.g locus, alleles, genotype, dominance\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\n    apply the first and second laws of Mendel to genetics.\n    differentiate between the types of cell division.\n\ni. determine the outcome of genetic crossing involving homozygous and heterozygous traits.\nii. compute simple probability ratios\n\n \n5. Farm Inputs\n\n \n\nTopics:\n\ne.g. planting materials, agrochemicals, e.t.c.\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n(i) classify different types of farm inputs and their uses.\n\n \n6. History of Agricultural Development in West Africa\n\n \n\nTopics: \n\n \n\na. Agricultural systems e.g. shifting cultivation, bush fallowing e.t.c\nb. Problems of Agricultural development e.g land tenure systems, inadequate infrastructures, finance for agriculture, pollution etc.\nc. Establishment of national research institutes e.g. NCRI, IAR, IAR&T, CRIN, NIFOR, FRIN, RRI, NRCRI, NIHORT, LCRI, e.t.c. and international research institutes e.g. IITA, ILRI, ICRISAT, WARDA e.t.c., leading to increased application of science to the development of agriculture.\nd. Agricultural Development Projects (ADPs) e.g. RTEP, FADAMA etc.\ne. National agricultural programmes such as OFN, NAFPP, NALDA, Green Revolution, NCRPs, NARP, Project Coordinating Unit (PCU) e.t.c\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\ncompare various agricultural systems. identify the problems and proffer solutions\ni. trace the history of research institutes from past to present.\nii. assess their role in the development of agriculture.\n\niii.give reasons for the establishment of ADPs.\n\niv. evaluate the contributions of national agricultural programmes.\n\n \n7. Roles of Government and NGOs in Agricultural Development\n\n \n\nTopics: \n\na. Development of fiscal policies favourable to agricultural production e.g. import duties, ban on importation, e.t.c.\nb. Agricultural laws and reforms e.g Land Use Act.\n\nc. Government programmes aimed at agricultural development e.g. subsidies, credit facilities, e.t.c.\n\nd. Provision of infrastructures e.g. transport systems, communication systems, e.t.c.\n\ne. Contribution of NGOs to agricultural development\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\n \n\n    evaluate the effects of government policies on agricultural development.\n    identify agricultural laws and their effect on agricultural production\n\ni. identify the various agricultural incentives provided by the government.\nii. assess their effects on agricultural development.\n\n    compare the various infrastructural facilities provided by government and their uses.\n    examine the roles of NGOs in the development of agriculture.\n\n \nSECTION B: Agronomy\n\n \n1. Rocks and Soil formation\n\n \n\nTopics:\n\n \n\na. Factors affecting rock weathering and soil formation\n\nb. Physical properties of soil\ni. Soil profile\nii. Soil texture and structure\n\nc. Chemical properties of soil\ni. Soil acidity and alkalinity\nii. Chemical component of soil e.g silicate\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\n    identify major types and properties of rocks and soils; factors and processes of soil formation.\n    differentiate between the horizons in a soil profile.\n\ni. differentiate between the components of soil.\nii. compute the proportion of soil constituents.\niii. analyse soil into its constituents parts.\niv. determine the water-holding capacity of soil\n\nv. determine the soil pH.\n\n \n2. Soil Water and Soil Conservation\n\n \n\nTopics:\n\n \n\na. Soil water: its importance, sources, movement, management and conservation.\n\nb. Soil conservation: meaning and importance, causes, effects, prevention and control of leaching, erosion, continuous cropping, burning and oxidation of organic matter.\n\nc. Irrigation and drainage methods\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\ni. compare capillary, gravitational and hygroscopic water.\nii. determine water-holding capacity, wilting points and plant available/unavailable water.\ni. identify the causes of erosion and leaching.\nii. determine control methods.\n\ni. classify irrigation and drainage systems.\nii. examine the importance and challenges of irrigation and drainage.\n\n \n3. Soil Fertility\n\n \n\nTopics: \n\n \n\na. Macro and micro-nutrients and their roles in plant nutrition: carbon, water and nitrogen cycles\n\nb. The living population of the soil (flora and fauna), and their roles in soil fertility\n\nc. Maintenance of soil fertility. Methods of maintaining soil fertility e.g. use of cover crops, application of organic manures, e.t.c.\n\nd. Nutrient deficiency symptoms e.g. chlorosis, sickle leaves, stunting, apical necrosis e.t.c.\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\ni. classify plant nutrients.\nii. identify factors affecting their availability.\n\nexamine the roles of soil flora and fauna in maintaining soil fertility.\n\ni. compare the different methods of maintaining soil fertility.\nii. differentiate between organic and inorganic fertilizer, and their methods of application.\niii. determine common fertilizer ratios.\n\ni. identify the deficiency symptoms and their causes.\nii. suggest remedies\n\n \n4. Land Preparation and Soil Tillage\n\n \n\nTopics:\n\n \n\na. Principles and practices of land preparation and soil tillage\n\nb. Factors affecting choice of tillage methods: Zero tillage, minimum tillage, e.t.c.\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\ni. compare the different methods of land preparation and soil tillage in relation to different groups of crops.\nii. give reasons for the advantages and the disadvantages of land preparation and soil tillage. give reasons for the choice of tillage methods.\n\n \n5. Plant Forms and functions\n\n \n\nTopics: \n\n \n\na. Parts of monocot and dicot crop plants and their functions\n\nb. The anatomy and morphology of the storage organs of common crop plants.\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\ni. identify crop plant parts and their functions.\nii. distinguish between monocot and dicot crop plants\niii. differentiate the various storage organs of crop plants\n\n \n6. Growth, Development and Reproduction\n\n \n\nTopics:\n\n \n\na. Gametogenesis\nb. Pollination\nc. Fertilization\nd. Embryo formation and development\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\n    examine the process of gamete formation.\n    give reasons for different types of pollination.\n    analyse the process of fertilization.\n    trace the process of embryo formation and development to the formation of seeds and fruits.\n\n \n7. Plant Propagation Methods\n\n \n\nTopics:\n\n \n\na. Sexual: the use of seeds, seed viability, viability test, seed rate and seed germination\n\nb. Asexual (vegetative propagation) e.g. cutting, budding, grafting, layering, e.t.c.\n\nc. Nursery and nursery management\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\ni. classify crops propagated by sexual methods.\nii. determine seed viability and seed rate.\niii. differentiate between types of seed germination.\niv. examine the conditions for seed germination. classify crops into different vegetative propagation methods.\ni. determine appropriate nursery sites, types; their advantages and disadvantages.\nii. apply the techniques of transplanting seedlings\n\n \n8. Cropping Systems, Planting Patterns and Plant Densities\n\n \n\nTopics:\n\n \n\na. Cropping systems: Monocropping, mixed-, multiple-, inter-, relay-, strip- and rotational cropping\nb. Planting patterns: Broadcasting, row spacing and drilling\n\nc. Plant densities: single, double and multiple stands\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\ni. compare cropping systems.\nii. apply different cropping systems to solve problems in agriculture.\n\ndifferentiate between the various planting patterns.\n\ni. examine the various types of plant densities and their effects on crop yield.\nii. compute plant density per hectare.\n\n \n9. Crop Husbandry\n\n \n\nTopics: Common and scientific names, gross morphology, anatomy of storage organs, methods of propagation, husbandry practices, harvesting, processing and storage, common diseases and pests, economic importance of the following groups of crops.\nGroup 1: Cereals e.g maize, guinea corn, rice\nGroup 2: Legumes e.g cowpea, groundnut, soyabean\nGroup 3: Tubers e.g yam, cassava, sweet potatoes\nGroup 4: Vegetables and Spices e.g tomatoes, egg plant, pepper, onion, okro, cabbage, amaranthus sp.\nGroup 5: Fruits e.g citrus, pineapple, pawpaw\nGroup 6: Beverages e.g cocoa, kola, coffee\nGroup 7: Oils e.g oil palm, coconut, shearbutter\nGroup 8: Latex e.g para rubber, gum arabic\nGroup 9: Fibres e.g jute, cotton, sisal hemp\nGroup 10: Sugars e.g sugarcane, beet\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\ni. apply the different methods of crop propagation, husbandry, harvesting, processing and storage for each crop.\nii. identify common diseases and pests and their effects on crop yield.\niii. determine the economic importance of each of the crops.\niv. relate their importance to national economic development.\n\n \n10. Pasture and Forage Crops\n\n \n\nTopics:\n\n \n\na. Study of gross morphology, methods of propagation and husbandry of common pasture grasses and legumes. Establishment, maintenance, conservation and uses of pastures and forage crops.\nb. Study of natural grasslands and their distribution in West Africa\nc. Range management\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\ni. classify common grasses and legumes used as pastures and forage\nii. differentiate between pasture and forage crops by their common and scientific names.\niii. distinguish between the various methods of conserving pastures e.g. hay- and silage-making.\n\niv. relate different vegetational zones to their dominant pasture species.\nv. determine range types and utilization of range resources in Nigeria\n\n \n11. Floriculture\n\n \n\nTopics:\n\n \n\nIdentification, establishment, maintenance and uses of ornamental trees, shrubs and flowers\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\ni. distinguish between common ornamental trees, shrubs and flowers.\nii. determine their uses and maintenance\n\n \n12. Weeds\n\n \n\nTopics:\n\n \n\na. Gross morphology, methods of reproduction, dispersal and effect of weeds\nb. Weed control methods - weeding, mulching, cover cropping, tillage, herbicides and trap cropping\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\ni. identify weeds with their common and scientific names.\nii. classify weeds according to their mode of dispersal. apply various weed control methods.\n\n \n13. Crop Diseases\n\n \n\nTopics:\n\n \n\na. Identification of disease-causing organisms both in store and in the field.\nb. A simple account of diseases caused by fungi, bacteria, nematodes and viruses; the nature of the damage, methods of transmission and common methods of control.\nc. Side effects of application of preventive and control methods e.g pollution, poisoning and distribution of ecosystem.\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\ndistinguish between common store and field disease - causing organisms.\ni. relate various disease-causing organisms to the damage caused, symptoms and their mode of spread.\nii. apply appropriate control methods.\niii. relate each control method to its side effect.\n\n \n14. Crop pests\n\n \n\nTopics:\n\n \n\na. General account of pests of agricultural plants both in the field and in the store, their types, importance, principles and methods of prevention and control\nb. Life cycles of: biting insects e.g. grasshopper; boring insects e.g. weevils; sucking insects e.g. aphids and cotton strainer.\nc. Common pesticides and their side effects\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\ni. identify the various field and store pests.\nii. assess their economic importance.\niii. relate various prevention and control methods to different pests.\niv. describe the life cycles of various insects.\nv. apply the knowledge of the life cycles of insect pests to their prevention and control.\nvi. differentiate between common pesticides.\nvii. examine their mode of action on pests.\n\n \n15. Forest management (Silviculture)\n\n \n\nTopics:\n\n \n\na. Importance: Source of wood, pulp, fibre and other forest products\nb. Conservation: regulation, exploitation, regeneration, afforestation, agro-forestry and taungya system\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\nrelate various forest products to their uses.\ni. compare different forest conservation methods.\nii. apply the various methods appropriately\n\n \n16. Crop improvement\n\n \n\nTopics:\n\n \n\nMethods of crop improvement e.g. introduction, selection, crossing, quarantine e.t.c.\n\n \n\nTopics:\n\n \n\nCandidates should be able to:\n\ni. give reasons for crop improvement.\nii. distinguish between various methods of crop improvement.\n\n \nSECTION C: Animal Production\n\n \n1. Forms and classification of major farm animals in West Africa\n\n \n\nTopics:\n\n \n\na. Species, breeds and distribution\n\nb. External features of cattle, sheep, goat, pigs, rabbits and poultry\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\ni. classify various breeds of farm animals.\nii. locate where they are found.\n\niii. identify their characteristic features.\n\n \n2. General terminology in animal production\n\n \n\nTopics:\n\n \n\nCommon terms used in animal husbandry, e.g. calving, kidding, castrate, capon, veal, mutton, e.t.c.\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\n(i) use various terms in animal husbandry.\n\n \n3. Anatomy and physiology of farm animals\n\n \n\nTopics:\n\n \n\na. Functions of tissues and organs of farm animals\n\nb. Animal body systems e.g. digestive (ruminants and non-ruminants), reproductive, respiratory, urinary (excretory) and nervous systems.\nc. Effect of environmental changes on physiological development of farm animals e.g climate change\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\n    distinguish between various functions of tissues and organs of farm animals.\n    compare different body systems in farm animals.\n    determine the effects of climate change on farm animals\n\n \n4. Reproduction in farm animals\n\n \n\nTopics:\n\n \n\na. Gametogenesis, oestrus cycle, signs of heat and heat periods, secondary sexual characters, gestation periods, parturition and the role of hormones in reproduction.\n\nb. Development, nourishment and birth of the young. Mammary glands and lactation in farm animals.\nc. Egg formation, incubation and hatching in poultry.\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\ni. give an account of the process of reproduction in farm animals.\nii. determine the role of hormones in reproduction.\n\niii. trace the development in farm animals from fertilization to birth and care of the young.\n\niv. trace the process of egg formation and incubation in poultry.\n\n \n5. Animal nutrition\n\n \n\nTopics:\n\n \n\na. Feed nutrients and functions\n\nb. Feeds and feeding: Simple ration formulation - balanced ration, common pasture/forage crops e.g. guinea grass, elephant grass, giant star grass. Andropogon sp, Calopogonium sp. Hay and silage preparation, different types of rations, namely maintenance ration and production ration.\n\nc. Nutrient deficiencies: Causes and symptoms of malnutrition and their correction in farm animals.\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\nidentify the various feed nutrients, their sources and functions.\ni. differentiate between the types of animal feeds and their formulation.\nii. relate the various types of rations to different classes of livestock.\n\ni. trace symptoms to nutrient deficiencies in farm animals.\nii. apply appropriate corrective measures to nutrient deficiencies in farm animals.\n\n \n6. Livestock management\n\n \n\nTopics:\n\n \n\nHousing, feeding, sanitation and veterinary care of ruminants, pigs, rabbits and poultry under intensive, semi-intensive and extensive systems of management from birth to slaughter.\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\n    apply the different management practices for farm animals.\n\n \n7. Animal Health\n\na. Animal diseases (pathology)\ni. Environmental factors, predisposing animals to diseases; causal organisms, symptoms, transmission and effects.\nii. Preventive and curative methods for diseases caused by viruses, bacteria, fungi and protozoa.\n\nb. Parasites (parasitology)\ni. Life cycles and economic importance of livestock parasites e.g. endoparasites, ectoparasites and disease vectors.\n\nii. Prevention and control\n\n    dipping\n    spraying\n    deworming\n    sanitation\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\ni. identify diseases of farm animals and causative agents.\nii. classify livestock diseases based on symptoms and mode of transmission.\niii. apply appropriate preventive and curative measures against diseases caused by these pathogens.\ni. classify livestock parasites.\nii. determine their role in disease transmission.\niii. trace life cycles of parasites from egg to adult stage.\n\niv. apply appropriate prevention and control methods against livestock parasites.\n\n \n8. Fisheries and Wildlife\n\n \n\nTopics:\n\n \n\na. Fish culture systems; Common types of fishes e. g Tilapia, Catfish, etc.\ni. Extensive systems: inland and deep sea fishing, lakes and rivers.\nii. Semi-intensive systems: dams\niii. Intensive systems: fish ponds -\nFactors to consider in ponds establishment and pond management e.g. pond fertilization, liming and desilting.\n\nb. Fish harvesting and processing methods\ni. Use of drag nets, hook and line, etc.\nii. Curing, sun-drying and smoking.\n\niii. Fishery regulations\n\nc. Wildlife management\n\nd. Habitat conservation, feeding, domestication, harvesting, processing and wildlife regulations.\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\ni. identify the common types of fishes in West Africa.\nii. differentiate between various systems of fish farming in West Africa.\niii. determine the factors to be considered in intensive fish farming.\n\ni. assess the advantages and disadvantages of different fish harvesting and processing methods.\nii. use the various methods of catching fish.\niii. apply the various methods of fish preservation.\n\napply fishery regulations in Nigeria.\n\ni. identify animals found in West African game reserves.\nii. give reasons for the establishment of game reserves.\niii. apply common wildlife regulations.\n\n \n9. Bee-keeping (Apiculture)\n\n \n\nTopics:\n\n \n\na. Meaning and importance of apiculture\nb. Types of bees e.g exotic and indigenous bees\nc. Methods of bee-keeping e.g traditional and modern bee-keeping\nd. Equipment and safety measures in bee-keeping\n\n \n\nObjectives: Candidates should be able to:\n\n    relate bee-keeping to economic development\n    differentiate between various types of bees\n    classify methods of bee-keeping\n    identify bee-keeping equipment and their uses\n\n \n10. Animal Improvement\n\n \n\nTopics:\n\nMethods of animals improvement e. g. introduction, breeding, quarantine and selection: Breeding systems - inbreeding, line-breeding, cross-breeding, artificial insemination\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\ni. give reasons for animal improvement.\nii. differentiate between the various methods of animal improvement.\n\n \nSECTION D: Agriculture Economics and Extension\n\n \n1. Factors of agricultural production\n\n \n\nTopics:\n\n \n\na. Land: i. Types of land ownership in West Africa\n\nb. Labour\n\nc. Capital\n\nd. Management\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\ni. understand the meaning of land and state its uses\nii. identify the various forms of land ownership.\niii. examine their effects of land ownership on agriculture.\niv. differentiate between the various features of land and their effects on land use.\n\n    differentiate between the types and sources of labour and their effects on agricultural production.\n    compare the sources of capital and associated problems.\n    determine the function of a farm manager in an agricultural enterprise.\n\n \n2. Basic Economic Principles\n\n \n\nTopics:\n\n \n\na. Demand and supply\n\nb. Production function:\nInput/input, Output/output\nInput/output relationships; stages of production, concepts of diminishing returns, scale of preference and choice.\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\ni. relate demand to supply in agricultural production.\nii. interpret geographical representation of demand and supply.\niii. relate input to output.\niv. deduce economic concepts from graphic representation.\n\n \n3. Characteristic Features of Agricultural Production\n\n \n\nTopics:\n\n \n\nSmallness of farm holdings: biological limits of farm production and susceptibility of farm production to climate, seasonality of farm productions, price elasticity in demand and supply of agricultural produce.\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\ni. distinguish between the common features of agricultural production and produce.\nii. compute elasticity of demand and supply.\n\n \n4. Labour Management\n\n \n\nTopics:\n\n \n\na. Labour relations: Supervision, etc.\n\nb. Types of labour: Permanent labour etc.\n\nc. National labour laws and regulations\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\n    identify the various ways of achieving labour efficiency.\n    differentiate between the various types and sources of labour.\n    apply national labour laws and regulations.\n\n \n5. Farm Management\n\n \n\nTopics:\n\n \n\na. Qualities, functions and problems of farm manager.\n\nb. Records and record-keeping: Types and importance of record-keeping - livestock records, profit and loss account book.\n\nc. Stock evaluation:\ni. gross and net profits in farm management.\nii. Appreciation, depreciation and savage value\n\nd. Agricultural insurance:\ni. Meaning, importance and types of agricultural insurance\nii. Problems of agricultural insurance\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\nidentify the qualities, functions and problems of a\nfarm manager.\n\ni. differentiate between the types of farm records.\nii. give reasons for keeping farm records.\n\n \n\ndetermine gross and net margins, appreciation, depreciation and salvage value\n\ni. examine the relevance of agricultural insurance\nii. determine the appropriate agricultural insurance scheme\niii. determine the problems associated with agricultural insurance\n\n \n6. Marketing of Agricultural Produce\n\n \n\nTopics:\n\n \n\na. Importance of Marketing.\nb. Marketing channels.\n\nc. Characteristic features of agricultural product affecting their marketing\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\nevaluate the importance of agricultural marketing\ni. classify marketing agents and their functions.\nii. determine the various ways in which marketing channels pose problems in agricultural production.\niii. determine the characteristics of agricultural products affecting their marketing.\n\n \n7. Agricultural Extension\n\n \n\nTopics:\n\n \n\na. Meaning and importance.\nb. The role of Agricultural Development programmes, universities, research institutes and farmers' organizations (Cooperative societies).\n\nc. Extension methods including demonstration plots, use of visual aids, mass media, etc.\n\nd. Problems of agricultural extension in West Africa and possible solutions.\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\n    identify the importance of agricultural extension.\n    analyse the roles of government and non-governmental organizations in agricultural extension education.\n    differentiate between the various extension methods.\n\ni. examine the problems of agricultural extension in West Africa.\nii. provide possible solutions.\n\n \nSECTION E: Agricultural Technology\n\n \n1. Farm surveying and farmstead planning\n\n \n\nTopics:\n\n \n\na. Meaning and importance\nb. Common surveying equipment, their uses and care\nc. Common survey methods\nd. Principles of farmstead outlay.\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\n    examine the relevance of farm surveying to agriculture.\n    classify common surveying equipment, their uses and care.\n    differentiate between the common survey methods.\n    apply survey principles to farmstead outlay.\n\n \n2. Simple farm tools\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\ni. identify simple farm tools.\nii. use and maintain farm tools.\niii. compare the advantages and disadvantages of simple farm tools.\n\n \n3. Farm machinery and implements\n\n \n\nTopics:\n\n \n\na. Types\ni. Machinery e.g tractor, milking machine etc\nii. Implements\nb. Uses and maintenance of farm machinery and implements\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\nidentify common farm machinery and implements.\ni. classify farm machinery according to their uses.\nii. apply appropriate maintenance routines on farm machines and implements.\niii. operate farm machines and implements.\n\n \n4. Mechanization and sources of farm power\n\n \n\nTopics:\n\n \n\na. Sources of farm power e. g. animal and machines\nb. Advantages and disadvantages of agricultural mechanization\nc. Problems and prospects of mechanized agriculture in West Africa\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\n    compare the advantages and disadvantages of various sources of farm power and their application.\n    distinguish between the advantages and disadvantages of mechanization.\n    assess the problems and prospects of mechanized agriculture in West Africa.\n\n \n5. Processing and storage\n\n \n\nTopics:\n\n \n\na. Processing: traditional and modern methods of food processing e.g. gari, rice and groundnut processing, etc.\n\nb. Storage\n\n \n\nObjectives:\n\n \n\n \n\nCandidates should be able to:\n\ni. identify the importance of agricultural processing.\nii.differentiate between the various methods of processing agricultural produce.\ni. compare different storage methods.\nii.apply different storage methods.\n\n \n6. Introduction to biotechnology\n\n \n\nTopics:\n\n \n\nBasic terms, e.g. tissue and anther culture in vitro fertilization and genetic engineering\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\ni. use basic terms in biotechnology.\nii. provide reasons for the importance and application of biotechnology.\n\n \n7. Application of ICT in agriculture\n\n \n\nTopics:\n\n \n\na. Features of computers\nb. Uses of computers in agriculture: disease and weather forecasting, ration formulation, database and simulation studies, etc.\nc. Use of communication gadgets e.g mobile phone, internet, etc.\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\n    identify the various components of a computer.\n    use the computer to enhance agricultural practices.\n    use communication gadgets to enhance agricultural production.\n\n \n8. Introduction to agricultural research and statistics\n\n \n\nTopics:\n\n \n\na. Basic concepts in planning agricultural experiments e.g hypothesis, treatment and control, etc\nb. Interpretation of results, e.g. measures of central tendency and experimental errors.\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\nuse basic concepts in agricultural experiments.\n\ni. draw inferences from experimental results.\nii. compute simple measures of central tendency.\n\n \n \nRECOMMENDED TEXTS\n\n \n\nAdeniyi, M. O. et al (1999) Countdown to Senior Secondary Certificate Examination Agricultural Science, Ibadan: Evans\n\nAkinsanmi, A. O. (2000) Junior Secondary Agricultural Science, Uk: Longman.\n\nAkinsanmi, O. A. (2000) Senior Secondary Agricultural Science, Uk: Longman.\n\nAnthonio, Q. B. O. (1999) General Agriculture for West Africa, London: George Allen\n\nAre, L. A. et al (2010) Comprehensive Certificate Agricultural Science for Senior Secondary School, University Press Plc.\n\nEgbuna, C. K. et al (2014) Extension Modern Agricultural Science for Senior Secondary Schools (2010), Extension Publication\n\nEmmanuel C. A. (2003) A Dictionary of Agriculture, Benue: Agitab Publisher Makurdi\n\nFalusi, A. O. and Adeleye, I. O. A (2000) Agricultural Science for Junior Secondary Schools Books 1- 3, Ibadan: Onibonoje\n\nKomolafe, M. F., Adegbola, A. A., Are, L. A. and Ashaye, T. I. (2004) Agricultural Science for Senior Secondary Schools 1, 2 and 3, Ibadan: University Press Ltd.\n\nPhilips T. A. (1986) Agricultural Notebook, Lagos: Longman\n\nSTAN (1999) Agricultural Science for Senior Secondary Schools, Lagos: Longman"
}