{
  "chapIndex": "",
  "text": "SECTION A: COMPREHENSION\n\nIt consists of a passage of seventy (70) words. Five multiple-choice questions are to be set on the passage. The contents should be within the experience of the candidates e.g. current affairs, sports, education, politics, economy, health, culture and ethics.\n\n \n\nCandidates should be able to:\ni. use appropriate words or phrases for specific thought;\nii. deduce the lesson in the passage;\niii. determine the main theme of the passage;\niv. give an appropriate title of a passage;\nv. interpret the meanings of particular words\n\n \nSECTION B: TRANSLATION\n\nThis section consists of ten (10) questions. Five of them are on translation from English into Arabic while the other five are on translation from Arabic into English.\nTranslation into English includes key words and phrases in a sentence.\nTranslated questions are to be based on standard Arabic and English usages.\n\n \n\nCandidates should be able to:\ni. use an appropriate Arabic word or phrase to convey the meaning of an English word or phrase;\nii. determine an appropriate English word or phrase for an Arabic statement;\niii. interpret idiomatic expressions in both Arabic and English;\niv. transfer ideas expressed in Arabic to English and vice versa;\nv. communicate effectively in Arabic and English. SECTION C: GRAMMAR\n \n\nMajor grammatical features in Arabic to be examined include:\n\n1 .أسماء اإلشارة والموصولة. 1. Demonstrative and relative pronouns.\n2 .المذكر والمؤنث2. Gender (Masculine and Feminine).\n3 .عالمات االسم3. Characteristics of noun.\n4 .المثنى. 4. Dual.\n5 .الجموع: 5. Plurals: أ – جمع المذكر السالم. a. sound masculine plural ب – جمع المؤنث السالم b. sound feminine plural ج – جمع التكسير c. broken plural\n6 .المضاف والمضاف إليه. 6. Construct phrases.\n7 .الضمائر المنفصلة و المتصلة 7. Separable and inseparable pronouns.\n8 .التوابع: 8. Appendants: أ – النعت. .adjective. a ب – العطف. .conjunction. b c. the permutative. .البدل – ج د – التوكيد. emphasis. d\n9 .حروف الجر 9. Prepositions.\n10 .الفعل الالزم والفعل المتعدي. 10. Transitive & Intransitive verbs.\n11 .الفعل الماضى 11. The perfect verb.\n12 .الفعل المضارع: 12. The imperfect verb: a. the indicative. المرفوع – أ b. the subjunctive. المنصوب – ب c. the jussive. .المجزوم – ج\n13 .الفعل األمر. 13. The imperative verb.\n14 .النواسخ: 14. The modifiers: أ – كان و أخواتها a. Kana and its associates ب – إن و أخواتها b. Inna and its associates ج – ظن و أخواتها c. Zanna and its associates\n15 .الفعل الثالثي المجرد و المزيد فيه. 15. Trilateral and derived verbs.\n16 .المشتقات: 16. Derivatives: أ – اسم التفضيل. a. the comparative/superlative. ب – اسم اآللة. b. nouns of instrument. ج – اسما الزمان و المكان c. nouns of time and place. د – اسم النسبة. d. relative adjectives.\n17 .الجملة الشرطية 17. Conditional sentences. )فقط 3000 – 1( العدد. 18\n18. Numerals (1 – 3000).\n19 .الفاعل و نائب الفاعل. 19. Active and passive voice.\n20 .منصوبات األسماء: 20. Nouns in the accusative أ – المفعول به. a. direct object. ب – المفعول فيه )ظرف(. b. adverbs of place and time. ج – الحال. c. adverb of circumstance. د – المستثنى بإال. d. the exempted with illa. هـ - التمييز. e. specification. و – المنادى. f. the vocative\n\n \n\nCandidates should be able to:\ni. identify the various forms of demonstrative and relative pronouns;\nii. compare gender markers in Arabic;\niii. identify the three basic characteristics of Arabic nouns;\niv. differentiate between singular and dual forms of nouns;\nv. construct plural forms of singular nouns;\nvi. identify construct phrases and their usages;\nvii. differentiate between separable and inseparable pronouns;\nviii.identify correct usage of adjectives, conjunctions and the permutative in Arabic sentences;\nix. apply correct preposition in a given sentence;\nx. differentiate between transitive and intransitive verbs and use them in sentences;\nxi. identify the perfect verbs and their forms;\nxii. identify the imperfect verbs and their grammatical words in sentences;\nxiii.identify the imperative verbs and their forms;\nxiv. identify the kinds of modifiers and apply them in Arabic usage;\nxv. differentiate between trilateral and derived verbs;\nxvi. identify the types of derivatives;\nxvii. apply the rules governing conditional sentences, identify them in sentences, construct them and differentiate them in normal sentences;\nxviii. recognise and count Arabic numerals from 1 to 3000 and identify the intricacies involved in their usage;\nxix. distinguish between active and passive voice and apply them in sentences;\nxx. identify different types of adverbial clause, the exempted, specification and the vocative as well as identify and use them in standard Arabic;\n\n \nSECTION D: COMPOSITION\n\nThis section consists of five (5) questions on subjects relating to the lives and environment of the candidates, e.g. education, culture, health, politics, economy, sports and current affairs.\n\n \n\nCandidates should be able to:\ni.. use appropriate words for specific thoughts;\nii. use correct idiomatic expressions in Arabic;\niii. communicate effectively in Arabic;\niv. express ideas clearly in Arabic;\nv. demonstrate the use of common Arabic idioms and proverbs;\n\n \nSECTION E: ARABIC LITERATURE\n\nThis section consists of ten (10) questions on notable literary figures and their works cutting across the various periods which include the following: أ – العصر الجاهلي )حوالى 500 – 610م\n\n(. a) The Pre-Islamic Period (500 – 610 C.E.). - قس بن ساعدة و خطبته \"من عاش مات\" - تماضر الخنساء ورثاء ها \" صخر الندى\". ب – العصور اإلسالمية )610 – 1798م\n (. b) The Islamic Period (610 – 1798 C.E.). - الفرزدق ومدحه لزين العابدين: \"هذا الذي تعرف البطحاء وطأته\". - حسان بن ثابت وقصيدته في فتح مكة: \"عدمنا خيلنا إن لم تروها\" - جرير وشعره \"أشجان الهوى\": \"لقد كتمت الهوى حتى تهيمني\"\n\n(c) ج – العصر الحديث )1798م إلى اليوم(.c) The Modern Period (1978 to date). - المنفلوطي وكتابه العبرات :\"قصة الحجاب\". - إيليا أبو ماضي وشعره :\"لم تشتكي وتقول إنك معدم\"\n\nd) Arabic Literature In West Africa . - زكريا إدريس حسين ومسرحيته: \"الطبقة العليا\". - جميل عبد هللا الكنوي: \"ادفع بالتي هي أحسن\"ج – العصر الحديث )1798م إلى اليوم(.\n\n \n\nCandidates should be able to:\ni. identify pre-Islamic poetic traditions and conventions;\nii. identify and analyze the style of figurative expressions contained in a given Islamic literature;\niii. describe the aesthetic features in literary texts and assess their modern cultural values;\niv. evaluate areas of successful use of Arabic as a medium of West African novel and drama, analyse their contents and describe their major characteristics and plots\n\n \n\n \nRECOMMENDED TEXTS\n1. COMPREHENSION, COMPOSITION AND TRANSLATION\n\n1 .بشير أحمد محيي الدين و المرضي مختار المرضي: المطالعة الواضحة. كنو: شركة طن المى و أبنائه.\n2 .سيد حمرة مالك: اإلنشاء العربى المتوسط )للمدارس الثانوية( إبادن مطبعة الجامعة ب. ل. س. 2005م\n3 .عبد الفتاح صبرى و علي عمر بك: القراءة الرشيدة. الجزء 1 – 4 القاهرة: دار المعارف.\n4 .عبد هللا الطيب: سمير التالميذ الجزء 1 – 2 الخرطوم: مكتب النشر.\n5 .غرب ط. زاريا )1999م(: كيف تكتب اإلنشاء: كنو مطبعة جامعة بايرو\n6 .محمد األول أبوبكر و اآلخرون: العربية الميسرة الجديدة للمرحلة الثانوية. إبادن: دار سبكترم للطباعة و النشر\n7 .محمد بديع شريف و سليم حكيم و الحاج حسين آدمو: العربية الجديدة فى نيجيريا. الكتاب 1 – 3 إكيجا: لونغمان\n8. Adekilekun, A. L. A.: Learning Arabic Language, Ilorin.\n9. Balogun, I. A. B. and Oseni Z. I. (1982) A Modern Arabic Course Book 1 Lagos: Islamic Publications Bureau.\n10. Haywood, J. A. and Nahmad, H. M. (1965), A New Arabic Grammar of the Written Language, London: Lund Humphries.\n11. Malik, S. H. A. (1982) A Guide to Arabic Composition, Books I & II, Lagos I.P.B.\n12. Arabic newspapers, magazines and journals.\n\n \n2. GRAMMAR\n\n1 .على الجارم و مصطفى أمين: النحو الواضح لمدارس المرحلة األولية. الجرء 1 – 3 .القاهرة: دار المعارف\n2 .محمد أجروم الصنهاجى: متن األجرومية. القاهرة.\n3 .محمد محيي الدين عبد الحميد: التحفة السنية بشرح المقدمة األجرومية. بيروت: دار الفكر\n4. Haywood, J.A and Nahmad, H.M (1965), A New Arabic Grammar of the Written Language, London: Lund Humphries.\n3. ARABIC LITERATURE\n\n1 -زكريا حسين: المأدبة األدبية للطالب العربية في إفريقيا أوتثى: دار NECO/WAEC م2004 ا\n2 -زكريا حسين: الطبقة العليا: دار النور أوتثى 2006م WAEC/NECO\n3 -مصطفى لطفي المنفلوطي: العبرات بيروت والقاهرة )2004)WAEC/NECO\n4 -جميل عبد هللا الكنوي: ادفع بالتي هي أحسن مكتبة الحكمة اإلسالمية NECO/WAEC )2013( ك\n5 -أحمد االسكندري واآلخرون: المفصل في تاريخ األدب العربي NECO/WAEC\n \n\n \nTRANSLITERATION OF THE ABOVE BOOKS\n \n\n1- ZAKARIYAU I. OSENI: AL-MA’DUBAT AL-ADABIYYAH.\n2- ZAKARIYAU I. OSENI: AL-TABAQATAL-ULYA (THE UPPER CLASS)\n3- MUSTAPHA LUTFI AL-MANFALUTI: AL-ABARAT.\n4- JAMIL ABDULLAHI ALKANAWI: IDFA’A BIL LATI HIYA AHSAN.\n5- AHMAD AL-ASKANDARI WAL AKHARUN: ALMUFASSAL FI TARIKH AL-ADABUL ARABI."
}