{
  "chapIndex": "",
  "text": "A: VARIETY OF ORGANISMS\n\n \n1. Living organisms:\n\n \n\nTopics:\n\n\na. Characteristics\nb. Cell structure and functions of cell Components\nc. Level of organization\ni. Cell e.g. euglena and paramecium,\nii. Tissue, e.g. epithelial tissues and hydra\niii. Organ, e.g. onion bulb\niv. Systems, e.g. reproductive, digestive and excretory\nv. Organisms e.g. Chlamydomonas\n\n \n\nObjectives: \n\nCandidates should be able to:\ni. differentiate between the characteristics of living and non-living things.\nii. identify the structures of plants and animal cells.\niii. analyse the functions of the components of plants and animal cells.\niv. compare and contrast the structure of plant and animal cells.\nv. trace the levels of organization among organisms in their logical sequence in relation to the five level of organization of living organisms.\n\n \n2. Evolution among the following:\n\n \n\nTopics\n\n \n\na. Monera (prokaryotes), e.g. bacteria and blue green algae.\nb. Protista (protozoans and protophyta),\ne.g. Amoeba, Euglena and Paramecium\nc. Fungi, e.g. mushroom and Rhizopus.\nd. Plantae (plants)\ni. Thallophyta (e.g. Spirogyra)\nii. Bryophyta (mosses and liveworts) e.g. Brachmenium and Merchantia.\niii. Pteridophyta (ferns) e.g. Dryopteris.\niv. Spermatophyta (Gymnospermae and Angiospermae)\n- Gymnosperms e.g. Cycads and conifers.\n- Angiosperms (monocots, e.g. maize; dicots, e.g. water leaf)\ne. Animalia (animals)\ni. Invertebrates\n- coelenterate (e.g. Hydra)\n- Platyhelminthes (flatworms) e.g. Taenia\n- Nematoda (roundworms)\n- Annelida (e.g. earthworm)\n- Arthropoda e.g. mosquito, cockroach, housefly, bee, butterfly\n- Mollusca (e.g. snails)\nii. Multicellular animals (vertebrates)\n- pisces (cartilaginous and bony fish)\n- Amphibia (e.g. toads and frogs)\n- Reptilia (e.g. lizards, snakes and turtles)\n- Aves (birds)\n- Mammalia (mammals)\n\n \n\nObjectives: \n\nCandidates should be able to:\ni. analyse external features and characteristics of the listed organisms:\nii. apply the knowledge from (i) above to demonstrate increase in structural complexity .\niii. trace the stages in the life histories of the listed organisms.\niv. apply the knowledge of the life histories to demonstrate gradual transition from life in water to life on land.\nv. trace the evolution of the listed plants.\nCandidates should be able to:\ni. trace the advancement of the invertebrate animals.\nii. determine the economic importance of the insects studied.\niii. asses their values to the environment.\ni. trace the advancement of multi-cellular animals.\nii. determine their economic importance.\n\n \n3.a Structural/functional and behavioural adaptations of organisms.\n\n \n\nTopics: \n\n\nb. adaptive colouration and its functions\nc. Behavioural adaptations in social animals\nd. Structural adaptations in organisms.\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. describe how the various structures, functions and behaviour adapt these organisms to their environment, and way of life\n\nCandidates should be able to:\ni. Categorize countershading in fish, toads and snakes and warning colouration in mushrooms.\n\nCandidates should be able to:\ni. Differentiate various castes in social insects like termites and their functions in their colony hive.\nii. Account for basking in lizards, territorial behavour of other animals under unfavourable conditions (hibernation and aestivation).                                                       \n\nCandidates should be able to account for adaptation in organisms with respect to the following:\ni. Obtaining food (beaks and legs of birds, mouthparts of insects especially mosquito, butterfly and moth.)\nii. Protection and defence (stick insects, praying mantis and toad).\niii. Securing mates (redhead male and female Agama lizards, display of fathers by birds).\niv. Regulating body temperature (skin, feathers and hairs)\nv. Conserving water (spines in plants and scales in mammals).\n\n \nB: FORM AND FUNCTIONS\n\n \n1. Internal structure of a flowering plant\n\n \n\nTopics: \n\ni. Root\nii. Stem\niii. Leaf\nb. Internal structure of a mammal\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. identify the transverse sections of these organs.\na. relate the structure of these organs to their functions.\nb. Identify supporting tissues in plants (collenchyma) sclerenchyma, xylem and phloem fibres)\nc. Describe the distribution of supporting tissues in roots, stem and leaf                                                                                                                                                                     \n\nCandidates should be able to:\ni. examine the arrangement of the mammalian internal organs.\nii. describe the appearance and position of the digestive, reproductive and excretory organs.\n\n \n2. Nutrition\n\n \n\nTopics:\n\na. Modes of nutrition\ni. Autotrophic\nii. Heterotrophic\nb. Types of Nutrition\nc. Plant nutrition\ni. Photosynthesis\nii. Mineral requirements (macro and micro-nutrients)\nd. Animal nutrition\ni. Classes of food substances; carbohydrates, proteins, fats and oils, vitamins, mineral salts and water\nii. Food tests (e.g. starch, reducing sugar, protein, oil, fat etc.\niii. The mammalian tooth (structures, types and functions\niv. Mammalian alimentary canal\nv. Nutrition process (ingestion, digestion, absorption, and assimilation of digested food.\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. compare the photosynthetic and chemosynthetic modes of nutrition;\nii. provide examples from both flowering and non- flowering plants\niii. compare autotrophic and heterotrophic modes of nutrition.                                                                                                                                                                         \n\nCandidates should be able to:\ndifferentiate the following examples:\n- holozoic (sheep and man)\n- Parasitic (roundworm, tapeworm and Loranthus)\n- saprophytic (Rhizopus and mushroom)\n- carnivorous plants (sundew and bladderwort)\n- determine their nutritional value.                                                                                                                                                                                                                         \n\nCandidates should be able to:\ni. Differentiate the light and dark reactions, and state conditions necessary for photosynthesis.\nii. determine the necessity of light, carbon (IV) oxide and\nchlorophyll in photosynthesis.                                                                                                                iii. detect the presence of starch in a leaf as an evidence of photosynthesis.                                                                                                                                                               \n\nCandidates should be able to:\ni. identify macro-and micro-elements required by plants.\nii. recognise the deficiency symptoms of nitrogen, phosphorous and potassium.\n\nCandidates should be able to:\n\ni. indicate the sources of the various classes of food;\n\nii. relate the importance and deficiency e.g. scurvy, rickets, kwashiorkor etc. of each class;iii. determine the importance of a balanced diet.\n\nCandidates should be able to detect the presence of the listed food items from the result of a given experiment.\n\nCandidates should be able to:\n\ni. describe the structure of a typical mammalian tooth;\n\nii. differentiate the types of mammalian tooth and relate their structures to their functions.\n\niii. compare the dental formulae of man, sheep,and dog.\n\nCandidates should be able to:\n\ni. relate the structure of the various components of the alimentary canal and its accessory organs (liver, pancreas, and gall bladder) to their functions.\n\nCandidates should be able to:\n\ni. identify the general characteristics of digestive enzymes;\n\nii. associate enzymes with digestion of carbohydrates,proteins and fats;\n\niii. determine the end products of these classes of food 3. Transport\n\n \n\nTopics:\n\n\na. Need for transportation\nb. Materials for transportation. (Excretory products, gases, manufactured food, digested food, nutrient, water and hormones)\nc. Channels for transportation\ni. Mammalian circulatory system (heart, arteries, veins, and capillaries)\nii Plant vascular system (phloem and xylem)\nd. Media and processes of mechanism for transportation.\n\n \n\nObjectives:                                                                                                                                     Candidates should be able to:\ni. determine the relationship between increase in size and complexity and the need for the development of a transport system in plants and animals.\nCandidates should be able to:\ni. determine the sources of materials and the forms in which they are transported.\n\nCandidates should be able to:\ni. describe the general circulatory system;\nii. compare specific functions of the hepatic portal vein, the pulmonary vein and artery, aorta, the renal artery and vein\n\nCandidates should be able to:\ni. identify the organs of the plant vascular system.\nii. understand the specific functions of the phloem and xylem.\n\nCandidates should be able to:\ni. identify media of transportation (e.g. cytoplasm, cell sap, body fluid, blood and lymph);\nii. know the composition and functions of blood and lymph;\niii. describe diffusion, osmosis, plasmolysis and turgidity as mechanism of transportation in organisms.\niv. compare the various mechanisms of open circulatory systems, in animal transpiration pull, root pressure and active transport as mechanism of transportation in plants.\n\n \n4. Respiration\n\n \n\nTopics:\n\na. Respiratory organs and surfaces\nb. The mechanism of gaseous exchange in:\ni. Plants\nii. Mammals\nc. Aerobic respiration\nd. Anaerobic respiration\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. examine the significance of respiration;\nii. describe a simplified outline of the chemical process involved in glycolysis and krebs cycle with reference to the role ATP\niii deduce from an experimental set up, gaseous exchange and products, exchange and production of heat energy during respiration.\nCandidates should be able to:\ni. describe the following respiratory organs and surfaces with organisms in which they occur; body surface, gill, trachea, lungs, stomata and lenticel.\nCandidates should be able to:\ni. describe the mechanism for the opening and closing of the stomata;\nii. determine respiratory movements in these animals.\nCandidates should be able to:\niii. examine the role of oxygen in the liberation of\nenergy for the activities of the living organisms;\niv. deduce the effect of insufficient supply of oxygen to the muscles.\nCandidates should be able to:\ni. use yeast cells and sugar solution to demonstrate the process of fermentation.                             ii. know the economic importance of yeasts.\n\n \n5. Excretion\n\n \n\nTopics:\n\na. Types of excretory structures: contractile vacuole, flamecell, nephridium, Malpighian tubule, kidney, stoma and lenticel.\nb. Excretory mechanisms:\ni. Kidneys\nii. lungs\nii. skin\nc. Excretory products of plants\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. define the meaning and state the significance of excretion;\nii. relate the characteristics of each structure with functions.\nCandidates should be able to:\ni. relate the structure of the kidneys to the excretory and osmo-regulatory functions.\nii. identify the functions and excretory products of the lungs and the skin.\nCandidates should be able to:\ni. deduce the economic importance of the excretory products of plants, e.g carbon (IV) oxide, oxygen, tannins, resins, gums, mucilage, alkaloids etc.\n\n \n6. Support and movement\n\n \n\nTopics:\n\n\na. Tropic, tactic, nastic and sleep movements in plants\nb. supporting tissues in animals\nc. Types and functions of the skeleton\ni. Exoskeleton\nii. Endoskeleton\niii. Functions of the skeleton in animals\n\n \n\nObjectives: \n\nCandidates should be able to:\ni. determine the need for support and movement in organisms;\nii. identify supporting tissues in plants (collenchyma, sclerenchyma, xylem and phloem fibres);\niii. describe the distribution of supporting tissues in roots, stem, and leaf.\nCandidates should be able to:\ni. relate the response of plants to the stimuli of light, water, gravity and touch;\nii. identify the regions of growth in roots and shoots and the roles of auxins in tropism.\nCandidates should be able to:\ni. relate the location of chitin, cartilage and bone to their supporting function.\nii. relate the structure and the general layout of the mammalian skeleton to their supportive, locomotive and respiratory function.\niii. differentiate types of joints using appropriate examples.\nCandidates should be able to:\ni. apply the protective, supportive, locomotive and respiratory functions of the skeleton to the well being of the animal.\n\n \n7. Reproduction\n\n \n\nTopics:\n\n\na. A sexual reproduction\ni. Fission as in Paramecium\nii. Budding as in yeast\niii. Natural vegetative propagation\niv. Artificial vegetative propagation.\nb. sexual reproduction in flowering plants\ni. Floral parts and their functions\nii. Pollination and fertilization\niii. products of sexual reproduction\nc. Reproduction in mammals\ni. structures and functions of the male and female reproductive organs\nii. Fertilization and development. (Fusion of gametes)\n\n \n\nObjectives: \n\nCandidates should be able to:\ni. differentiate between asexual and sexual reproduction\nii. apply natural vegetative propagation in crop production and multiplication.\niii. apply grafting, budding and layering in agricultural practices.\nCandidates should be able to:\ni. relate parts of flower to their functions and reproductive process\nii. deduce the advantages of cross pollination.\niii. deduce the different types of placentation that develop into simple, aggregate, multiple and succulent fruits.\nCandidates should be able to:\ni. differentiate between male and female reproductive organs\nii. relate their structure and function to the production of offspring.\nCandidates should be able to:\ni. describe the fusion of gametes as a process of fertilization.\nii. relate the effects of the mother's health, nutrition and indiscriminate use of drugs on the developmental stages of the embryo up to birth.\niv. Modern methods of regulating reproduction on e.g. invitro-fertilization and birth control\n\n \n8. Growth\n\n \n\nTopics:\n\n\na. meaning of growth\nb. Germination of seeds and condition necessary for germination of seeds.\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. apply the knowledge of the conditions necessary for germination on plants growth.\nii. differentiate between epigeal and hypogeal germination.\n\n \n9. Co-ordination and control\n\n \n\nTopics:\n\n\na. Nervous coordination:\ni. the components, structure and functions of the central nervous system;\nii. The components and functions of the peripheral nervous systems;\niii. Mechanism of transmission of impulses;\niv. Reflex action\nb. The sense organs\ni. skin (tactile)\nii. nose (olfactory)\niii. tongue (taste)\niv. eye (sight)\nv. ear (auditory)\nc. Hormonal control\ni. animal hormonal system\n- Pituitary\n- thyroid\n- parathyroid\n- adrenal gland\n- pancreas\n- gonads\nii. Plant hormones (phytohormones)\nd. Homeostasis\ni. Body temperature regulation\nii. Salt and water regulation\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. apply the knowledge of the structure and function of the central nervous system in the coordination of body functions in organisms.\nii. illustrate reflex actions such as blinking of the eyes, knee jerk etc.\niii. differentiate between reflex and voluntary actions as well as conditioned reflexes such as salivation, riding a bicycle and swimming.\nCandidates should be able to:\ni. associate the listed sense organs with their functions.\nii. apply the knowledge of the structure and functions of these sense organs in detecting and correcting their defects.\nCandidates should be able to:\ni. locate the listed endocrine glands in animals.\nii. relate the hormone produced by each of these glands to their functions.\nCandidates should be able to:\ni. examine the effects of various phytohormones (e.g. auxins, gibberellin, cytokinin, and ethylene) on growth, tropism, flowering, fruit ripening and leaf abscission.\nCandidates should be able to:\ni. relate the function of hormones to regulating the levels of materials inside the body.\n\n \nC. ECOLOGY\n\n \n1. Factors affecting the distribution of Organisms\n\n \n\nTopics:\n\n \n\ni. Abiotic\nii. Biotic\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. deduce the effects of temperature; rainfall, relative humidity, wind speed and direction, altitude, salinity, turbidity, pH and edaphic (soil) conditions on the distribution of organisms.\nii. use appropriate equipment (e.g. secchi disc, thermometer, rain gauge etc) to measure abiotic factors.\nCandidates should be able to:\ni. describe how the activities of plants/animals (particularly human) affect the distribution of organisms.\n\n \n2. Symbiotic interactions of plants and animals\n\n \n\nTopics:\n\n\n(a) Energy flow in the ecosystem: food chains, food webs and trophic levels\n(b) Nutrient cycling in nature\ni. carbon cycle\nii. water cycle\niii. Nitrogen cycle\n\n \n\nObjectives: Candidates should be able to:\ni. determine appropriate examples of symbiosis, parasitism, saprophytism, commensalism, mutualism, amensalism, competition, predation and cooperation among organisms.\nii. associate the distribution of organisms with food chains and food webs in particular habitats.\nCandidates should be able to:\ni. food chains and webs\nCandidates should be able to:\ni. describe the cycle and its significance including the balance of atmospheric oxygen and carbon (IV) oxide and global warming.\nCandidates should be able to:\ni. assess the effects of water cycle on other nutrient cycles.\nCandidates should be able to:\ni. relate the roles of bacteria and leguminous plants in the cycling of nitrogen.\n\n \n3. Natural Habitats\n\n \n\nTopics:\n\n\n(a) Aquatic (e.g. ponds, streams, lakes seashores and mangrove swamps)\n(b) Terrestrial/arboreal (e.g. tree-tops of oil palm, abandoned farmland or a dry grassy (savanna) field, and burrow or hole.\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\ni. associate plants and animals with each of these habitats.                                                                  Candidates should be able to:\ni. relate adaptive features to the habitats in which organisms live.\n\n \n4. Local (Nigerian Biomes)\n\n \n\nTopics:\n\n\na. Tropical rainforest\nb. Guinea savanna (southern and northern)\nc. Sudan Savanna\nd. Desert\ne. Highlands of montane forests and grasslands of the Obudu, Jos, Mambilla Plateau.\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. locate biomes in regions\nii. apply the knowledge of the features of the listed local biomes in determining the characteristics of different regions of Nigeria.\n\n \n5. The Ecology of Populations:\n\n \n\nTopics:\n\n\n(a) Population density and overcrowding.\n(b) Adaptation for survival\ni. Factors that bring about competition\nii. Intra and inter-specific competition\niii. Relationship between competition and succession.\n(c) Factors affecting population sizes:\ni. Biotic (e.g. food, pest, disease, predation, competition, reproductive ability).\nii. Abiotic (e.g. temperature, space, light, rainfall, topography, pressure, pH, etc.\n(d) Ecological succession\ni. primary succession\nii. secondary succession\n\n \n\nObjectives: \n\nCandidates should be able to:\ni. determine the reasons for rapid changes in human population and the consequences of overcrowding.\nii. compute/calculate density as the number of organisms per unit area.\nCandidates should be able to:\ni) Relate increase in population, diseases, shortage of food and space with intra- and inter-specific competition.\nCandidates should be able to:\ni) Determine niche differentiation as a means of reducing intra-specific completion.\nCandidates should be able to:\ni) Relate competition to succession.\nCandidates should be able to:\ni. deduce the effect of these factors on the size of population.\ni. determine the interactions between biotic and abiotic factors, e.g. drought or scarcity of water which leads to food shortage and lack of space which causes increase in disease rates.\nCandidates should be able to:\ni. trace the sequence in succession to the climax stage of stability in plant population.\n\n \n6. SOIL\n\n \n\nTopics:\n\n\na) (i) characteristics of different types of soil (sandy, loamy, clayey)\ni. soil structure\nii. porosity, capillarity and humus content\niii. Components of the soil\ni. inorganic\nii. organic\niii. soil organisms\niv. Soil air\nv. Soil water                                                                                                                                             Soil fertility:                                                                                                                  \ni. loss of soil fertility\nii. Renewal and maintenance of soil fertility\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. identify physical properties of different soil types based on simple measurement of particle size, porosity or water retention ability.\nii. determine the amounts of air, water, humus and capillarity in different soil types experimentally.\nCandidates should be able to:\ni. relate soil characteristics, types and components to the healthy growth of plant.\nCandidates should be able to:\ni. relate such factors as loss of inorganic matter, compaction, leaching, erosion of the top soil and repeated cropping with one variety.\nCandidates should be able to:\ni. apply the knowledge of the practice of contour ridging, terracing, mulching, poly-cropping, strip-cropping, use of organic and inorganic fertilizers, crop rotation, shifting cultivation, etc to enhance soil conservation.\n\n \n7. Humans and Environment\n\n \n\nTopics:\n\n\n(a) Diseases:\n(i) Common and endemic diseases.\nii. Easily transmissible diseases and disease syndrome such as:\n- poliomyelitis\n- cholera\n- tuberculosis\n- sexually transmitted disease/syndrome (gonorrhea, syphilis, AIDS, etc.\nb. Pollution and its control\n(i) sources, types, effects and methods of control.\n(ii) Sanitation and sewage\n(c) Conservation of Natural Resources\n(d) Game reserves and National parks\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. identify ecological conditions that favour the spread of common endemic and potentially epidemic disease e.g. malaria, meningitis, drancunculiasis, schistosomiasis, onchocerciasis, typhoid fever and cholera etc.\nii. relate the biology of the vector or agent of each disease with its spread and control.\nCandidates should be able to:\ni. use the knowledge of the causative organisms, mode of transmission and symptoms of the listed diseases to their prevention/treatment/control.\nii. apply the principles of inoculation and vaccination on disease prevention.\nCandidates should be able to:\ni. categorize pollution into air, water and soil pollution.\nii. relate the effects of common pollutants to human health and environmental degradation.\niii. determine the methods by which each pollutant may be controlled.\nCandidates should be able to:\ni. examine the importance of sanitation with emphasis on solid waste sewage disposal, community health and personal hygiene.\nii assess the roles and functions of international and national health agencies (e.g. World Health Organization (WHO), United Nations International Children Emergency Fund (UNICEF), International Red Cross Society (IRCS), and the ministries of health and environment.\nCandidates should be able to:\n(i) apply the various methods of conservation of both the renewable and non-renewable natural resources for the protection of our environment for present and future generations.\n(ii) outline the benefits of conserving natural resources, prevention of desertification.\n(iii) identify the bodies responsible for the conservation of resources at the national and international levels (e.g. Nigerian Conservation Foundation (NCF), Federal Ministry of Environment, Nigeria National Parks, World Wildlife Foundation (WWF), International Union for Conservation of Nature (IUCN), United Nations Environmental Programme (UNEP) and their activities.\n(iv) assess their activities.\nCandidates should be able to:\ni. Know the location and importance of game reserves and National parks in Nigeria\n\n \nD: HEREDITY AND VARIATIONS\n\n \n(I) Variation In Population\n\n \n\nTopics:\n\n\na. Morphological variations in the physical appearance of individuals.\n(i) size (height, weight)\n(ii) Colour (skin, eye, hair, coat of animals, scales and feathers.\n(iii) Fingerprints\nb. Physiological variation\n(i) Ability to roll tongue\n(ii) Ability to taste phenylthiocarbamide (PTC)\n(iii) Blood groups\nc. Application of discontinuous variation in crime detection, blood transfusion and determination of paternity.\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. differentiate between continuous and discontinuous variations with examples.\nii. relate the role of environmental conditions, habitat and the genetic constitution to variation.\nCandidates should be able to:\ni) measure heights and weight of pupils of the same age group;\nii) plot graphs of frequency distribution of the heights and weights.\nCandidates should be able to:\ni) observe and record various colour patterns in some plants and mammals.\nCandidates should be able to:\ni) apply classification of fingerprints in identity detection.\nCandidates should be able to:\ni) identify some specific examples of\nphysiological variation among human population.\nii) categorize people according to their physiological variation.\nCandidates should be able to:\ni) apply the knowledge of blood groups in blood transfusion and determination of paternity.\nii) use discontinuous variation in crime detection.\n\n \n2. Heredity\n\n \n\nTopics:\n\n\na) Inheritance of characters in organisms;\ni) Heritable and non-heritable characters.\nb) Chromosomes - the basis of heredity;\n(i) Structure\n(ii) Process of transmission of hereditary characters from parents to offspring.\nc) Probability in genetics and sex determination.\na) Application of the principles of heredity in:\ni) Agriculture\n(ii) Medicine\nb. Sex - linked characters e.g. baldness, haemophilia, colour blindness, etc.\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. determine heritable and non-heritable characters with examples.\nCandidates should be able to:\ni. illustrate simple structure of DNA\nCandidates should be able to:\ni. illustrate segregation of genes at meiosis and recombination of genes at fertilization to account for the process of transmission of characters from parents to offsprings.\nCandidates should be able to:\ni) deduce that segregation of genes occurs during gamete formation and that recombination of genes at fertilization is random in nature.\nCandidates should be able to:\ni. analyze data on cross-breeding experiments.\nii. apply the principles of heredity in the production of new varieties of crops and livestock through cross-breeding.\niii. deduce advantages and disadvantages of out-breeding and in-breeding.\niv. analyze elementarily the contentious issues of genetically modified organisms (GMO) and gene therapy and biosafety.\nCandidates should be able to:\ni) apply the knowledge of heredity in marriage counselling with particular reference to blood grouping, sickle-cell anaemia and the Rhesus factors.\nii) examine the significance of using recombinant DNA materials in the production of important medical products such as insulin, interferon and enzymes.                             \n\nCandidates should be able to:\ni) identify characters that are sex linked.\n\n \nE: EVOLUTION\n\n \n1. Theories of evolution\n\n \n\nTopics:\n\n\na) Lamarck's theory\nb) Darwin's theory\nc) organic theory\n\n \n\nObjectives:\n\nCandidates should be able to:\ni.) relate organic evolution as the sum total of all adaptive changes that have taken place over a long period of time resulting in the diversity of forms, structure and functions among organisms.\nii.) examine the contributions of Lamarck and Darwin to the theory of evolution.\niii.) know evidences in support of organic evolution\n\n \n2. Evidence of evolution\n\n \n\nObjectives:\n\nCandidates should be able to:\ni.) provide evidences for evolution such as fossil records, comparative anatomy, physiology and embryology.\nii.) trace evolutionary trends in plants and animals.\niii.) provide evidence for modern evolutionary theories such as genetic studies and the role of mutation. RECOMMENDED TEXTS\n\n\nNdu, F.O. C. Ndu, Abun A. and Aina J.O. (2001) Senior Secondary School Biology:\nBooks 1 -3, Lagos: Longman\n\nOdunfa, S.A. (2001) Essential of Biology, Ibadan: Heinemann\n\nOgunniyi M.B. Adebisi A.A. and Okojie J.A. (2000) Biology for Senior Secondary Schools: Books 1 - 3, Macmillan\n\nRamalingam, S.T. (2005) Modern Biology, SS Science Series. New Edition, AFP\n\nStan. (2004) Biology for Senior Secondary Schools. Revised Edition, Ibadan: Heinemann\n\nStone R.H. and Cozens, A.B.C. (1982) Biology for West African Schools. Longman\n\nUsua, E.J. (1997) Handbook of practical Biology 2nd Edition, University Press, Limited"
}