{
  "chapIndex": "Chapter 6: STEREOTYPE",
  "text": "Chelsea had won their match thank God, daddy was in a good mood to continue the discussion for the day but did not work out as planned because he had a meeting.\r\n\r\nKeeping up awake with the help of \"The prophet\" proved abortive as Aliya was not a night person as her brain and body was solar powered meaning as the sun went to bed, she also went off. Recalling her attempt to read at night which made her sleepy the next day proved the fact that God created the day for work and night for rest.\r\n\r\nAfter morning prayers in First lady's room, down the stairs she went meeting daddy and mommy nursing their tea and discussing. Breakfast for the day was yam and fried egg. Two love birds decided to wait till mom was out before another round of interview began but it was fruitless as mommy said she was off duty, but daddy said the plan could still be executed even in her presence.\r\n\r\nAliya watched her parents continue with their banter wondering if the ever had issues. Yes they did if they have daddy will be putting up a good face but mommy was an open book, stay clear her way if she was moody as all her actions will show it .Aliya had to be a good girl all this period, when the storm is over mommy will be singing and calling daddy \"babe\" around the house.\r\n\r\nBoko Haram was the topic as they launched an attack in a local market killing lot of people the previous day. The news was on broadcast. Aliya asked Daddy \"Is it true that Muslims will go to hell\" because they do not believe in Jesus and they kill people a cording to Rebecca Aliya's classmates.\"\r\n\r\n\"What did you say to that\" mommy responded. Aliya replied \"l felt like beating her I said she was stupid\". Daddy was grateful Aliya did not start a fight as other Muslims did when a Danish\r\n\r\n \r\n\r\ncartoonist portrayed Islam as a violent religion and Muslims went after him and many died.\r\n\r\nDaddy said Rebbecca was just stereotyped. He also added that she had wrong ideas about people, this could be due to her upbringing or due to what she has been hearing over time about Islam.\r\n\r\nHe went on to say it is wrong to critise other people based on their religion or skin colour as God would have made everyone black or white, Christian's or Muslims but he preferred diversity, as the beauty of a garden depends on the varieties of coulours it has, this last statement made Aliya run to pick a pen and jot down points for the day.\r\n\r\nDaddy ended the chat for the day with the story of slave trade after forcing mommy to listen who was in a haste to make her hair.\r\n\r\nHe began story:\r\n\r\n\"once upon a time, the Europeans came for slave trade, took their victims who on board fought for their freedom but a turbulent wind tore their ship apart leaving only two alive a white man and an African.\r\n\r\n\"The African nursed the white, forgave him and he got well. The white man in recovery asked the black slave why he was so good in return for his evil, the black said that it was not in his place to punish people for their wrongs. '\r\n\r\nDaddy summarised by saying we should not condemn people based on their religion that even the so called Boko Haram who claim jihad, also bomb mosque, that they are just blood sucking demons fighting for their selfish interest.\r\n\r\nHe warned Aliya against being a prey to stereotypic people who look down on others but should have a life of helping others."
}