{
  "chapIndex": "Chapter 3: THE WORK",
  "text": "Saturday morning was the D I day for Aliya's interview as she came back with questions to ask her father on some parts of the letter she did not understand which her father said\" I had expected this from you\". After morning prayers and a successful tea making which on previous attempt Aliya had always felt defeated until after the help of daddy's tea making Guru Mrs. Bello coached her. She would always say the following instructions are to be followed: Use kettle to boil the water in order not to lose oxygen, add two tea bags, two sugar cubes and five teaspoons of milk which at a golden colour you are an expert in the chemistry of Mrs Bello's tea making\r\n\r\nApproaching Mr. Bello's room with his blue mug filled with tea and her orange mug filled with chocolate, the ball was set rolling with unending questions.\r\n\r\nFirst the talk for the day began with change of profession to law. Aliya had always wanted to be a pilot because of their smartness and ability to travel around but a plane crash changed the idea.\r\n\r\nMusic and song writing came up next till fashion designing had to show music it's place, after a serious asthma attack she resolved to being a doctor so as to help children who had the same illness but the phobia for blood would always say no to medicine.\r\n\r\nAliya father asked her why she wanted to change to law if it was because of chemistry she said no as she had an A that term in chemistry she said that Art subjects gave her feelings that the sciences could not.\r\n\r\n \r\n\r\nParental influence on their children career and academics was next on the table when Aliya told her dad about a girl who due to pressure and comparison had to cheat in physics exams to impress her parents. Sogo on the other hand had issues of career choice as his dad wanted him to become a lawyer like himself which he never wanted to be.\r\n\r\nMr. Bello would always say that parents should not make decisions for their children that the reason they sent them to school was to make decisions for themselves and pursue their passions as we are in a different world and parents can't be part of their children future. Mr. Bello condemned Aliya's friend for cheating in exam that she won't have had to do so as she would have kept trying even if she failed and he said \"it is better to die a failure than to be a prosperous thief\".\r\n\r\nHe imagined other vices she would get involved in life in order to get what she want since at her age she already had examination malpractice in mind.\r\n\r\nThe bookworm Mr. Bello who always derive his child training skills from Kahlil Gibran, the Lebanese poet who died in 1931, advised parents to allow children go into what their passion lies in due to the fact that passions is the only took that drives people to success.\r\n\r\nThe interview ended when he advised his daughter to read meaningful books and not her constant love novel Twilight and also not to spend time on the chat app \"Facebook\" as the social media app is turning youth into fools which satisfies Mr. Einstein saying that \"one day technology will surpass human interaction and the world would have a generation of idiots\" as youths spend time chatting and also misusing and abusing the social media app."
}