{
  "chapIndex": "Chapter 7: BEAUTY",
   "text": "After daddy's story mummy went to the salon, Aliya off to her room with Great expectations by Charles Dickens to keep her company accompanied with the thoughts of what the black slave did for his captor, questions like \"was that possible\" filled Aliya's mind as she laid on the bed.\r\n\r\nAfter afternoon prayers daddy came into her room to round up the discussion for the day as he had a trip the next day. On a stool Mr. Bello sat, Aliya began \"What did you think of it, I mean what the black slave did was it possible\"? Daddy replied \"possible Yes, easy No\"\r\n\r\nDaddy made Aliya know that he wanted her to understand that we can influence and change other people by our actions by being kind to the unkind ones, which is the essence of religion not to cause people to be sterotypes.\r\n\r\nThe statement showing kindness to unkind and mean ones made Aliya remembered and told her father of her teacher who due to her figure would always humiliate her with names and diagrams in biology class. Bunmi who was also jealous of her because of her performance in school which always kept her picture on the notice board of the administrative building. Bunmi would be asking her how she fit into her school uniforms.\r\n\r\nMr. Bello was rather disappointed with the teacher and Bunmi who graduated telling his daughter that if he was told earlier he would have apprehended the situation.\r\n\r\nHe answered Aliya when she asked if she was beautiful despite her figure that beauty depended on how an individual viewed his or herself. Daddy said beauty does not commit in tall, slim body structure, bleaching creams make ups as the media portrayed but that beauty consist also in the heart content of an individual coupled with an individual's character and behaviour.\r\n\r\n \r\n\r\nMr. Bello went on to tell his daughter that her body figure is require in Mauritania's fat Rooms to make a lady attractive to a man, he also drew her attention to the Efik people of Calabar who place there ladies in fattening rooms for them to get filled before marriage.\r\n\r\nAliya will soon be the head girl of her school and she promises to help other students against being bullied by words or actions by their superiors and promised to donate a nebulizer to the school clinic to help asthmatic students.\r\n\r\nDaddy rounded up the day with a story about a hunter who in his hunt got deep in the forest, left his search for game for food. Finally, he saw an inn which a signpost \"Food is ready all, you can eat your ancestors have paid\". The hunter was ushered in by two maidens who gave him food and fruit juice which on his fill decided to go. On his attempt for departure a gentle breeze jolted him and a voice spoke saying he had not paid for the delicacies, but he objected using the signpost inscription but the voice said he has to stay behind and do same for his children who might wander same one day.\r\n\r\nUsing the story daddy told Aliya he has done his best to give her all the necessary teachings and advise that she should do same for her children which will do same to unborn generations.\r\n\r\nOn daddy's departure from the room, Aliya was left in tears, she said a long prayer whose words consisted \"God bless my father, teacher and prophet'"
}