{
  "chapIndex": "Chapter 5: DATING",
  "text": "Daddy you know I m sixteen Aliya began. Mr. Bello a devout Chelsea fan was trying to turn the television on with the remote control for the day's match, and he wasn't giving her attention.\r\n\r\nDaddy almost turned a magician by saying \"Now I command you to come on\" to the TV, but still the TV refused to yield because of the dead batteries in the remote as suggested by Aliya.\r\n\r\nUnlike Aliya, daddy gave more devotion to Chelsea, and an evidence of his devotion was that almost all Aliya's early belongings on Earth were blue, having the Chelsea logo and mummy will always say blue was for boys but daddy was not deterred.\r\n\r\nAliya had herself come to love Chelsea which mummy would say her love for Chelsea is a product of genetic engineering. Aliya had this duty of praying for Chelsea to win whenever they had a match so that all would be well at home because years back, Chelsea lost to Manchester United in the finals of a champion's league and her father did not eat for days.\r\n\r\nAliya began again, \"daddy you know 1 1 m sixteen\" and her dad's reply was that he couldn't possibly forget that she was now a young adult and no longer a child. Aliya continued, \"now I'm sixteen I'm old enough to date, \"l mean like have a boyfriend\" daddy in return asked what dating meant, Aliya rather frustrated interrogated her father by saying \"l thought you said I could ask questions\", \"of course daddy replied\". Daddy asked again \"l would like to know as in your case what people who date do, what does the relationship entail?\"\r\n\r\nAliya replied well I'm not sure they hang out and do stuffs like that\". Mr. Bello interrupted by asking what 'hang out and stuffs like that' meant. Aliya replied saying that HAK means Hugs and kisses while KOTL means kisses on the lips.\r\n\r\nDaddy told Aliya that any relationship at her age is geared by infatuation, whose feelings are often short-lived. He added by saying that such a relationship takes away your time as a students and sets your future in jeopardy.\r\n\r\nAt this point, Aliya began to think she was infatuated with Bobo, due to the fact that she did not return his teddy despite the fact that she dumped it in a bin and went back for it, got angry and jealous that Bobo moved in with Mayero her friend and the worst of it all is that he left to Ireland. Zak a student of hers passed a note too saying \"Do you know any cardiologist? because my heart skips any time I think about you\".\r\n\r\nDaddy further said that teenage relationship comes with emotional issues which could lead to derailment of an individual which is caused by so much gratification.\r\n\r\nAliya the story teller further told her dad about students who got themselves involved in 53x which means \"sex\", were suspended indefinitely which Aliya said that the female victim involved was humiliated but her dad said that what she said was more than mere humiliation as the boy won't be proud to make such a girl his wife.\r\n\r\nHe also said she had lost her self-respect, presented herself as an easy girl, mere girl or another conquest. \"OMG\", Aliya exclaimed. Mr. Bello a little perplexed asked for the meaning of \"OMG\" and Aliya reply was that it meant \"Oh my God\".\r\n\r\nMr Bello was not really comfortable with Aliya using acronyms, he explained that it was because of the continuous use of acronyms that students failed exams in WAEC. After a while, the television came on but Chelsea's match was not in play yet.\r\n\r\nThe curtain was drawn when Aliya asked her dad what \" KPC\" meant but he just had a little idea of what PC meant which was \"personal computer\" and not knowing the meaning of K and this tickled Aliya's fancy. Aliya told him that KPC meant \"keep parents clueless\", keep what? Mr.Bello exclaimed, wahala dey oh.\r\n\r\nJust then mummy called telling Aliya breakfast was ready."
}