{
  "chapIndex": "Chapter 1: THE LETTER",
  "text": "The novel opens with the introduction of the protagonist Aliya, who is the only child of her parents. At 14 she read a book titled sweet sixteen which made her feel that at sixteen she was a young adult and no more a child.\r\n\r\nAliya had always hated being a child because she felt she was stupid being called a child, so she was always attracted to adult issues and nothing about childhood fascinated her, her father thought this her attitude was because of her body size. She was Chubby and would always hate being called fat.\r\n\r\nHer father would always remind her that she is a child but she would always insist that she is an adult trapped in a child's body. She had a mother who was a nurse and her father was a journalist at her birth, a public relations officer when she was in primary school and as she entered her secondary school, he worked with an international organization which helped the poor in Africa.\r\n\r\nAliya got into secondary school at the age of 12, and was always surprised at her father's attitude towards birthday celebration. She knew he never loved celebrating birthdays because he said the only event worth celebrating was achievements, but her mother on the other hand was always fascinated about birthdays.\r\n\r\nAliya first birthday letter was titled \"Happy birthday my first lady, Remember that only God is greater than you\". She never understood why her dad would call her first lady maybe because she was the first child or a special child to him.\r\n\r\nSchool to Aliya was fun, starting from her hostel to classroom. Grace was her roommate and age-mate, whom to people was a snob because she did not like talking. When she talks it looks as if she would be charged for the number of words she spoke but to Aliya she was a nice and generous girl.\r\n\r\nIn junior secondary, Aliya was a science student until she met Chemistry (her headache) in senior secondary, Being focused, she decided to work so hard in chemistry. Her hard work paid off and it was evident in her continuous Assessment result.\r\n\r\nAliya had this classmate who was a jerk according to their Mathematics teacher Miss Salako. In the department of rascal and smartness Akin was a gold medalist. The teacher drew this conclusions because in a geometry class Akin pronounced mensuration (has to do with measurement) as menstruation (has to do with female reproductive system) which got all the students in the classroom laughing. The provoked teacher, sent Akin to the wall as his punishment. Surprisingly, at the end of the term, Akin had A in Mathematics..\r\n\r\nBobo whose real name was Tokunbo cannot be left out of the picture. He gave Aliya a Valentine gift which was a teddy bear on whose heart was written \"l love you\". On visiting day Aliya went out with the teddy to show Daddy at the table chess ground which was their normal spot during visiting days. She told him how the gift came about, and added that Bobo said he likes her. Her father in return asked her if she likes him but she said NO.\r\n\r\nMr. Bello (Aliya's father) went on to tell his daughter that boys like dumb girls, adding that Bobo likes her because she is dumb. She objected because to her being dumb was not being intelligent (and she belives she's intelligent).\r\n\r\nHer father told her that any girl who has sex with boys or lives a rascal life is dumb, a grilled who does not know she is exploited is dumb, any girl who has to give something in return for that was dumb.\r\n\r\nOut of guilt, she asked if she could return the teddy, her dad said she should do what she thinks is right. She could not because she felt she won't do that without hurting bobo. On her very attempt to return it ,the duty master approached them which ended the discussion. Afterwhich, Bobo traveled to Ireland.\r\n\r\nKEEP AT THE BACK OF YOUR MIND before we continue: Aliya is asthmatic. On visiting days her dad would always end there conversation by asking her if she had her Ventolin inhaler.\r\n\r\nNow we continue...\r\n\r\nNormally, on Aliya's birthdays her Principal after morning devotion, do hand over gifts and cards, On her sixteenth birthday things weren't normal. And the surprise was huge.\r\n\r\nThe one important person that don't give her birthday present, HER DAD, gave her (through her principal) a portable digital camera she had earlier requested. That was not all, a birthday card which was written \"sweet sixteen\" and a letter titled \"letter to my daughter\" were also given to her as birthday gifts from her dad.\r\n\r\nAt first, she thought her dad copied Maya Angelou's work because of the same headline but she found out that her dad only copied the headline and the body was his own words. The letter was a sixteen page work which began with \"how time flies\" and each page was for each year of her life.\r\n\r\nOkay this is the end of chapter one!"
}