{
  "chapIndex": "",
  "text": "1. Separation of mixtures and purification of chemical substances\n\n \n\nTopics:\n\n(a) Pure and impure substances\n(b) Boiling and melting points.\n(c) Elements, compounds and mixtures\n(d) Chemical and physical changes.\n(e) Separation processes: evaporation, simple and fractional distillation, sublimation, filtration, crystallization, paper and column chromatography, simple and fractional crystallization, magnetization, decantation.\n\n \n\nObjectives:\n\nCandidates should be able to:\n(i) distinguish between pure and impure substances;\n(ii) use boiling and melting points as criteria for purity of chemical substances;\n(iii) distinguish between elements, compounds and mixture;\n(iv) differentiate between chemical and physical changes;\n(v) identify the properties of the components of a mixture;\n(vi) specify the principle involved in each separation method.\n(vii) apply the basic principle of separation processes in everyday life.\n\n \n2. Chemical combination\n\n \n\nTopics:\n\nStoichiometry, laws of definite and multiple proportions, law of conservation of matter, Gay Lussac's law of combining volumes, Avogadro's law; chemical symbols, formulae, equations and their uses, relative atomic mass based on 12\n\nC=12, the mole concept and Avogadro's number.\n\n \n\nObjectives: \n\nCandidates should be able to:\n(i) perform simple calculations involving formulae, equations/chemical composition and the mole concept;\n(ii) deduce the chemical laws from given expressions/statements/data;\n(iii) interpret graphical representations related to these laws;\n(iv) deduce the stoichiometry of chemical reactions.\n\n \n3. Kinetic theory of matter and Gas Laws\n\n \n\nTopics:\n\n(a) An outline of the kinetic theory of matter;\n(i) melting,\n(ii) vapourization\n(iii) boiling\n(iv) freezing\n(v) condensation in terms of molecular motion and Brownian movement.\n(b)(i) The laws of Boyle, Charles, Graham and Dalton (law of partial pressure); combined gas law, molar volume and atomicity of gases.\n(ii) The ideal gas equation (PV = nRT).\n(iii) The relationship between vapour density of gases and the relative molecular mass.\n\n \n\nObjectives:\n\nCandidates should be able to:\n(i) apply the theory to distinguish between solids, liquids and gases;\n(ii) deduce reasons for change of state;\n(iii) draw inferences based on molecular motion;\n(iv) deduce gas laws from given expressions/ statements;\n(v) interpret graphical representations related to these laws;\n(vi) perform simple calculations based on these laws, equations and relationships\n\n \n4. Atomic structure and bonding\n\n \n\nTopics:\n\n(a) (i)The concept of atoms, molecules and ions, the works of Dalton, Millikan, Rutherford, Moseley, Thompson and Bohr.\n(ii) Atomic structure, electron configuration, atomic number, mass number and isotopes; specific examples should be drawn from elements of atomic number 1 to 20.\n(iii) Shapes of s and p orbitals.\n(b) The periodic table and periodicity of elements, presentation of the periodic table with a view to recognizing families of elements e.g. alkali metals, halogens, the noble gases and transition metals. The variation of the following properties: ionization energy, ionic radii, electron affinity and electronegativity.\n(c) Chemical bonding. Electrovalency and covalency, the electron configuration of elements and their tendency to attain the noble gas structure. Hydrogen bonding and metallic bonding as special types of electrovalency and covalency respectively; coordinate bond as a type of covalent bond as illustrated by complexes like [Fe(CN)6\n]3−, [Fe(CN)6]4−, [Cu(NH3)4]2+ and [Ag(NH3)2]+; van der Waals' forces should be mentioned as a special type of bonding forces.\n(d) Shapes of simple molecules: linear ((H2, O2, Cl2,HCl and CO2), non-linear (H2O) and tetrahedral; (CH4) and pyramidal (NH3\n\n).\n(e) Nuclear Chemistry:\n(i) Radioactivity - Types and properties of radiations\n(ii) Nuclear reactions. Simple equations, uses and applications of natural and artificial radioactivity.\n\n \n\nObjectives:\n\nCandidates should be able to:\n(i) distinguish between atoms, molecules and ions;\n(ii) identify the contributions of these scientists to the development of the atomic structure;\n(iii) deduce the number of protons, neutrons and electrons from atomic and mass numbers of an atom;\n(iv) apply the rules guiding the arrangement of electrons in an atom;\n(v) identity common elements exhibiting isotopy;\n(vi) relate isotopy to mass number;\n(vii) perform simple calculations relating to isotopy;\n(viii) differentiate between the shapes of the orbitals;\n(ix) determine the number of electrons in s and p atomic orbitals;\n(x) relate atomic number to the position of an element on the periodic table;\n(xi) relate properties of groups of elements on the periodic table;\n(xii) identify reasons for variation in properties across the period and down the groups.\n(xiii) differentiate between the different types of bonding.\n(xiv) deduce bond types based on electron configurations;\n(xv) relate the nature of bonding to properties of compounds;\n(xvi) differentiate between the various shapes of molecules\n(xvii) distinguish between ordinary chemical reaction and nuclear reaction;\n(xviii) differentiate between natural and artificial radioactivity;\n(xix) compare the properties of the different types of nuclear radiations;\n(xx) compute simple calculations on the half-life of a radioactive material;\n(xxi) balance simple nuclear equation;\n\n(xxii) identify the various applications of radioactivity.\n\n \n5. Air\n\n \n\nTopics: \n\n(a) The natural gaseous constituents and their proportion in the air.- nitrogen, oxygen, water vapour, carbon (IV) oxide and the noble gases (argon and neon).\n(b) Air as a mixture and some uses of the noble gas.\n\n \n\nObjectives:\n\nCandidates should be able to:\n(i) deduce reason (s) for the existence of air as a mixture;\n(ii) identify the principle involved in the separation of air components;\n(iii) deduce reasons for the variation in the composition of air in the environment;\n(iv) specify the uses of some of the constituents of air.\n\n \n6. Water\n\n \n\nTopics: \n\n(a) Water as a product of the combustion of hydrogen and its composition by volume.\n(b) Water as a solvent, atmospheric gases dissolved in water and their biological significance.\n(c) Hard and soft water: Temporary and permanent hardness and methods of softeninghard water.\n(d) Treatment of water for town supply.\n(e) Water of crystallization, efflorescence, deliquescence and hygroscopy. Examples of the substances exhibiting these properties and their uses. Objectives:\n\nCandidates should be able to:\n(i) identify the various uses of water;\n(ii) identity the effects of dissolved atmospheric gases in water;\n(iii) distinguish between the properties of hard and soft water;\n(iv) determine the causes of hardness;\n(v) identify methods of removal of hardness;\n(vi) describe the processes involved in the treatment of water for town supply;\n(vii) distinguish between these phenomena;\n(viii) identify the various compounds that exhibit these phenomena.\n\n \n7. Solubility\n\n \n\nTopics:\n\n(a) Unsaturated, saturated and supersaturated solutions. Solubility curves and simple deductions from them, (solubility defined in terms of mole per dm3) and simple calculations.\n(b) Solvents for fats, oil and paints and the use of such solvents for the removal of stains.\n(c) False solution (Suspensions and colloids): Properties and examples. Harmattan haze and water paints as examples of suspensions and fog, milk, aerosol spray, emulsion paints and rubber solution as examples of colloids.\n\n \n\nObjectives:\n\nCandidates should be able to:\n(i) distinguish between the different types of solutions;\n(ii) interpret solubility curves;\n(iii) calculate the amount of solute that can dissolve in a given amount of solvent at a given temperature;\n(iv) deduce that solubility is temperature-dependent;\n(v) relate nature of solvents to their uses;\n(vi) differentiate among true solution, suspension and colloids;\n(vii) compare the properties of a true solution and a ‘false' solution.\n(viii) provide typical examples of suspensions and colloids.\n\n \n8. Environmental Pollution\n\n \n\nTopics: \n\n(a) Sources and effects of pollutants.\n(b) Air pollution: Examples of air pollutants such as H2S, CO, SO2, oxides of nitrogen, chlorofluorocarbons and dust.\n(c) Water pollution Sewage and oil pollution should be known.\n(d) Soil pollution: Oil spillage, Biodegradable and non-biodegradable pollutants.\n\n \n\nObjectives:\n\nCandidates should be able to:\n(i) identify the different types of pollution and pollutants;\n(ii) specify different sources of pollutants\n(iii) classify pollutants as biodegradable and non-biodegradable;\n(iv) specify the effects of pollution on the environment;\n(v) identify measures for control of environmental pollution.\n\n \n9. Acids, bases and salts\n\n \n\nTopics:\n\n(a) General characteristics and properties of acids, bases and salts. Acids/base indicators, basicity of acids; normal, acidic, basic and double salts. An acid defined as a substance whose aqueous solution furnishes H3O+ions or as a proton donor. Ethanoic, citric and tartaric acids as examples of naturally occurring organic acids, alums as examples of double salts, preparation of salts by neutralization, precipitation and action of acids on metals. Oxides and trioxocarbonate (IV) salts\n(b) Qualitative comparison of the conductances of molar solutions of strong and weak acids and bases, relationship between conductance and amount of ions present.\n(c) pH and pOH scale; Simple calculations\n(d) Acid/base titrations.\n(e) Hydrolysis of salts: Principle Simple examples such as NH4Cl, AlCl3, Na2CO3 and CH3COONa\n\n \n\nObjectives:\n\nCandidates should be able to:\n(i) distinguish between the properties of acids and bases;\n(ii) identify the different types of acids and bases;\n(iii) determine the basicity of acids;\n(iv) differentiate between acidity and alkalinity using acid/base indicators;\n(v) identify the various methods of preparation of salts;\n(vi) classify different types of salts;\n(vii) relate degree of dissociation to strength of acids and bases;\n(viii) relate degree of dissociation to conductance;\n(ix) perform simple calculations on pH and pOH;\n(x) identify the appropriate acid-base indicator;\n(xi) interpret graphical representation of titration curves;\n(xii) perform simple calculations based on the mole concept;\n(xiii) balance equations for the hydrolysis of salts;\n(xiv) deduce the properties (acidic, basic, neutral) of the resultant solution.\n\n \n10. Oxidation and reduction\n \n\nTopics: \n\n(a) Oxidation in terms of the addition of oxygen or removal of hydrogen.\n(b) Reduction as removal of oxygen or addition of hydrogen.\n(c) Oxidation and reduction in terms of electron transfer.\n(d) Use of oxidation numbers. Oxidation and reduction treated as change in oxidation number and use of oxidation numbers in balancing simple equations.\n(e) IUPAC nomenclature of inorganic compounds using oxidation number.\n(f) Tests for oxidizing and reducing agents.\n\n \n\nObjectives:\n\nCandidates should be able to:\n(i) identify the various forms of expressing oxidation and reduction;\n(ii) classify chemical reactions in terms of oxidation or reduction;\n(iii) balance redox reaction equations;\n(iv) deduce the oxidation number of chemical species;\n(v) compute the number of electron transfer in redox reactions;\n(vi) identify the name of redox species in a reaction\n(vii) distinguish between oxidizing and reducing agents in redox reactions.\n(viii) apply oxidation number in naming inorganic compounds\n(ix) relate reagents to their oxidizing and reducing abilities.\n\n \n11. Electrolysis\n\n \n\nTopics:\n\n(a) Electrolytes and non-electrolytes. Faraday's laws of electrolysis.\n(b) (i) Electrolysis of dilute H2SO4, aqueous CuSO4, CuC12 solution, dilute and concentrated NaC1 solutions and fused NaC1\n(ii) Factors affecting discharge of ions at the electrodes.\n(c) Uses of electrolysis: Purification of metals e.g. copper and production of elements and compounds (Al, Na, O2, Cl2 and NaOH).\n(d) Electrochemical cells: Redox series (K, Ca, Na, Mg, Al, Zn, Fe, Sn, Pb, H, Cu, Hg, Ag, Au,) half-cell reactions and electrode potentials. (Simple calculations only).\n(e) Corrosion as an electrolytic process, cathodic protection of metals, painting, electroplating and coating with grease or oil as ways of preventing iron from corrosion.\n\n \n\nObjectives:\n\nCandidates should be able to:\n(i) distinguish between electrolytes and non-electrolytes;\n(ii) perform calculations based on faraday as a mole of electrons.\n(iii) identify suitable electrodes for different electrolytes.\n(iv) specify the chemical reactions at the electrodes;\n(v) determine the products at the electrodes;\n(vi) identify the factors that affect the products of electrolysis;\n(vii) specify the different areas of application of electrolysis;\n(viii) identify the various electrochemical cells;\n(ix) calculate electrode potentials using half-cell reaction equations;\n(x) determine the different areas of application of electrolytic processes;\n(xi) identify methods used in protecting metals.\n\n \n12. Energy changes\n\n \n\nTopics:\n\n(a) Energy changes ∆H accompanying physical and chemical changes: dissolution of substances in/or reaction with water e.g. Na, NaOH, K, NH4Cl. Endothermic +∆H and exothermic -∆H reactions.\n(b) Entropy as an order-disorder phenomenon: simple illustrations like mixing of gases and dissolution of salts.\n(c) Spontaneity of reactions: ∆Gsqrt = 0 as a criterion for equilibrium, ∆G greater or less than zero as a criterion for non-spontaneity or spontaneity respectively.\n\n \n\nObjectives:\n\nCandidates should be able to:\n(i) determine the types of heat changes ∆H in physical and chemical processes;\n(ii) interpret graphical representations of heat changes;\n(iii) relate the physical state of a substance to the degree of orderliness;\n(iv) determine the conditions for spontaneity of a reaction ;\n(v) relate∆H sqrt, ∆Ssqrt and ∆Gsqrt as the driving forces for chemical reactions;\n(vi) solve simple problems based on the relationships ∆Gsqrt = ∆Hsqrt - T∆Ssqrt\n\n 13. Rates of Chemical Reaction\n\n \n\nTopics:\n\n(a) Elementary treatment of the following factors which can change the rate of a chemical reaction:\n(i) Temperature e.g. the reaction between HCl and Na2S2O3 or Mg and HCl\n(ii) Concentration e.g. the reaction between HCl and Na2S2O3, HCl and marble and the iodine clock reaction, for gaseous systems, pressure may be used as concentration term.\n(iii) Surface area e.g. the reaction between marble and HCl with\nmarble in\n(i) powdered form\n(ii) lumps of the same mass.\n(iv) Catalyst e.g. the decomposition of H2O2 or KClO3 in the presence or absence of MnO2\n(b) Reaction rate curves.\n(c) Activation energy Qualitative treatment of Arrhenius' law and the collision theory, effect of light on some reactions. e.g. halogenation of alkanes\n\n \n\nObjectives:\n\nCandidates should be able to:\n(i) identify the factors that affect the rates of a chemical reaction;\n(ii) determine the effects of temperature on the rate of reactions;\n(iii) examine the effect of concentration/pressure on the rate of a chemical reaction;\n(iv) describe how the rate of a chemical reaction is affected by surface area;\n(v) determine the types of catalysts suitable for different reactions and their effects;\n(vi) determine ways of moderating these effects in chemical reactions.\n(vii) interpret reaction rate curves;\n(viii) solve simple problems on the rate of reactions;\n(ix) relate the rate of reaction to the kinetic theory of matter.\n(x) examine the significance of activation energy to chemical reactions.\n(xi) deduce the value of activation energy (Ea) from reaction rate curves.\n\n \n14. Chemical equilibrium\n\n \n\nTopics:\n\nReversible reactions and factors governing the equilibrium position. Dynamic equilibrium. Le Chatelier's principle and equilibrium constant. Simple examples to include action of steam on iron and N2\nO4 ⇌ 2NO2\n\n. No calculation will be required.\n\n \n\nObjectives:\n\nCandidates should be able to:\n(i) identify the factors that affects the position of equilibrium of a chemical reaction;\n(ii) predict the effects of each factor on the position of equilibrium;\n(iii) determine the effects of these factors on equilibrium constant.\n\n \n15. Non-metals and their compounds\n\n \n\nTopics: \n\n(a) Hydrogen: commercial production from water gas and cracking of petroleum fractions, laboratory preparation, properties, uses and test for hydrogen.\n(b) Halogens: Chlorine as a representative element of the halogen. Laboratory preparation, industrial preparation by electrolysis, properties and uses, e.g. water sterilization, bleaching, manufacture of HCl, plastics and insecticides. Hydrogen chloride and Hydrochloric acid: Preparation and properties. Chlorides and test for chlorides.\n(c) Oxygen and Sulphur\n(i) Oxygen: Laboratory preparation, properties and uses. Commercial production from liquid air. Oxides: Acidic,basic, amphoteric and neutral, trioxygen (ozone) as an allotrope and the importance of ozone in the atmosphere.\n(ii) Sulphur: Uses and allotropes: preparation of allotropes is not expected . Preparation, properties and uses of sulphur(IV) oxide, the reaction of SO2\nwith alkalis. Trioxosulphate (IV) acid and its salts, the effect of acids on salts of trioxosulphate(IV), Tetraoxosulphate(VI) acid: Commercial preparation (contact process only), properties as a dilute acid, an oxidizing and a dehydrating agent and uses. Test for SO2−4. Hydrogen sulphide: Preparation and properties as a weak acid, reducing agent and precipitating agent. Test for S2−\n(d) Nitrogen:\n(i) Laboratory preparation\n(ii) Production from liquid air\n(iii) Ammonia: Laboratory and industrial preparations (Haber Process only), properties and uses, ammonium salts and their uses, oxidation of ammonia to nitrogen (IV) oxide and trioxonitrate (V) acid. Test for NH+4\n(iv) Trioxonitrate (V) acid: Laboratory preparation from ammonia; properties and uses. Trioxonitrate (V) salt- action of heat and uses. Test for NO−3\n(v) Oxides of nitrogen: Properties. The nitrogen cycle.\n(e) Carbon:\n(i) Allotropes: Uses and properties\n(ii) Carbon(IV) oxide- Laboratory preparation, properties and uses. Action of heat on trioxocarbonate (IV) salts and test for CO2−3\n\n\n(iii) Carbon(II) oxide: Laboratory preparation, properties including its effect on blood; sources of carbon (II) oxide to include charcoal, fire and exhaust fumes.\n(iv) Coal: Different types, products obtained from destructive distillation of wood and coal.\n(v) Coke: Classification and uses. Manufacture of synthetic gas and uses.\n\n \n\nObjectives:\n\nCandidates should be able to:\n(i) predict reagents for the laboratory and industrial preparation of these gases and their compounds.\n(ii) identify the properties of the gases and their compounds.\n(iii) compare the properties of these gases and their compounds.\n(iv) specify the uses of each gas and its compounds;\n(v) determine the specific test for each gas and its compounds.\n(vi) determine specific tests for Cl−\n, SO2−4, SO2−3, S2−, NH+4, NO−3, CO2−3, HCO−3\n\n(vii) predict the reagents for preparation, properties and uses HCl(g) and HCl(aq);\n(viii) identify the allotropes of oxygen;\n(ix) determine the significance of ozone to our environment.\n(x) classify the oxides of oxygen and their properties\n(xi) identify the allotropes of sulphur and their uses;\n(xii) predict the reagents for preparation, properties and uses of SO2\nand H2S;\n(xiii) specify the preparations of H2SO4 and H2SO3, their properties and uses.\n(xiv) specify the laboratory and industrial preparation of NH3;\n(xv) identify the properties and uses of NH3;\n(xvi) identify reagents for the laboratory preparation of HNO3, its properties and uses;\n(xvii) specify the properties of N2O, NO, NO2 gases.\n(xviii) examine the relevance of nitrogen cycle to the environment.\n(xix) identify allotropes of carbon;\n(xx) predict reagents for the laboratory preparation of CO2;\n(xxi) specify the properties of CO2\n\nand its uses;\n(xxii) determine the reagents for the laboratory preparation of CO;\n(xxiii) predict the effects of CO on human;\n(xxiv) identify the different forms of coal:\n(xxv) determine their uses;\n(xxvi) specify the products of the destructive distillation of wood and coal;\n(xxvii) specify the uses of coke and synthetic gas.\n\n \n16. Metals and their compounds\n\n \n\nTopics:\n\n(a) General properties of metals\n(b) Alkali metals e.g. sodium\n(i) Sodium hydroxide:- Production by electrolysis of brine, its action on aluminium, zinc and lead ions. Uses including precipitation of\nmetallic hydroxides.\n(ii) Sodium trioxocarbonate (IV) and sodium hydrogen trioxocarbonate (IV): Production by Solvay process, properties and uses, e.g. Na2\nCO3 in the manufacture of glass.\n(iii) Sodium chloride: its occurrence in sea water and uses, the economic importance of sea water and the recovery of sodium chloride.\n(c) Alkaline-earth metals, e.g. calcium; calcium oxide, calcium hydroxide and calcium trioxocarbonate (IV); Properties and uses. Preparation of calcium oxide from sea shells, the chemical composition of cement and the setting of mortar. Test for Ca2+.\n(d) Aluminium Purification of bauxite, electrolytic extraction, properties and uses of aluminium and its compounds. Test for Al3+\n(e) Tin Extraction from its ores. Properties and uses.\n(f) Metals of the first transition series. Characteristic properties:\n(i) electron configuration\n(ii) oxidation states\n(iii) complex ion formation\n(iv) formation of coloured ions\n(v) catalysis\n(g) Iron Extraction from sulphide and oxide ores, properties and uses, different forms of iron and their properties and advantages of steel over iron. Test for Fe2+ and Fe3+\n(h) Copper Extraction from sulphide and oxide ores, properties and uses of copper. Preparation and uses of copper(II) tetraoxosulphate(VI). Test for Cu2+\n\n\n(i) Alloy Steel, stainless steel, brass, bronze, type- metal, duralumin, soft solder, permallory and alnico (constituents and uses only).\n\n \n\nObjectives: \n\nCandidates should be able to:\n(i) specify the general properties of metals;\n(ii) determine the method of extraction suitable for each metal;\n(iii) relate the methods of extraction to the properties for the metals;\n(iv) compare the chemical reactivities of the metals;\n(v) specify the uses of the metals;\n(vi) determine specific test for metallic ions;\n(vii) determine the process for the production of the compounds of these metals;\n(viii) compare the chemical reactivities of the compounds;\n(ix) specify the uses of these compounds\n(x) specify the chemical composition of cement.\n(xi) describe the method of purification of bauxite;\n(xii) specify the ores of tin;\n(xiii) relate the method of extraction to its properties;\n(xiv) specify the uses of tin;\n(xv) identify the general properties of the first transition metals;\n(xvi) deduce reasons for the specific properties of the transition metals;\n(xvii) determine the IUPAC names of simple transition metal complexes\n(xviii) determine the suitable method of extraction of iron;\n(xix) specify the properties and uses of iron;\n(xx) identify the different forms of iron, their compositions, properties and uses.\n(xxi) identify the appropriate method of extraction of copper from its compounds;\n(xxii) relate the properties of copper and its compound to their uses.\n(xxiii) specify the method for the preparation of CuSO4\n\n;\n(xxiv) specify the constituents and uses of the various alloys mentioned.\n(xxv) compare the properties and uses of alloys to pure metals.\n\n \n17. Organic Compounds\n\n \n\nTopics:\n\nAn introduction to the tetravalency of carbon, the general formula, IUPAC nomenclature and the determination of\nempirical formula of each class of the organic compounds mentioned below.\n(a) Aliphatic hydrocarbons\n(i) Alkanes Homologous series in relation to physical properties, substitution reaction and a few examples and uses of halogenated products. Isomerism: structural only (examples on isomerism should not go beyond six carbon atoms). Petroleum: composition, fractional distillation and major products; cracking and reforming, Petrochemicals - starting materials of organic syntheses, quality of petrol and meaning of octane number.\n(ii) Alkenes Isomerism: structural and geometric isomerism, additional and polymerization reactions, polythene and synthetic rubber as examples of products of polymerization and its use in vulcanization.\n(iii) Alkynes Ethyne - production from action of water on carbides, simple reactions and properties of ethyne.\n(b) Aromatic hydrocarbons e.g. benzene - structure, properties and uses.\n(c) Alkanols Primary, secondary, tertiary - production of ethanol by fermentation and from petroleum by-products. Local examples of fermentation and distillation, e.g. gin from palm wine and other local sources and glycerol as a polyhydric alkanol. Reactions of OH group - oxidation as a distinguishing test among primary, secondary and tertiary alkanols (Lucas test).\n(d) Alkanals and alkanones. Chemical test to distinguish between alkanals and alkanones.\n(e) Alkanoic acids. Chemical reactions; neutralization and esterification, ethanedioic (oxalic) acid as an example of a dicarboxylic acid and benzene carboxylic acid as an\nexample of an aromatic acid.\n(f) Alkanoates Formation from alkanoic acids and alkanols - fats and oils as alkanoates. Saponification: Production of soap and margarine from alkanoates and distinction between detergents and soaps.                                                                                                                        \n(g) Amines (Alkanamines) Primary, Secondary, and tertiary\n(h) Carbohydrates\nClassification - mono-, di- and polysaccharides; composition, chemical tests for simple sugars and reaction with concentrated tetraoxosulphate (VI) acid. Hydrolysis of complex sugars e.g. cellulose from cotton and starch from cassava, the uses of sugar and starch in the production of alcoholic beverages, pharmaceuticals and textiles.\n(i) Proteins: Primary structures, hydrolysis and tests (Ninhydrin, Biuret, Millon's and xanthoproteic)\nEnzymes and their functions.\n(j) Polymers: Natural and synthetic rubber; addition and condensation polymerization. - Methods of preparation, examples and uses. Thermoplastic and thermosetting plastics.\n\n \n\nObjectives:\n\nCandidates should be able to:\n(i) derive the name of organic compounds from their general formulae;\n(ii) relate the name of a compound to its structure\n(iii) relate the tetravalency of carbon to its ability to form chains of compound (catenation);\n(iv) classify compounds according to their functional groups;\n(v) derive empirical formula and molecular formula, from given data;\n(vi) relate structure/functional groups to specific properties;\n(vii) derive various isomeric forms from a given formula;\n(viii) distinguish between the different types of isomerism;\n(ix) specify the uses of these compounds\n(x) specify the chemical composition of cement.\n(xi) specify the uses of various hydrocarbons;\n(xii) identify crude oil as a complex mixture of hydrocarbons;\n(xiii) relate the fractions of hydrocarbons to their properties and uses;\n(xiv) relate transformation processes to quality improvement of the fractions;\n(xv) distinguish between various polymerization processes;\n(xvi) specify the process involved in vulcanization;\n(xvii) specify chemical test for terminal alkynes\n(xviii) distinguish between aliphatic and aromatic hydrocarbons;\n(xix) relate the properties of benzene to its structure\n(xx) compare the various classes of alkanols;\n(xxi) determine the processes involved in ethanol production;\n(xxii) examine the importance of ethanol as an alternative energy provider;\n(xxiii) distinguish the various classes of alkanols;\n(xxiv) differentiate between alkanals and alkanones;\n(xxv) compare the various types of alkanoic acids;\n(xxvi) identify natural sources of alkanoates;\n(xxvii) specify the methods for the production of soap, detergent and margarine.\n(xxviii) distinguish between detergent and soap;\n(xxix) compare the various classes of alkanamine;\n(xxx) identify the natural sources of carbohydrates;\n(xxxi) compare the various classes of carbohydrates;\n(xxxii) infer the products of hydrolysis and dehydration of carbohydrates;\n(xxxiii) determine the uses of carbohydrates;\n(xxxiv) specify the tests for simple sugars;\n(xxxv) identify the basic structure of proteins;\n(xxxvi) specify the methods and products of hydrolysis;\n(xxxvii) specify the various tests for proteins;\n(xxxviii) distinguish between natural and synthetic polymers;\n(xxxix) differentiate between addition and condensation polymerization processes;\n(xl) classify natural and commercial polymers and their uses;\n(xli) distinguish between thermoplastics and thermosetting plastics.\n\n \n18. Chemistry and Industry\n\n \n\nTopics:\n\nChemical industries: Types, raw materials and relevancies; Biotechnology.\n\n \n\nObjectives:\n\nCandidates should be able to :\n(i) classify chemical industries in terms of products;\n(ii) identify raw materials for each industry;\n(iii) distinguish between fine and heavy chemicals;\n(iv) enumerate the relevance of each of these industries;\n(v) relate industrial processes to biotechnology.\n\n \nRECOMMENDED TEXTS\n\n\n1.Ababio, O. Y. (2009). New School Chemistry for Senior Secondary Schools (Fourth edition), Onitsha: Africana FIRST Publishers Limited.\n\n2.Bajah, S.T.; Teibo, B. O., Onwu, G.; and Obikwere, A. Book 1 (1999). Senior Secondary Chemistry, Books 2 and 3 (2000). Lagos: Longman. 3.Ojokuku, G. O. (2012). Understanding Chemistry for Schools and Colleges, (Revised Edition),Zaria: Press-On Chemresources.\n\n4.Odesina, I. A. (2008). Essential: Chemistry for Senior Secondary Schools, (2nd Edition), Lagos: Tonad Publishers Limited.\n\n5.Uche, I. O. Adenuga, I. J. and Iwuagwu, S. L. (2003). Countdown to WASSCE/SSCE, NECO, JME Chemistry,Ibadan: Evans."
}