{
  "chapIndex": "",
  "text": "1. Commerce\n\n \n\nTopics:\n\n \n\n(i) Meaning and scope\n(ii) Characteristics\n(iii) Functions\n\n \n\nObjectives:\n\nCandidates should be able to:\n(i) differentiate between Commerce and other related subjects;\n(ii) describe the characteristics of Commerce;\n(iii) Identify the functions of Commerce\n\n \n2. Occupation\n\n \n\nTopics:\n\n \n\n(i) Meaning and importance\n(ii) Types (industrial, commercial and services)\n(iii) Factors that determine choice of occupation\n\n \n\nObjectives: \n\nCandidates should be able to:\n(i) State the importance of occupation;\n(ii) Compare the different types of occupation;\n(iii) Identify the factors determining the choice of occupation.\n\n \n3. Production\n\n \n\nTopics:\n\n \n\n(i) Factors, characteristics and rewards (land, labour, capital and entrepreneur)\n(ii) Division of Labour and specialization\n(iii) Types (primary, secondary and tertiary)\n\n \n\nObjectives:\n\nCandidates should be able to:\n(i) identify the Factors of Production and their rewards;\n(ii) distinguish between Division of Labour and Specialization;\n(iii) classify the types of production.\n\n \n4. Trade\n\n \n\nTopics:\n\n \n\na. Home Trade\n(i) Retail trade:\n- Types of retailers\n- Functions of retailers\n- Factors to be considered in setting up retail trade\n- Trends in retailing (branding, self -service, vending machines, the use of luncheon, fuel vouchers, etc)\n- Advantages and disadvantages of retailers\n\n(ii) Wholesale trade:\n- Types of wholesalers (merchant, agent, general, etc)\n- Functions of wholesalers\n- Advantages and disadvantages of wholesalers\n\nb. Foreign trade\n(i) Basic issues in foreign trade (balance of trade, balance of payments and counter trade)\n(ii) Procedures and documents used in export, import and entreport trade\n(iii) Barriers to international trade\n(iv) Role of Customs and Excise Authority, Ports Authority, etc in foreign trade\n\n \n\nObjectives: \n\nCandidates should be able to:\n(i) compare the various types of retailers;\n(ii) identify the functions of retailers;\n(iii) highlight the factors in setting up retail trade;\n(iv) classify modern retailing practices;\n(v) identify the advantages and disadvantages of retail business;                                                                                                                                               \n\n(vi) classify the types of wholesalers;\n(vii) discuss the functions of wholesalers;\n(viii) outline the merits and demerits of the middleman;                                                                                                                                                               \n\n(ix) analyse the basic issues in foreign trade;\n(x) explain the procedures and documents used in foreign trade;\n(xi) identify the barriers to international trade;\n(xii) appraise the role of government agencies in foreign trade\n\n \n5. Purchase and Sale of Goods\n\n \n\nTopics:\n\n(i) Procedure and documentation (enquiry, quotation, order, invoice, proforma invoice, statement of accounts, indent, consular invoice, bill of lading, certificate of origin, consignment note, etc)\n(ii) Terms of trade (trade discount, quantity discount, cash discount, warranties, C.O.D., C.I.F., F.O.B., and E.O.E. etc)\n(iii) Terms of payments\na. Cash - Legal tender\nb. Credit\n- Types and functions\n- Merits and demerits\n\n \n\nObjectives: \n\nCandidates should be able to:\n(i) examine the procedures and documents used in the purchase and sale of goods;\n(ii) determine the terms of trade;\n(iii) distinguish between cash and credit forms of payment;\n(iv) identify the types of credit;\n(v) analyse the merits and demerits of credit transactions.\n\n \n6. Aids-to-trade Topic:\n\na. Advertising:\n(i) Types and media\n(ii) Advantages and disadvantages\n\nb. Banking:\n(i) Types of bank\n(ii) Services\n(iii) Challenges\n\nc. Communication:\n(i) Process and procedure\n(ii) Types\n(iii) Trends\n(iv) Merits and demerits\n(v) Barriers\n\nd. Insurance:\n(i) Types\n(ii) Principles\n(iii) Terms\n(iv) Importance\n\ne. Tourism:\n(i) Importance\n(ii) Agencies that promote tourism in Nigeria\n(iii) Challenges\n\nf. Transportation:\n(i) Mode\n(ii) Importance\n(iii) Advantages and disadvantages\n\ng. Warehousing:\n(i) Importance\n(ii) Types and functions\n(iii) Factors to be considered in siting a warehouse\n\n \n\nObjectives: \n\nCandidates should be able to:\n(i) identify the different types of advertising and its media;\n(ii) analyse the advantages and disadvantages of advertising;\n\n(iii) categorize the different types of bank;\n(iv) assess the services rendered by banks;\n(v) identify the challenges facing banks;\n\n(vi) assess the different stages in the communication process;\n(vii) analyse the types of communication;\n(viii) appraise the contributions of courier services, GSM, etc., to businesses;\n(ix) state the merits and demerits of communication;\n(x) outline the barriers to communication\n\n(xi) describe the types of insurance;\n(xii) apply the principles of insurance to life situations;\n(xiii) explain the terms in insurance;\n(xiv) state the importance of insurance;\n\n(xv) examine the importance of tourism;\n(xvi) identify the agencies that promote tourism in Nigeria;\n(xvii) analyse the challenges facing tourism in Nigeria;\n\n(xviii) appraise the relevance of the various\nmodes of transportation;\n(xix) list the importance of transportation;\n(xx) discuss the advantages and disadvantages of transportation;\n\n(xxi) highlight the importance of warehousing;\n(xxii) appraise the contributions of warehouses to businesses.\n(xxiii) evaluate the factors that determine the siting of warehouses\n\n \n7. Business Units\n\n \n\nTopics:\n\n \n\n(i) Forms and features (Sole Proprietorship, Partnership, Limited Liability Companies, Public Corporations, Cooperative Societies, etc.)\n(ii) Registration of businesses\n(iii) Business Mergers\n(iv) Determination of choice of business units\n(v) Dissolution and liquidation\n(vi) Merits and demerits\n\n \n\nObjectives: \n\nCandidates should be able to:\n(i) identify the forms and features of business units;\n(ii) analyse the procedures for registering businesses;\n(iii) appraise the different forms of business mergers and the reasons for merging;\n(iv) examine the factors which determine the choice of business units;\n(v) differentiate between dissolution and liquidation of business;\n(vi) state the merits and demerits of business units.\n\n \n8. Financing Business\n\n \n\nTopics:\n\n \n\n(i) Sources of finance (personal savings, sale of shares and bonds, loans, debentures, mortgage, bank overdraft, ploughing back of profit, credit purchase, leasing, etc.)\n(ii) Types of capital (share capital, capital owned, authorized (capital, issued capital, called-up capital, paid-up capital, liquid capital, working capital and owners' equity)\n(iii) Calculation of forms of capital, profits (gross and net) and turnover\n(iv) Problems of sourcing finance\n(v) The role of Bureau de change in an economy\n\n \n\nObjectives:\n\nCandidates should be able to:\n(i) identify the various ways of financing a business;\n(ii) discuss the different types of capital\n(iii) compute the different forms of capital, profits and turnover;\n(iv) appraise the problems associated with sourcing finances for business;\n(v) assess the role of bureaux de change in an economy.\n\n \n9. Trade Associations\n\n \n\nTopics:\n\n \n\n(i) Objectives and functions of trade and manufacturer's associations (Cocoa Farmers' Association, Garri Sellers' Association, Poultry Farmers' Association, etc.)\n(ii) Objectives and functions of Chambers of Commerce.\n\n \n\nObjectives:\n\nCandidates should be able to:\n(i) discuss the objectives and functions of trade and manufacturer's associations;\n(ii) list the objectives and functions of Chambers of Commerce.\n\n \n10. Money\n\n \n\nTopics:\n\n \n\n(i) Evolution\n(ii) Forms and qualities\n(iii) Functions Objectives:\n\nCandidates should be able to:\n(i) discuss the origin of money;\n(ii) analyse the forms and qualities of money;\n(iii) appraise the functions of money.\n\n \n12. Elements of Business Management\n\n \n\nTopics:\n\n \n\n(i) Functions (planning, organizing, staffing, coordinating, motivating, communicating, controlling etc)\n(ii) Principles (span of control, unity of command, delegation of authority, etc)\n(iii) Organizational structure (line, line and staff, functional, matrix and committee)\n(iv) Functional areas of business (production, marketing, finance and personnel)\n(v) Business resources (man, money, materials, machines and opportunities/goodwill)\n\n \n\nObjectives:\n\nCandidates should be able to:\n(i) discuss the origin of money;\n(ii) analyse the forms and qualities of money;\n(iii) appraise the functions of money.\n\n \n11. Stock Exchange\n\n \n\nTopics:\n\n \n\n(i) Importance and functions\n(ii) Types of securities (stocks, shares, bonds, debentures, etc)\n(iii) Procedure of transactions and speculations\n(iv) Second-Tier Securities Market, (listing requirements, types of companies for the market, advantages and operating regulations of the market.)\n\n \n\nObjectives: \n\nCandidates should be able to:\n(i) state the importance and functions of the Stock Exchange;\n(ii) identify the different securities traded on the Stock Exchange;\n(iii) analyse the procedure of transactions and speculations on the Stock Exchange;\n(iv) appraise the advantages and operating regulations of the market.\n\n \n13. Elements of Marketing\n\n \n\nTopics:\n\n \n\n(i) Importance and Functions\n(ii) The marketing concept (consumer orientation, customer satisfaction, integrated marketing, etc)\n(iii) Marketing mix (product, price, place and promotion)\n(iv) Market Segmentation\n(v) Public relations and Customer Service\n\n \n\nObjectives:\n\nCandidates should be able to:\n(i) highlight the importance and functions of marketing;\n(ii) discuss the marketing concept;\n(iii) assess the elements of marketing mix;\n(iv) explain market segmentation;\n(v) examine public relations and customer service.\n\n \n14. Legal Aspects of Business\n\n \n\nTopics:\n\n \n\n(i) Meaning and validity of a simple contract\n(ii) Agency, Sale of Goods Act and Hire Purchase Act\n(iii) Contract of employment\n(iv) Government regulations of business (registration of business, patents, trademarks, copyrights, etc)\n(v) Consumer protection (Government legislation, Standards Organization Trade Descriptions Act, Consumer Protection Council, NAFDAC, NDLEA, Customs and Excise, etc.)\n(vi) Regulatory agencies.\n\n \n15. Information and Communication Technology (ICT)\n\n \n\nTopics:\n\n \n\na. Computer:\n(i) Appreciation and application\n(ii) Types and functions\n(iii) Merits and demerits\n(iv) Challenges\nb. Terms (Internet, Intranet, browsing, password, e-mail, google, yahoo, search, Local Area Network, etc.)\nc. Activities:\n(i) e-commerce\n(ii) e-banking\n(iii) e-business\n\n \n\nObjectives:\n\nCandidates should be able to:\n(i) discuss computer appreciation and application;\n(ii) enumerate the types and functions of computer;\n(iii) analyse the merits and demerits of ICT;\n(iv) appraise the challenges of using the computer;\n(v) identify the different terms used in ICT;\n(vi) evaluate the trends in ICT.\n\n \n16. Business Environment and Social Responsibility\n\n \n\nTopics:\n\n \n\n(i) Legal, political, economic, social, cultural, technological environments, etc\n(ii) Safe products, philanthropic and societal consideration\n(iii) Types and implication of pollution (water, air, land, etc.)\n\n \n\nObjectives: \n\nCandidates should be able to:\n(i) discuss the types of business environment;\n(ii) assess the role of social environment in the provision of safe products;\n(iii) identify the different types of pollution and their implications on businesses. RECOMMENDED TEXTS\n\nAnderson, D. J. (1978) Commerce for West Africa, London: Macmillan.\n\nAhukannah, L. I. et al (1992) Commerce for Secondary Schools Onitsha: Africana - First Publishers.\n\nAsaolu, A. and Igwe, P. M. (2005) New Syllabus Commerce for Secondary Schools Books 1 - 3 (Second Edition) Ibadan: Evans.\n\nBabatunde, A. H. (1999) Handbook on Commerce for Schools and Colleges, (First Edition), Global Publications.\n\nEriki, P. O. (1998) Working with Computer, Benin: Bofic Publishers.\n\nFrench, C. S. (2000) Computer Science, (Fifth Edition), Britain: Ashford.\n\nIbru, G. M. (2004) Nigeria: The Promise of Tourism, Lagos: G.S.L. Publishing Limited.\n\nIgwe, P. M. e tal (2004) Countdown to WASSCE/SSCE/NECO/JME Commerce, Ibadan: Evans.\n\nJames, A. F, et al (1996) Management, (Sixth Edition), New Delhi: Prentice Hall).\n\nNwachukwu, C. C. (1999) Management Theory and Practice, Onitsha: Africana - First Publishers.\n\nOdedokun, M. O. et al (1999) Commerce for Senior Secondary Schools, Books 1 - 3, Lagos: Longman.\n\nOdoom, F. F. (1998) Commerce for Senior Secondary Schools, Books 1 - 3, Ibadan: Onibonoje.\n\nOnifade, A. (2001) Management: Office Business Education, Abeokuta: KAPPCO.\n\nOnifade, A. (2002) The Computer for Word Processing and Internet, Abeokuta: KAPPCO.\n\nOnu, A. J. C. (2000) Marketing Today, Abuja: Precious Treasures Ltd.\n\nPallister, J. and Isaacs, A. (eds) (2002) A Dictionary of Business (Third Edition), Oxford: Oxford University Press.\n\nUbaka, O. A., (2012), Commerce Simplified for SSS 1 - 3, WAEC, NECO, JAMB & NABTEB EXAMS, Garki, Abuja: Andyson Millennium Concepts Ltd."
}