{
  "chapIndex": "",
  "text": "SECTION A\n\n \n1. CLASSIFICATION OF ART:\n\n \n\nTopics\n\na. Visual Arts: (Fine and Applied Arts)\nb. Performing Arts: (Music, Dance and Drama)\nc. Literary Arts: (Poetry, Prose, Recitals) etc.\n\n \n\nObjectives\n\n \n\nCandidates should be able to:\n\ni. differentiate between the three branches of art;\n\n \n2. ELEMENTS AND PRINCIPLES OF DESIGN:\n\n \n\nTopics\n\na. Elements: line, colour, shape, form, texture, tone, value, space etc.\nb. Principles: balance, rhythm, proportion, harmony, contrast, repetition, dominance, variety, etc.\n\n \n\nObjective\n\n \n\nCandidates should be able to:\n\ni. identify the elements of design;\nii. analyze the principles of design;\n\n \n\n \n3. ART TERMS:\n\nPigments, motif, greenware, armature, silhouette, chiaroscuro, cireperdue, terracotta etc.\n\n \n\nObjectives;\n\n \n\nCandidates should be able to:\n\ni. identify art terms;\nii. link the terms to their areas of art;\niii. use the terms in analyzing artworks\n\n \nSECTION B\n\n \n\n \n1. HISTORICAL DIMENSIONS OF ART:\n\n \nTopics;\n\na. Prehistoric, Greek and Roman Art;\nb. Medieval Art: architecture, surface decorations and calligraphy;\nc. Renaissance Art and Artists: Giotto Di Bondone, Michelangelo Buonarroti, Leonardo da Vinci and Raphael (Raffaello Santi);\nd. 19th and 20th Century art movements; Impressionism, Realism, Futurism, Cubism, Bauhaus, Pop art, Abstract Expressionism and Fauvism.\n\n \n\nObjectives;\n\nCandidates should be able to:\n\ni. compare their materials, styles and techniques;\nii. classify the periods and styles with emphasis on architecture, surface decoration and calligraphy;\niii. compare the artists, their works and styles;\niv. differentiate between the various art movements; v.\nv. analyze their styles techniques, innovations and influences; 2. TRADITIONAL AFRICAN ART:\n\n \n\nEgypt, Ashanti, Dogon, Mossi, Fon, Senufo, Bambara, Mende, Kissi, Bamileke and Bakumba.\n\n \n\nObjectives;\n\n \n\nCandidates should be able to:\n\ni. categorize works in terms of style, materials and locations;\nii. categorize works in terms of styles, materials and locations;\n\n \n3. TRADITIONAL NIGERIAN ART:\n\n \n\nTopics\n\nNok, Igbo-Ukwu, Ife, Benin, Esie, Igala, Jukun, Akwashi, and Mbari\n\n \n\nObjectives; \n\n \n\nCandidates should be able to:\n\ni. analyze the works in terms of functions, characteristics and locations;\n \n4. NIGERIAN CRAFTS:\n\n \n\nTopics\n\nPottery, woodworks, cloth-weaving, carving, leather works, metal works, beadworks, body decoration, mat and cane weaving.\n\n \n\nObjectives; \n\n \n\nCandidates should be able to:\n\ni. trace the origins, locations and styles;\n \n5. DEVELOPMENT IN CONTEMPORARY NIGERIAN ARTS AND ARTISTS:\n\n \n\nTopics\n\n \n\na. Art Schools: Zaria, Nsukka, Osogbo group etc.\nb. Nigerian artists and art educators; Aina Onabolu, Ben Enwonwu, S. I. Wangboje, Jimoh Akolo, Dele Jegede etc.\nc. Museums, galleries and art centres;\nd. Art institutions, cultural art centres, national art organizations – Nigerian Society for Education through Arts (NSEA), Society for Nigerian Artists (S.N.A), National Council for Arts and Culture (N.C.A.C), etc.\ne. Major Festivals: Argungu Fishing Festival, Eyo, Egungun, Iri-ji (New Yam), Durbar, Igue, Ekpo, Odo, etc.\n\n \n\nObjectives;\n\n \n\nCandidates should be able to:\n\ni. determine the influence of the art schools and groups;\nii. assess the artists in terms of their works, specializations, techniques and styles;\nii. analyze the functions of museums, galleries, art centres and art institutions;\niii. evaluate their impact on the development of art;\niv. assess their roles and functions;\nv. examine the impact of major festivals on art and culture.\n\n \n SECTION C\n \n1. ARTISTIC SKILLS, TECHNIQUES AND PROCESSES\n\n \n\nTopics\n\na. Two-Dimensional Art: drawing, painting, graphics and textile design.\nb. Perspective:\ni. Linear, angular, aerial, parallel etc.\nii. Perspective terms: foreground, picture plane, eye-level, vanishing point, foreshortening, optical illusion, depth etc.\nc. Sculpture, Ceramics and Crafts,\nd. Computer Graphics: CorelDraw\n\n \n\nObjectives;\n\n \n\nCandidates should be conversant with:\n\ni. the techniques, skills and processes with emphasis on tone, composition and colour application;\nii. the types of perspective;\niii. the use of perspective rules and terms;\niv. techniques, skills and processes;\nv. the basic tools of designs 2. TOOLS, MATERIALS AND EQUIPMENT\n\n \n\nTopics;\n\na. Two-Dimensional Art Tools: brushes, lino cutters, drawing instruments, calligraphic pens, sharpeners etc.\nb. Two-dimensional Art Materials: pencils charcoal, pastel, crayon, fixative, fabric, dyes, lino, wood blocks etc.\nc. Two-Dimensional Art Equipment: air compressor, spray gun, enlarger, computer etc.\nd. Improvisation of tools, materials and equipment;\ni. Two-Dimensional Art: colours, brushes, calligraphic pens etc.\nii. Three-Dimensional Art: spatula, kiln, beater, etc.\n\n \n\nObjectives;\n\n \n\nCandidates should be able to:\n\ni. maintain tools and art materials;\nii. use art materials and tools;\niii. operate and maintain art equipment;\nix. improvise alternatives\n\n \nSECTION D \n \n1. ART APPRECIATION\n\n \n\nTopics\n\na. Man-made objects: architecture, sculpture etc.\nb. Natural phenomena: Zuma Rock, Ikogosi Warm Springs, etc\n\n \n\nObjectives; \n\n \n\nCandidates should be able to:\n\ni. appreciate the aesthetic qualities of natural and man-made aesthetic phenomena in Nigerian environment;\nii. differentiate between natural and man-made aesthetic phenomena;\n\n \n\n \n2. MEANING AND FUNCTIONS OF ART IN SOCIETY\n\n \n\nTopics\n\na. Meaning of art;\nb. Functions of art in the society: religious, social, cultural, political, therapeutic and economic needs.\nc. Functions of art in the media: advertisement, education, recreation etc.\n\n \n\nObjectives; \n\n \n\nCandidates should be able to:\n\ni. examine the meaning and functions of art;\nii. use art to enhance societal values;\niii. assess the role of art in the media;\n\n \n \n3. ART ENTREPRENEURSHIP\n\nTopics\n\nJob prospects in Visual Arts: Ceramist, Curator, Textile designer, Industrial designer, Sculptor, Photographer, Cartoonist, Illustrator etc.\n\n \n\nObjectives;\n\n \n\nCandidates should be able to:\n\ni. identify job opportunities in visual arts\n\n \n\n                                               \nRECOMMENDED TEXTS\n \n\nBanjoko I. (2000) Visual Arts made Easy: Textbook for Schools and Colleges, Lagos, Movic Publishing Company Ltd.\n\nEgonwa, O.D. (1991) African Art: A contemporary Source Book, Benin: Osasu Publishers.\n\nEgunlae, S.A. (1985) The Essential Ground work in Art and Design, Omotola Standard Press and Bookshop (Nig) Ltd.\n\nErese, U. O. and Ogunsina E. D. (1989) Creative Arts and Crafts for J. S. S. Onibonoje Press.\n\nNahab, S. J. (2003) Art of the Millennium for Senior Secondary Schools, Ehindero (Nig.) Ltd.\n\nOgumor, E. (1993) Certificate Art for Junior Secondary Schools and Senior Secondary Schools, Ibadan: University Press Plc. Olaosebikan W. A. (1982) Cultural and Creative Arts, Evans.\n\nOlurukooba, B. K. (1991) Art for Senior Secondary Schools, ABU.\n\nUzoagba I. N. (1982) Understanding Art in General Education, Onitsha; African Publishing Ltd.\n\nWangboje, I. N. (1982) A Textbook on Art for Junior and Senior Secondary Schools, Evans Publishers."
}