{
  "chapIndex": "",
  "text": "1. Written Comprehension in French: -\n\n \n\nTopics of general and emergent interest e.g. love, life, death, politics, marriage, HIV/AIDS, communication, child trafficking, cultism, travel, corruption, money- laundering, etc.\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\n(i) deduce answers to questions on the content, intent and style of proposed texts,\n(ii) apply reasoning skills.\n\n \n2. Principles Governing the Structure and Use of Written French:\n \n\nTopics: I. Identification of basic form classes:\n\n(a) Nouns: simple/compound, Singular/plural, masculine/feminine.\n(b) Pronouns: personal, impersonal, demonstrative, possessive and relative.\n(c) Verbs: reflexive and non-reflexive, their moods and tenses.\n(d) Adjectives: qualifying, possessive, interrogative, demonstrative, indefinite (e.g. nul), numeral (e.g. dix) and ordinal (e.g. dixième.)\n(e) Adverbs: - common forms\n(i) with-ment (e.g. lentement)\n(ii) with préposition + noun (e.g. par avion, à cheval, en voiture, par bateau.) - special forms (e.g. bien, vite, mal, mieux, le mieux, pire, le pis, ne…que.)\n- types\n- manner (e.g. debout, facilement.)\n- purpose (e.g. pour + Infinitive, afin de + infinitive.)\n- cause and consequence (e.g. pour+ infinitive perfect, à cause de + noun.)\n- concession (e.g. malgré +noun.)\n- place (e.g. y, en, ici, là, là-haut, partout.)\n- time (e.g. hier, aujourd’hui, avant-hier, après, demain, la veille, le matin, dans un mois.)\n(f) Prépositions:\n- simple (e.g. à, de, avec, avant, sur, dans.)\n- compound (e.g. à côté de, au milieu de.)\n(g) Conjunctions:\n- of co-ordination (e.g. mais, ou, et, donc, car, cependant, ne…ni.) -of subordination (e.g. afin que, quoique, à condition que, pour que, parce que.)\n(h) Articles:\n - definite, indefinite and partitive.\n\nII. Assessment of vocabulary span: (words in contemporary contexts - meaning, use, opposites, Synonyms)\n\nIII. Importance of word order in:\n(a) affirmative sentences\n(b) interrogative sentences\n(c) imperative sentences\n(d) passive voice formation\n\nIV. Identification and application of basic processes in language structure, e.g.\n(a) conjugation - in all tenses except l’imparfait du subjonctif, le passé composé du subjonctif, et…le plus-que-parfait dusubjonctif.\n(b) negation (e.g. ne…pas, ne…plus, ne…rien, nul ne, ne…ni..ni, ne…personne, personne…ne, aucun….ne, rien ne….etc.)\n(c) agreement (e.g. les beaux arts, il les a vues les photos.)\n(d) pluralisation (e.g. as in cheval/chevaux, beau/beaux.)\n(e) derivation: -from adj, to adv – e.g. lent-lentement, -from adj. to adj. e.g. un – premier, -from adj. to noun – e.g. bon-bonté, riche-richesse etc -from one degree of comparison to another (using plus…que, moins….que, aussi….que e.g. plus grand que.) NB –special forms- (e.g. bon, meilleur, le meilleur, la meilleure, mauvais, pire, le pire.)\n\nV. Use of French in set expressions such as in proverbs, idioms and conventional structures as provided for in common speech acts:\n(a) proverbs (e.g. tel père tel fils, petit à petit l’oiseau fait son nid.)\n(b) idioms (e.g. avoir une faim de loup, crier sur le toit, mourir de peur.)\n(c) conventional stretches (e.g. enchanté, c’est dommage, c’est formidable, stationnement interdit, etc.)\n(d) speech acts (e.g. proposer, conseiller, regretter, admirer, espérer, interroger, reprocher, s’accorder, etc.)\n\n \n\nObjectives;\n\n \n\nCandidates should be able to:\n\ni. identify what constitutes the basic structures of written French,\nii. use the principles governing the structure of written French to determine acceptability, e.g. to transform one form; one class into another,\niii. apply the structure to convey diverse messages.\niv. apply communicative skills\n\n \n3. Workings of French sounds via:\n \n\nTopics:\n\n(a) sound discrimination (e.g. tout/tu), (fais/fée.)\n(b) letter-sound correspondence (e.g. ai-/e/, eau/o/.)\n(c) syllabification (e.g. con/tente/ment.)\n(d) liaison (e.g. trois animaux, des enfants.)\n(e) sense groups in reading e.g. J’ai mal à la tête. J’ai mal/pas à la tête / mais au dos/. Comment vas-tu, Carol?// Comment vas- tu demain?\n(f) faux amis(e.g.librairie/library, rester/to rest, blesser/to bless.)\n(g) identification of sounds to determine similarity (e.g. maison/saison, dents/don,fond/ fonde.)\n\n \n\nObjectives; Candidates should be able to:\n\n(i) discriminate between French sounds,\n(ii) deduce meanings out of sound combinations,\n(iii) use the above to enhance effective communication,\n(iv) assess sound groupings in terms of how they are affected by such features as syllabification, liaison, e-caduc; pause, intonation, etc.\n\n \n4. Culture and Civilization:\n \n\nCharacteristics , (aspects, similarities and differences) of the educational system, socio-economic life, political organization and cultural life of Francophone Africa and France, with reference (where possible) to home country i.e. Nigeria.\n\n \n\nObjectives:\n\n \n\nCandidates should be able to:\n\ni. identify the specific features of the culture of Francophone Africa and France greetings, dressing, food, leisure, marriage, festival, art, profession etc.\nii. compare these features with those of home country ( where possible),\niii. apply reasoning skill.\n\n \n\n \nRECOMMENDED TEXTS\n \n\n     A.      (i)                                                        Written Language\n\nAjiboye, T. (2014) Companion to French Grammar (4thEdition): Ibadan: Cleavoketa books\nAjiboye, T. (2012) Nouvel Horizon, Book 4, New Revised Edition, Ibadan: Bounty Press\nHatier (1980) Le Nouveau Bescherelle: L’Art de Conjuguer, Ibadan: Spectrum Book Ltd.\nMaice, G et Merlo, G., (1998), Grammaire progressive du français ( Niveauintermediaire), Paris: Clé international.\nMazauric,. C, et Sirejols, E. (2006) On y va! Book 3,Ibadan: Spectrun Books Ltd.\nOjo, S. A.(2000) A Comprehensive Revision Handbook of French Grammar, Ibadan: Agoro Publishing Company.\n\nAny other relevant materials on French Grammar.\n\n         (ii)                                                                     Oral\n\nAjiboye, T. (2010) An Introduction to Practice in Oral French, Ibadan: Bounty Press. Any other materials that emphasis oral practice.\n\n      B.                                                             Culture of Francophone Countries\n\nGirod R and Grand-Clement, F. (1979) Comment vivent les Français, Paris: Hachette\nMbuko, L. (2000) French Essays on Culture and Civilization for Schools and Colleges, Ibadan: Bounty Press.\nAny other relevant materials, e.g. French newspapers, magazines, journals, and documents on Francophone life.\n\n      C.                                           Dictionary\nAny good French/English or French dictionary."
}