{
  "chapIndex": "",
  "text": "I. PRACTICAL GEOGRAPHY\n\n \n\nTopics:\n\n \nA. Maps\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. define and identify different types and uses of maps\n\n \nB. Scale and measurement\n\n \n\nTopics:\n\ndistances, areas reduction and enlargement, directions, bearings and gradients with reference to topographical maps.\n\n \n\nObjectives: \n\nCandidates should be able to:\n\ni. apply the different types of scale to distances and area measurement;\nii. apply the knowledge of scale to gradients, map reduction and enlargement;\n\n \nC. Map reading and interpretation;\n\n \n\nTopics:\n\ndrawing of cross profiles, recognition of intervisibility, recognition and description of physical and human features and relationship as depicted on topographical maps.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. illustrate the relief of an area through profile drawing;\nii. interpret physical and human features from topographical maps.\n\n \nD. Interpretation of statistical data;\n\n \n\nTopics:\n\n \n\nmaps and diagrams\n\nCandidates should be able to:\n\n \n\nObjectives: \n\ni. Compute quantitative information from statistical data, diagrams and maps,\nii. interpret statistical data, diagrams and maps.\n\n \nE. Elementary Surveying;\n\n \n\nTopics:\n\nchain and prismatic, open and close traverse, procedure, problems, advantages and disadvantages.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. analyse the principle and procedure of each technique;\nii. compare the advantages of the two techniques.\n\n \nF. Geographic Information System (GIS):\n\n \n\nTopics: \n\n \n\ncomponents, techniques, data sources, applications\n\n \n\nObectives: \n\nCandidates should be able to:\n\ni. Understand GIS and its uses.\nii. Understand the computer system of data capturing and analysis\niii. Express locations through the use of latitudes, longitudes, zipcodes etc.\niv. Understand land surveying, remote sensing, map digitizing, map scanning as sources of data.\nv. Explain areas of use: Defense, Agriculture, Rural Development etc.\nvi. Identify problems with GIS in Nigeria.\n\n \nII. PHYSICAL GEOGRAPHY\n\n \nA. The earth as a planet\n\n \n\nTopics:\n\n \n\ni. The earth in the solar system, rotation and revolution;\nii. The shape and size of the earth\niii. Latitudes and distances, longitudes and time\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. identify the relative positions of the planets in the solar system;\nii relate the effects of the rotation to the revolution of the earth;\niii provide proof for the shape and size of the earth;\niv differentiate between latitudes and longitudes;\nv relate lines of latitude to calculation of distance;\nvi relate lines of longitude to calculation of time;\n \nB. The Earth Crust\n\n \n\nTopics:\n\n \n\n i. The structure of the earth (internal and external) Relationships among the four spheres.\nii. Rocks: Types, characteristics, modes of formation and uses\niii. Earth’s movement: Tectonic forces\niv. Major Landforms: Mountains, Plateaux, Plains, Coastal landforms, karst topography and desert landforms\n\n \n\nObjectives:\n\nCandidates should be able to: i. compare the internal and external components of the earth.\nii. understand the existing relationship among atmosphere, biosphere in terms of energy balance and water cycle.\niii. differentiate between major types of rocks and their characteristics;\niv. analyse the processes of formation and the resultant features;\nv. indicate the uses of rocks.\nvi. differentiate between tensional and compressional forces and the resultant landforms.\nvii. identify and describe the major landforms\n\n \nC. Volcanism and Earthquakes\n\n \n\nTopics:\n\n \n\ni. landforms associated with volcanic activities\nii. landforms of Igneous Rocks\niii. origin and types of Volcanoes\niv. some volcanic eruptions and earthquakes\n \n\nObjectives: \n\nCandidates should be able to:\n\nCi. explain the processes of volcanic eruptions and earthquakes\nii. describe the different landforms associated with both volcanic eruptions and earthquakes.\niii. give examples of major volcanic eruptions and earthquakes in the world.\n\n \nD. Denudation processes in the tropics\n\n \n\nTopics:\n\n \n\ni. weathering\nii. erosion\niii. mass movement\niv. deposition\n\n \n\nObjectives:\n\nCandidates should be able to:\n\nDi. identify the agents of denudation\nii. associate landforms with each process and agent.\n\n \nE. Water Bodies\n\n \n\nTopics:\n\n \n\ni. Oceans and seas (world distribution, salinity and uses)\nii Ocean currents - types, distribution, causes and effects;\niii Lakes - types, distribution and uses.\niv. Rivers: Action of running water.\n\n \n\nObjectives: \n\nCandidates should be able to:\n\ni.  locate oceans and seas on the globe;\nii. examine the characteristics and uses of oceans and seas;\niii. classify the types of ocean currents;\niv. account for the distribution of ocean currents;\nv. evaluate the causes and effects of ocean currents;\nvi. identify the types and location of lakes;\nvii. indicate the characteristics and uses of lakes\nviii. identify the landforms of the different stages of a river course.\n\n \nF. Weather and Climate\n\n \n\nTopics:\n\n \n\ni Concept of weather and climate\nii Elements of weather and climate\niii Factors controlling weather and climate (pressure, air mass, altitude, continentality and winds)\niv Classification of climate (Greek and Koppen).\nv Major climate types (Koppen), their characteristics and distribution.\nvi Measuring and recording weather parameters and instruments used.\nvii The basic science of climate change.\n \n\nObjectives:\n\nCandidates should be able to:\n\nFi. differentiate between weather and climate;\nii differentiate between the elements of weather and climate;\niii isolate the factors controlling weather and climate;\niv compare Koppen’s and Greek’s classifications\nv identify the major types of climate according to Koppen;\nvii relate the weather instruments to their uses.\nviii define climate change\nix understand the causes of climate change\nx understand the effects and remedies of climate change.\n\n \nG. Vegetation\n\n \n\nTopics:\n\n \n\ni Factors controlling growth of plants\nii The concept of vegetation e.g. plant communities and succession\niii Major types of vegetation, their characteristics and distribution,\niv Impact of human activities on vegetation.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. trace the factors controlling the growth of plants;\nii analyse the process of vegetation development;\niii identify the types, their characteristics and distribution;\niv assess the impact of human activities on vegetation;\n\n \nH. Soils\n\n \n\nTopics:\n\n \n\ni. Definition and properties\nii. Factors and processes of formation\niii. Soil profiles\niv. Major tropical types, their characteristics, distribution and uses;\nv. Impact of human activities on soils.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\nHi. classify soils and their properties;\nii. isolate the factors of formation;\niii. differentiate between the different types of soil horizons and their characteristics;\niv. compare the major tropical soil types and uses of soils;\nv. account for the distribution and uses of soils;\nvi. assess the impact of human activities on soils.\n\n \nI. Environmental Resources;\n\n \n\nTopics:\n\n \n\ni Types of resources (atmospheric, land, soil, Vegetation and minerals)\nii The concept of renewable and non- renewable resources;\n\n \n\nObjectives:\n\nCandidates should be able to:\n\nIi. interpret the concept of environmental resources;\nii. relate environmental resources to their uses;\niii. differentiate between the concepts of renewable and non-renewable resources\n\n \nJ. Environmental interaction:\n\n \n\nTopics:\n\n \n\ni Land ecosystem\nii Environmental balance and human interaction\n\n Objectives:\n\nCandidates should be able to:\n\nJi. identify the components of land ecosystem;\nii. establish the interrelationship within the ecosystem;\niii. interpret the concept of environmental balance;\niv. analyse the effects of human activities on land ecosystem.\n \nK. Environmental hazards:\n\n \n\nTopics:\n\n \n\ni. Natural hazards (droughts, earthquakes, volcanic eruptions, flooding)\nii. Man-induced (soil erosion, deforestation, pollution, flooding and desertification)\niii. Effects, prevention and control of hazards.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\nKi. identify the natural hazards and their causes;\nii. relate the human-induced hazards to their causes;\niii. locate the major areas where they are common and their effects;\niv. recommend possible methods of prevention and control.\n\n \nL. Environmental Conservation\n\n \n\nObjectives:\n\nCandidates should be able to:\n\nLi. Explain with examples environmental conservation\nii discuss the different methods of environmental conservation.\niii Explain the need/importance of environmental conservation\n \nIII. HUMAN GEOGRAPHY\n\n \nA. Population\n\n \n\nTopics:\n\n \n\ni. World population with particular reference to the Amazon Basin, N.E. U.S.A., India, Japan and the West Coast of Southern Africa.\nii. Characteristics - birth and death rates, ages/sex structure.\niii. Factors and patterns of population distribution;\niv . Factors and problems of population growth.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\nAi. Define different concepts of population;\nii. identify the characteristics of population (growth rates and structure);\niii. determine the factors and the patterns of population distribution;\niv. identify the factors and problems of population growth;\nv. relate the types of migration to their causes and effects;\nvi. account for the ways population constitute a resource.\n\n \nB. Settlement with particular reference to Western Europe, the USA, Middle East and West Africa:\n\n \n\nTopics:\n\n \n\ni. Types and patterns: rural and urban, dispersed, nucleated and linear;\nii. Rural settlement: classification, factors of growth and functions;\niii. Urban settlement - classification, factors of growth and functions.\niv. Problems of urban centres\nv. Interrelationship between rural and urban settlements.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\nBi. differentiate between types of settlements; (rural and urban)\nii. classify the patterns and functions of rural settlements;\niii. classify the patterns and functions of urban settlements;\niv identify the problems of urban centres;\nv. establish the interrelationship between rural and urban settlements;\n\n \nC. Selected economic activities\n\n \n\nTopics:\n\n \n\ni. Types of economic activities: primary, secondary, tertiary and quartnary;\nii. Agriculture: types, system, factors and problems\niii. Manufacturing industries, types, locational factors, distribution and socio- economic importance and problems of industrialization in tropical Africa.\niv. Transportation and Communication types, roles in economic development and communication in tropical Africa.\nv. World trade-factors and pattern of world trade, major commodities (origin, routes and destinations).\nvi. Tourism: definition, importance, location, problems and solutions.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. identify the types of economic activities;\nii. differentiate between the types of economic activities;\niii. assess Agriculture as an economic activity;\niv. compare the types of manufacturing industries;\nv. identify the factors of industrial location;\nvi. examine the socio-economic importance of manufacturing industries;\nvii. give reasons for the problems of industrialization in tropical Africa;\nviii. differentiate between the types and means of transportation and communication;\nix. assess the economic importance of transport;\nx. give reasons for the problems of transportation in tropical Africa;\nxi. relate the factors to the pattern of world trade.\nxii. classify the major commodities of trade in terms of their origins, routes and destination.\nxiii. Analyse tourism as an economic activity.\n\n \nIV. REGIONAL GEOGRAPHY\n\n \nA. Broad outline of Nigeria\n\n \n\nTopics:\n\n \n\ni. Location, position, size, political division (states) and peoples;\nii Physical settling: geology, relief, landform, climate and drainage, vegetation and soils;\niii Population: size, distribution, migration, (types, problems and effects);\niv Natural Resources: types (minerals, soils, Water, vegetation etc) distribution, uses and conservation.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\nAi. describe the location, size and political divisions of Nigeria;\nii. identify the ethnic groups and their distributions;\niii. relate the components of physical settings to their effects on human activities;\niv. account for the pattern of population distribution;\nv. examine the types of migration, their problems and effects;\nvi. identify the types of natural resources and their distribution;\nvii. indicate their uses and conservation;\n\n \nB. Economic and Human Geography:\n\n \n\nTopics:\n\n \n\ni. Agricultural Systems: the major crops produced, problems of agricultural development in Nigeria.\nii. Manufacturing Industries: factors of location, types of products, marketing and problems associated with manufacturing;\niii. Transportation and Communication:modes of transportation and communication and their relative advantages and disadvantages;\niv. Trade: Regional and International Trade, advantages and disadvantages;\nv. Tourism: types, importance, problems and solutions.\n\n \n\nObjectives: \n\n \n\nCandidates should be able to:\n\ni. compare the farming systems practiced in Nigeria;\nii. identify the crops produced and the problems encountered;\niii. identify the types and location of the major manufacturing industries;\niv. determine the factors of industrial location and the problems associated with the industries;\nv. establish the relationship between transport and communication;\nvi. relate the modes of transportation and communication to their relative advantages and disadvantages;\nvii. classify the major commodities of regional and international trade;\nviii. identify reasons for tourism and tourist centres;\nix. account for the problems and solutions\n \nC. ECOWAS\n\n \n\nTopics:\n\ni. Meaning and objectives\nii. Member states\niii. Advantages and benefits\niv. Disadvantages, problems and solutions\n\n \n\nObjectives: Candidates should be able to:\n\ni. State the meaning, purpose and objectives;\nii. identify and locate the member countries;\niii. evaluate the prospects and problems of the organization.\n\n \n\nRECOMMENDED TEXTS\n\nAdeleke, B.O. Areola .O. 2002 and Leong, G.C. Certificate Physical and Human Geography for Senior Secondary School (West African Edition), Ibadan: Oxford.\n\nBradshaw, M. et al (2004) Contemporary World Regional Geography, New York: McGraw Hill\n\nBunet, R.B and Okunrotifa, P.O.(1999) General Geography in Diagrams for West Africa, China: Longman.\n\nCollins New Secondary Atlas, Macmillan\n\nFellman, D. et al (2005) Introduction to Geography (Seventh Edition) New York: McGraw Hill\n\nGetis, A. et al (2004) Introduction to Geography (Ninth Edition) New York: McGraw Hill\n\nIloeje, N. P(1999) A New Geography of West Africa, Hong Kong: Longman\n\nIloeje, N.P(1982) A New Geography of Nigeria (New Education), Hong Kong: London\n\nNimako, D.A. (2000) Map Reading of West Africa, Essex: Longman.\n\nOkunrotifa, P.O. and Michael S. (2000) A Regional Geography of Africa (New Edition), Essex: London.\n\nUdo, R.K(1970) Geographical Regions of Nigeria, London: Longman.\n\nWaugh, D. (1995) Geography an Integrated Approach (Second Edition), China: Nelson\n\nWisdomline Pass at Once JAMB.\n\nAdegoke M.A (2013), A Comprehensive Text on Physical, Human and Regional Geography."
}