{
  "chapIndex": "",
  "text": "PART 1: ELEMENTS OF GOVERNMENT\n\n \n1. Basic Concepts in Government\n\n \n\nTopics:\n\n \n\na. Power, Authority, Legitimacy,Sovereignty;\nb. Society, State, Nation, Nation-State;\nc. Political Processes;Political Socialization, Political Participation, Political Culture.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. identify the fundamental concepts in governance;\nii. analyse various political processes;\n \n2. Forms of Government:\n\n \n\nTopics:\n\n \n\nMonarchy, Aristocracy, Oligarchy, Autocracy, Republicanism, Democracy definitions, features, merits and demerits.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. distinguish between different forms of government.\n \n3. Arms of Government:\n\n \n\nTopics:\n\n \n\na. The Legislature - types, structure, functions, powers;\nb. The Executive - types, functions, powers;\nc. The Judiciary - functions, powers, components.\nd. Their relationships\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. identify the duties and obligations of the various arms of government and their agencies;\nii. relate each arm to its functions;\niii. appreciate how these arms interrelates.\n\n \n4. Structures of Governance:\n\n \n\nTopics:\n\n \n\na. Unitary - features, reasons for adoption, merits and demerits\nb. Federal - features, reasons for adoption, merits and demerits\nc. Confederal - features, reasons for adoption, merits and demerits.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. compare the various political structures of governance.\n \n5. Systems of Governance:\n\n \n\nTopics:\n\n \n\nPresidential, Parliamentary and Monarchical.\n\n \n\nobjectives:\n\nCandidates should be able to:\n\ni. distinguish between the different systems of governance.\n\n \n6. Political Ideologies:\n\n \n\nTopics:\n\nCommunalism, Feudalism, Capitalism, Socialism, Communism, Totalitarianism, Fascism, Nazism.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. differentiate between the major political ideologies;\nii. contrast modes of production\n\n \n7. Constitution:\n\n \n\nTopics:\n\n \n\nMeaning, Sources, Functions, Types - Written, Unwritten, Rigid and Flexible.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. Define and identify sources and functions of constitutions;\nii. compare the nature of constitutions.\n\n \n8. Principles of Democratic Government:\n\n \n\nTopics:\n\n \n\nEthics and Accountability in Public Office, Separation of Power, Checks and Balances, Individual and Collective Responsibility, Constitutionalism, Rule of Law, Representative Government.\n\n \n\nobjectives:\n\nCandidates should be able to:\n\ni. identify the principles of democratic government;\nii. determine the application of these principles;\n\n \n9. Processes of Legislation:\n\n \n\nTopics:\n\n \n\nLegislative Enactments - acts, edicts, bye-laws, delegated legislation, decrees.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. analyse the processes involved in the making of laws.\n\n \n10. Citizenship:\n\n \n\nTopics:\n\n \n\na. Meaning, types;\nb. Citizenship rights;\nc. Dual citizenship, renunciation, deprivation;\nd. Duties and obligations of citizens;\ne. Duties and obligations of the state.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. differentiate between the various methods of acquiring citizenship;\nii. specify the rights and responsibilities of a citizen;\niii. assess the obligations of the state.\n\n \n11. The Electoral Process:\n\n \n\nTopics:\n\n \n\na. Suffrage - evolution, types;\nb. Election - types, ingredients of free and fair election;\nc. Electoral System - types, advantages and disadvantages of each;\nd. Electoral Commission - functions, problems. Objectives:\n\nCandidates should be able to:\n\ni. distinguish the different types of franchise\nii. identify and explain the types of electoral systems\niii. analyse the various electoral processes.\n\n \n12. Political Parties and Party Systems:\n\n \n\nTopics:\n\n \n\na. Political parties - Definition, Organization, functions.\nb. Party Systems - Definition, organization, functions.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. assess the role of political parties;\nii. distinguish between types of party systems.\n\n \n13. Pressure Groups:\n\n \n\nTopics:\n\n \n\na. Definition, types, functions and modes of operation.\nb. Differences between Pressure Groups and Political Parties.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. evaluate the functions and the modus operandi of pressure groups;\nii. distinguish between pressure groups and political parties.\n\n \n14. Public Opinion:\n\n \n\nTopics:\n\n \n\na. Meaning, formation and measurement.\nb. Functions and limitations.\n\n \n\nobjectives:\n\nCandidates should be able to:\n\ni. compare methods of assessing public opinion;\nii. assess the functions of public opinion;\niii. analyse the limitations of public opinion.\n\n \n15. The Civil Service:\n\n \n\nTopics:\n\n \n\nDefinition, characteristics, functions, structure, control and problems.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. analyse the significance of civil service in governance.\n\n \nPART II POLITICAL DEVELOPMENT IN NIGERIA\n\n \n1. Pre - colonial Polities:\n\n \n\nTopics:\n\n \n\nPre-jihad Hausa, Emirate, Tiv, Igbo, Yoruba\na. Their structural organization;\nb. The functions of their various political institutions.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. appreciate the effectiveness of the pre-colonial political systems;\nii. compare pre-colonial systems of governance.\n\n \n2. Imperialist Penetration:\n\n \n\nTopics:\n\n \n\na. The British process of acquisition - trade, missionary activities, company rule, crown colony, protectorate;\nb. The British colonial administrative policy - direct and indirect rule;\nc. The French colonial administrative policy - assimilation and association;\nd. Impact of British colonial rule- economic, political, socio-cultural;\ne. Comparison of British and French colonial administration.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. trace the processes of imperialist penetration;\nii. assess the impact of British and French policies;\niii. distinguish between British and French colonial practices.\n\n \n3. Process of Decolonization:\n\n \n\nTopics:\n\n \n\na. Nationalism - Meaning, Types;\nb. Nationalist Movements - emergence, goals, strategies;\nc. Nationalist Leaders - Herbert Macaulay, Nnamdi Azikiwe, Obafemi Awolowo, Ahmadu Bello, Ladipo Solanke, Aminu Kano, J. S. Tarka, Tafawa Balewa and others;\nd. Emergence of nationalist parties;\ne. Influence of external factors.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. evaluate the process of decolonization;\nii. assess the roles of nationalist leaders and parties;\niii. assess the impact of external forces and ideas (Pan-Africanism, Back-to-Africa Movements, Second World War etc).\n\n \n4. Constitutional Development in Nigeria:\n\n \n\nTopics:\n\n \n\na. Hugh Clifford Constitution (1922)\nb. Arthur Richards Constitution (1946)\nc. John Macpherson Constitution (1951)\nd. Oliver Lyttleton Constitution (1954)\ne. Independence Constitution (1960)\nTheir features, merits and demerits.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. compare the various constitutional developments.\n\n \n5. Post - Independence Constitutions:\n\n \n\nTopics:\n\n \n\n1963, 1979, 1989 and 1999- characteristics and shortcomings.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. assess the workings of the various constitutions.\n\n \n6. Institutions of Government in the Post - Independence Nigeria:\n\n \n\nTopics:\n\n \n\na. The Legislative - structure, functions and working.\nb. The Executive - structure, functions and workings.\nc. The Judiciary - structure, functions and workings.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. evaluate the operations of the arms of government and their agencies, e.g the civil service, armed forces, police, courts and others.\n\n \n7. Public Commissions Established by the 1979 and Subsequent Constitutions: Topics:\n\n \n\nThe Civil Service Commission, the Public Complaints Commission, Electoral Commissions, National Boundary Commission and others - objectives functions and problems.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. evaluate the operations of public commissions;\nii. assess the problems of the Public Commissions and their constraints.\n\n \n8. Political Parties and Party Politics in Post-Independence Nigeria:\n\n \n\nTopics:\n\n \n\na. First Republic\nb. Second Republic\nc. Third Republic\nd. Fourth Republic - Evolution, membership spread, structure etc.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. contrast political processes in the republics;\nii. evaluate the ideologies, structure and composition of the political parties.\n\n \n9. The Structure and Workings of Nigerian Federalism:\n\n \n\nTopics:\n\n \n\na. Rationale for a Federal System;\nb. Tiers of government and their relationship;\nc. Creation of States - 1963, 1967, 1976, 1987, 1991, 1996;\nd. Problems of Nigerian Federalism - census, revenue allocation, conflicts etc. solutions e.g. Federal character, etc.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. examine the workings of Nigerian federalism;\nii. identify its problems;\niii. evaluate the corrective measure adopted.\n\n \n10. Public Corporations and Parastatals:\n\n \n\nTopics:\n\n \n\na. Definition, types, purpose and functions;\nb. Finance, control and problems;\nc. Deregulation, privatization, commercialization - objectives, features, merits and demerits;\nd. Comparison between public corporations and parastatals.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. examine the operations of public corporations and parastatals;\nii. identify the processes involved in privatization and commercialization;\niii. assess the economic importance of privatization and commercialization.\n\n \n11. Local Government:\n\n \n\nTopics:\n\n \n\na. Local government administration prior to 1976;\nb. Features of local government reforms (1976, 1989) - structure, functions, finance and inter-governmental relations;\nc. Traditional rulers and local governments;\nd. Problems of local government administration in Nigeria.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. trace the evolution and structure of local government;\nii. identify the major problems faced by local governments.\n\n \n12. The Military in Nigerian Politics:\n\n \n\nTopics:\n\n \n\na. Factors that led to military intervention;\nb. Structure of military regimes;\nc. Impact of military rule - political, e.g creation of states, introduction of unitary system (Unification Decree NO. 34) etc. economic, e.g SAP, etc.\nd. Processes of military disengagement.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. evaluate the reasons given for military intervention;\nii. assess the achievements of military rule;\niii. determine the conditions that necessitated withdrawal from governance.\n\n \nPART III: FOREIGN POLICY AND NIGERIA'S RELATIONS WITH THE INTERNATIONAL COMMUNITY\n\n \n1. Foreign Policy:\n\n \n\nTopics:\n\n \n\n- Definition, purpose, determining factors; formulation and implementation.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. Define foreign policy, identify and explain its determinants\n\n \n2. Nigeria's Foreign Policy:\n\n \n\nTopics:\n\n \n\na. Relations with major powers;\nb. Relations with developing countries, e.g the Technical Aid Corps (TAC), etc.\nc. Nigeria's Non-Alignment Policy.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. identify the major objectives of Nigeria's foreign policy.\nii. analyse Nigeria's non-aligned posture.\n\n \n3. Relations with African Countries:\n\n \n\nTopics:\n\n \n\na. Africa as the \"centre piece\" of Nigeria's forieign policy - guiding principles, implementation and implications;\nb. NEPAD - origin, objectives and implications.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. evaluate the role of Nigeria in continental affairs;\nii. assess the role of NEPAD in developing Africa.\n\n \n4. Nigeria in International Organizations\n\n \n\nTopics:\n\n \n\na. The United Nations;\nb. The Commonwealth;\nc. The Organization of African Unity;\nd. The African Union;\ne. The Economic Community of West African States (ECOWAS);\nf. The Organization of Petroleum Exporting Countries (OPEC).\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. analyse the dynamics of Nigeria's involvement in international organizations;\nii. assess their contribution to the development of Nigeria.\n\n \nPART IV: INTERNATIONAL ORGANIZATIONS:\n\n \n1. International Organizations:\n\n \n\nTopics:\n\na. ECOWAS;\nb. OAU, AU;\nc. Commonwealth;\nd. OPEC;\ne. UNO;\nf. African Petroleum Producers Association;\n- Origin, objectives, structure, functions, achievements, problems and prospects of these organizations.\n\n \n\nObjectives: Candidates should be able to:\n\ni. evaluate the operations of these international organizations;\nii. assess the role of these organizations in world affairs;\niii. appreciate the challenges of these organizations and how they can be overcome.\n\n\n\n \nRECOMMENDED TEXTS\n\nAdigwe, F (1985) Essentials of Government for West Africa, Ibadan: University Press Plc.\n\nAnifowose, R and Enemuo, F. C (eds)(1999) Elements of Politics, Lagos; Malthouse Press Limited.\n\nAppadorai, A. (1978) The Substance of Politics, London: Oxford University Press.\n\nBall, A. R. (1983) Modern Politics and Government, London: Macmillan.\n\nOfoegbu, R. (1977) Government for the Certificate Year, London: George Allen and Unwin.\n\nOlawale, J. B (1987) New Topics on Ordinary Level Government, Ilesha: Jola Publishing.\n\nOyediran, O. Nwosu, H., Takaya, B., Anifowoshe, R., Femi, B., Godwill, O. and Adigun, A. (1990) Government for Senior Secondary Schools, Books 1, 2 and 3, Ibadan: Longman.\n\nOyeneye, I., Onyenwenu, M. and Olusunde, B. E. (2000) Round-Up Government for Senior Secondary School Certifcate Examination: A Complete Guide, Ibadan: Longman.\n\nOyovbaire, S., Ogunna, A. E. C., Amucheazi, E. C., Coker, H. O. and Oshuntuyi, O. (2001) Countdown to Senior Secondary Certificate Examination: Government, Ibadan: Evans."
}