{
  "chapIndex": "",
  "text": "Topic\n\n1.Harshe (Language) (a)Ƙa’idojin Rubutu (Orthography) –alphabetization; spelling; rules of word merger and division; punctuation, paragraphing; all in line with standard Hausa.\n\n \n\nObjectives\n\nCandidates should be able to:i. recognize the basic Hausa orthographical rules;ii. apply the Hausa orthographical rules;iii. identify linguistic errors, such as grammar, wrong choice of words, wrong spelling etc.\n\n \n\nTopics\n\n(b)Auna Fahimta (Comprehension) -contextual questions from short unseen passages of about 200 words.\n\n \n\nObjectives\n\ni. read written Hausa texts;\n\nii. comprehend a given Hausa text;iii.interpret various meanings and functions of words in a given text;\n\niv. acquire sufficient vocabulary;\n\nv. recognize central issues in a given text;\n\nvi. draw conclusions based on available evidence in a given text.\n\n \n\nTopic\n\n(c) Tsarin Rubutun Insha’i (Composition/Letter Writing Techniques)\n\n \n\nObjectives\n\ni. acquire the knowledge of the techniques of composition writing in Hausa;\n\nii. recognize the different segments of composition in Hausa;\n\niii. recognize the different types of Hausa composition.\n\n \n\nTopic\n\n(d) Fassara (Translation)\n\ni. Ire-iren fassaraii. Ƙa’idojin fassaraiii. Matsalolin fassara\n\n \n\nObjective\n\ni. translate proverbial and idiomatic expressions and new words from English to Hausa;\n\nii. recognize the different types of translation;\n\niii. understand the basic techniques of translating proverbial and idiomatic expressions and new words into Hausa;\n\niv. identify the problems of translation into Hausa.\n\n \n\nTopic\n\n(e) Tsarin Sauti (Phonology)\n\ni. consonants –production and classification in terms of phonation, place and manner of articulation;\n\nii. vowels –production and classification in terms of position of tongue and lips; monophthongs and dipthongs;\n\niii. tone –e.g. high, low and falling tones;iv.syllable structure –syllable types, e.g. open and close syllables, light and heavy,syllables,syllabic categories of words –monosyllabic, disyllabic, etc.\n\nv. vowel length –long and short vowels;vi.phonological processes –e.g. assimilatory: palatalization, labialization and vowel harmony; non-assimilatory: insertion and deletion.\n\n \n\nObjectives\n\ni.analyse the process of sound production and combination of sounds to form meaningful word sin Hausa;\n\nii.appraise the importance of vowels in determining word meaning;\n\niii. distinguish between the phonetic attributes of sounds;iv. recognize the number of syllables and their types in a word;\n\nv. appraise the importance of vowels in determining meaning;\n\nvi. analyse the phonological processes in Hausa.\n\n \n\nTopic\n\n(f) Ƙirar Kalma (Morphology)\n\ni. roots and stems;\n\nii. affixation –e.g. prefix, infix suffix and their derivational and inflectional functions;\n\niii. gender and number inflections;\n\niv. derivation of nouns and adjectives from verbs; adjectives and verbs from nouns.\n\n \n\nObjectives\n\ni. explain the inflectional process in Hausa word formation;\n\nii.explain the derivational process of word formation in Hausa;\n\niii. differentiate between the two morphological processes.\n\n \n\nTopic\n\n(g) Ginin Jumla (Syntax):\n\ni. word classes-e.g. nouns,pronouns, verbs, adverbs, adjectives, prepositions, conjunctions, interjections and ideophones;\n\nii.grammatical categories –e.g. tense and aspect (general and relative past: general and relative continuous, first and second future, habitual); mood (subjunctive and negative); gender (masculine, feminine and neuter) and number (singular and plural)\n\niii.sentence structure –e.g. verbal sentence, nominal phrase + verbal phrase and their components, non-verbal sentence: nominal phrase + stabilizer, nominal phrase+ compliment + stabilizer, nominal phrases + continuous frame (yana../yake...) (+da) + nominal phrase;\n\niv. sentence types –e.g. simple sentences, compound sentences and complex sentences;v.clauses – types (e.g. relative and subjunctive); functions (e.g. main and subordinate).\n\n \n\nObjectives\n\ni. analyse the process governing word combination to form phrases; clauses and sentences in Hausa;\n\nii. detect linguistic errors in the grammar;\n\niii. observe punctuation rules;iv. recognize ideas or thoughts in written form;v. construct meaningful sentences for effective communication;\n\nvi. use the appropriate tenses in spoken and written Hausa;\n\nvii. use the appropriate gender and number in spoken and written Hausa;\n\nviii.differentiate between types of sentence structure;ix. distinguish between nominal and verbal phrase;\n\nx. distinguish between types of sentences;\n\nxi. compare types of clauses.\n\n \n\nTopic\n\n(h) Ma’ana (Semantics)i. lexical aspects of word meaning–e.g.ambiguity, synonym and antonym;\n\nii. figures of speech –aspects of specialized meanings of words and phrases\n\n \n\nObjectives\n\ni. analyse the mechanisms of generating meanings in Hausa;\n\nii.build up their vocabulary;\n\niii. distinguish between the speech sounds of the language to reflect the acceptable grammar;\n\niv. recognize the significance of punctuation rules;\n\nv. recognize the various meanings and functions of sentences in communication;\n\nvi. use words and sentences suitable for a particular purpose;\n\nvii. construct meaningful sentences for effective communication\n\n \n\nTopics\n\n(2) Al’adu (Culture)\n\n(a) Rayuwar Hausawa(Hausa Rite de Passage)\n\ni. haihuwa (birth) –ɗaukar ciki da goyonciki da haihuwa da shayarwa da al’adun makon haihuwa da wankadaɓanti dayaye da kaciya da samartaka;\n\nii. aure (marriage) –ire-irensa da nema da baiko da ɗaurin aure da biki da zaman aure da sakida zawarci;\n\niii. mutuwa (death) –faɗar mutuwa da wanka da salla da jana’iza da zaman makoki da sadaka da takaba da gado\n\niv. tasirin zamani akan rayuwar Hausawa\n\n \n\nObjective\n\nLallai ne waɗanda za su rubuta jarabawa su iya:\n\ni. bayyana al’adun da ke tattare da ɗaukar ciki har zuwa samartaka;\n\nii. bayyana tsarin zamani akan haihuwa;\n\niii. bayyana al’adun neman aure har zuwa zawarci;\n\niv. bayyana tasirin zamani akan aure; v. bayyana hanyoyin faɗar mutuwa zuwa rabon gado;\n\nvi. bayyana tasirinzamani akan mutuwa;\n\nvii. tantance ma’ana da ire-iren tasirinzamani\n\n \n\nTopic\n\n(b) Zamantakewa (Social Institutions)\n\ni. tsarin zaman iyali da zaman gandu da dangantakar kishiyoyi da ‘yan uwantaka da barantaka da agolanci;\n\nii. maƙwabtaka;\n\niii. aikin gandu da na gayya;\n\niv. abota da ƙawance;\n\nv. gaisuwa da karimci;\n\nvi. tasirinzamani a kan zamantakewa.\n\n \n\nObjectives\n\ni. bayyana tsarin dangantaka da ma’amala tsakanin iyali;\n\nii. bayyana mahimmancin zamantakewa tsakanin Hausawa;\n\niii. tantance ire-iren tasirin zamani a kan al’adun zamantakewa.\n\n \n\nTopic\n\n \n\n(c) Sana’o’in Gargajiya (Traditional Occupations)i. ire-irensu –noma da ƙira da jima da kasuwanci da wanzanci da sassaƙa da farauta da dukanci da saƙa da kitso da rini da fawa da fafar ƙorai, da sauransu;\n\nii. yanayinsu –hanyoyin gadon su da kayayyakin yin su da matakan tafiyarda su da muhimmancinsu;\n\niii. kayayyaki ko amfanin da suke samarwa;\n\niv. sarautunsu;\n\nv. sana’o’i masu dangantaka da jinsi–aikatau da ƙwadago; kitso daaski.;\n\nvi. tasirin zamani a kan sana’o’in gargajiya.\n\n \n\nObjectives\n\ni. tantance ɗabi’un masu sana’a;\n\nii. tantance kayayyakin da ake sana’antawa;\n\niii. tantance sana’o’in maza da na mata;\n\niv. zayyana kayayyakin sana’o’in;\n\nv. tantance hanyoyin gadon sana’o’in;\n\nvi. zayyana amfanin kayayyakin sana’a;\n\nvii. bayyana sarautun sana’o’in;\n\nviii. bambanta sana’o’in maza da na mata;\n\nix. bayyana muhimmancin sana’o’in;\n\nx. tantance tasirinzamani akan sana’o’in.\n\n \n\nTopic\n\n(d) Kayayyakin Buƙatun Rayuwa (Material Culture)\n\ni. na buƙatun cikin gida (household) –tufafi da karikitan cikin gida;\n\nii. na sauran buƙatu (others) –gine-gine da girke-girke da sauransu;\n\niii. tasirinzamani a kan kayayyakin buƙatuwa.\n\n \n\nObjectives\n\ni. tantance kayayyakin buƙatun rayuwar Bahaushe;\n\nii. tantance amfanin kayayyakin buƙatun rayuwar Bahaushe;\n\niii. tantance tsarin zamani a kan kayayyakin buƙatu.\n\n \n\nTopic\n\ne) Bukukuwa da Wasanni(Cultural Festivities):\n\ni. na addini (religious) –irin subikin sallada takutaha (sallar gani)da cika-ciki da saukar karatu;\n\nii. na gargajiya (traditional) –irin su kalankuwa da buɗar dawa, da bikin shan kabewa;\n\niii. na sana’a (occupational) –bikin kamun kifi da dambe da kokawa da wasan farauta da wasanmaƙera da hawan ƙaho;\n\niv. na nishaɗi –sukuwa;v. na yara (children’s games) –irin su shalle da kulli-kurciyada a-sha-ruwan-tsuntsaye da gaɗa da carafke;\n\nvi. tasirinzamani kan bukukuwa da wasanni.\n\n \n\nObjectives\n\ni. zayyana ire-iren wasanni da bukukuwan Hausawa;\n\nii. nuna mahimancinsu;\n\niii. nuna yadda za a adana su kar su ɓace;\n\niv. nuna yadda ake gudanar da su;\n\nv. nuna tasirinzamani a kan bukukuwa da wasanni.\n\n \n\nTopic\n\n(f) Camfe-camfe da Bauta (Traditional Beliefsand Worship):\n\ni. camfe-camfe irinsu kangida da camfi, da kambun baka;\n\nii. bauta irin su bori da maita da tsafi;\n\niii. tasirinzamani a kan camfe-camfe da bauta.\n\n \n\nObjectives\n\ni. tantance ire-ire da hanyoyin aiwatar dasu;\n\nii. bayyana amfaninsu;\n\niii. bayyana rashin amfaninsu.\n\niv. bayyana tasirinzamani a kansu.\n\n \n\nTopic\n\n(g) Sarautun Gargajiya (Traditional Authority)\n\ni. ire-irensu –sarki da hakimai da dagatai da masu unguwanni;\n\nii. na bayin sarki –shantali da jakadiya da baraya da sauransu;\n\niii. masu alaƙa da addini; irin su liman da alƙali;\n\niv. ayyukansu.\n\n \n\nObjectives\n\ni.zayyana su ta fuskar ire-iren muƙamai;\n\nii.zayyana hawa-hawan muƙami;\n\niii.tantance aikin kowane mai muƙami;\n\niv.tantance mahimmancin kowane muƙami.\n\n \n\nTopic\n\n(h) Magungunan Gargajiya(Traditional Medicine)\n\ni. ire-irensu na gargajiya:sassaƙe-sassaƙe da sauyoyi da nagari da na ruwa;\n\nii. na addini:layu da rubutuda ɗibbu da duba;\n\nii. hanyar amfani da su –sha da shafawa da surace da turare da shaƙawa da taunawa da tsotsawa da ɗaurawa da liƙawada ratayawa;\n\niii. awo da kimantawa;\n\niv. ayyukansu –riga-kafi da warkarwa;\n\nv. tasirin zamani a kansu\n\n \n\nObjectives\n\ni.karkasa ire-iren magunguna\n\nii. zayyana hanyoyin amfani da su;\n\niii. nuna amfaninsu;v.nuna tasirin zamani a kan su.\n\n \n\nTopic\n\n(3) Adabi (Literature)\n\nI.Adabin Baka (Oral Literature)\n\n(a) Zuben Baka (Narratives):Irin su tatsuniya da almara da hikaya da ƙissa da tarihi.\n\n(b) Maganganun Azanci (Folk –sayings); Irin su take dakirari da habaici da zambo da karin magana da kacici-kacici da salon maganada adon harshe.\n\n \n\nObjectives\n\nLallai ne waɗanda za su rubutajarrabawa su iya:\n\ni.tantance nau ‘o’in zuben baka;\n\nii.amfani da kalmomin da suka dace da kan labari.\n\ni.tantance sigogi da bayyana hanyoyin amfani da su;\n\nii.naƙaltada amfani da kalmomin dasuka dace da maganganun azanci. Topic\n\n(c) Waƙoƙi na baka (Oral songs):\n\ni. ire-irensu –na fada da na jama’a da na maza da na sha’awa da sauransu:\n\nii. jigo da salo da zubi da tsari da mawaƙi da kayan kiɗa da abin da aka waƙe.\n\niii. waƙoƙin aiki: na niƙa da daɓe da na daka da na talla da sauransu;\n\niv. Waƙoƙin yara (maza da mata); na aure da na dandali da sauransu;\n\n \n\nObjectives\n\ni.tantanceire-iren waƙoƙin baka;\n\nii.tantance masu yin ire-iren waƙoƙin;\n\niii.rarrabe sigada jigo da saloda zubi da kayayyakin aiwatar da su\n\n.i.tantancenau’o’in waƙoƙin aiki;\n\nii.tantance masu yin waƙoƙin aiki;\n\niii.bambance sigogin waƙoƙin yara.\n\n \n\nTopics\n\nd) Wasannin Kwaikwayo Na Gargajiya (Traditional Drama):i.Na yara:\n\n- ire-irensulanga da wasan ’yartsana da tashe da wasan gauta da dokin kara da sauransu;\n\n- yadda ake yin su.\n\n- muhimmancinsuii. Na manya:\n\n- ire-irensu‘yan kamada kalankuwa da hoto da wowwo da tashe, da sauransu;\n\n- yadda ake yin su;\n\n- muhimmancinsu\n\n \n\nObjectives\n\n.tantance sigogin wasannin kwaikwayo nagargajiya.\n\nii.tantance hanyoyin gudanar da wasanninkwaikwayo na gargajiya;\n\niii.tantance muhimmancin wasanninkwaikwayo na gargajiya;\n\n \n\nTopic\n\nII.Rubutaccen Adabi (Written Literature)Zube (Prose)\n\ni.Kome Nisan Dare\n\n \n\nObjectives\n\nLallai ne masu ɗaukar jarabawa su iya:\n\ni.tantance sigada tsari da jigo da saloda taurarin cikin littafin zube tare da nazarin su;\n\nii.naƙaltar ƙa’idojin rubutu yayin karanta rubutun zube;\n\niii.naƙaltarma’anonin kalmomi da na jumloli domin fahimtar labari;\n\niv.tantance muhimman saƙonni a cikin labari da yanke hukunci game dalabarin.\n\n \n\n \n\nTopics\n\nWaƙa (Poetry)i. Waƙoƙin Mu’azu Haɗeja\n\n \n\nObjectives\n\ni.fahimtarjigoda saloda sigada zubi wajen nazarin zaɓaɓɓiyar waƙa;\n\nii.yin la’akari da ƙa’idojin rubutu musamman na waƙa;\n\niii.tantance ma’anonin kalmomidana jumloli wajennazarin waƙa;\n\niv.danganta amfani da kalmomi da jumloli da saƙon waƙa;\n\nv.tantance muhimman saƙonni a cikin waƙa da yanke hukunci game da ita\n\n \n\nTopics\n\nWasan Kwaikwayo (Drama)\n\ni.Kulɓa Na Ɓarna\n\n \n\nObjectives\n\ni. tantance yanayin wurin wasa da jigo da saloda ‘yan wasa da sigada tsarin rubutaccen wasan kwaikwayo da akazaɓa don nazari;\n\nii.la’akari da muhimmancin ƙa’idojin rubutu wajen fitar da ma’ana;\n\niii.naƙaltar ma’anarkalmomi domin fahimtar wasa;\n\niv.tantance muhimman saƙonni a cikin wasa da yanke hukunci game da saƙonnin\n\n \n\n \n\nZAƁAƁƁUN LITTATTAFAI (PRESCRIBED TEXTS)\n\nNau’i \n\nZube:           \n\n \n\nMarubuci\n\n(i) Bambale, M.B.\n\n \n\nLittafi \n\nKomeNisan Dare Zaria: NNPC, 2009 WAEC AND NECO\n\n \n\nNau’i \n\nWaƙa:\n\n \n\nMarubuci\n\n(i) Haɗeja, M.\n\n \n\nLittafi \n\nWaƙoƙin Mu’azu HaɗejaZaria: NNPC, 1980 WAEC AND NECO\n\n \n\nNau’i \n\nWasan Kwaikwayo:\n\n \n\nMarubuci\n\n(i) Katsina, U. Ɗ\n\n \n\nLittafi \n\nKulɓa Na Ɓarna Zaria: NNPC, 2011 WAEC AND NECO\n\n \n\nRECOMMENDED TEXTS\n\nGaladanci, M.K.M. (1976),Introduction to Hausa Grammar,Zaria: Longman\n\nJunju, M.H. (1980),Rayayyen Nahawun Hausa, Zaria: NNPC\n\nMuhammad, Y.M. (2005),Fassarar Hausa,Zaria: ABU Press\n\nSani, M.A.Z. (1999),Tsarin Sauti Da Nahawun Hausa, Ibadan: UP Plc\n\nSani, M.A.Z. et al (2000),Exam Focus: Hausa Language, Ibadan:UP Plc\n\nSkinner, N. (1977),Grammar of Hausa,Zaria: NNPC\n\nYahaya, I.Y. et al (1992),Darussan Hausa 1 –3,Ibadan: UP Plc Don manyan makarantun sakandare\n\n \n\nB.ADABI DA AL’ADU (LITERATURE AND CULTURE)\n\n \n\nBichi, A.Y. (1979),Waƙoƙin Bikin Aure,Lagos: Nelson\n\nDangambo, A. (1984),Rabe –Raben Adabin Baka da Muhimmancinsa Ga Rayuwar Hausawa, Kano: T.P.C.\n\nGusau, S.M. (1991),Makaɗa Da Mawaƙan Hausa,Kaduna: Fisbas Media Service\n\nIbrahim, M.S. (1977),Kowa Ya Sha Kiɗa,Zaria: Longman\n\nMadauci, I. et al (1992),Hausa Customs,Zaria: ABU Press\n\nUmar, M.B. (1976),Ɗanmaraya Jos Da Waƙoƙinsa, Ibadan: OUP\n\nUmar, M.B. (1977),Wasannin Tashe,Zaria: NNPC\n\n \n\nC.ƘAMUSAI  (DICTIONARIES)\n\n \n\nBargery G.P. (1951),A Hausa –English Dictionary and English-Hausa Vocabulary London: OUP\n\nNewman, R.M. (1997),An English-Hausa Dictionary, Ibadan: Longman\n\nNewman and Newman (1977),Sabon Ƙamus Na Hausa Zuwa Turanci, Ibadan: UPLS\n\nkinner, N. (1993),Kamus Na Turanci Da Hausa, Zaria: NNPC\n\nCSNL: (2006),Ƙamusun Hausa Na Jami’ar Bayero ta Kano,Kano: CSN"
}