{
  "chapIndex": "",
  "text": "SECTION A: THE NIGERIA AREA UP TO 1800\n \n1. Land and Peoples of the Nigeria Area\n\n \n\nTopics:\n\na. Geographical zones and the people.\nb. The people's relationship with the environment\nc. Relations and integration among the peoples of different zones.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. identify the geographical zones and the people within them;\nii. establish the relationship between the people and the environment\niii. Comprehend the relationships among the various peoples of the Nigeria area.\n\n \n2. Early Centres of Civilization:\n\n \n\nTopics:\n\na. Nok, Daima, Ife, Benin, Igbo Ukwu and Iwo Eleru\nb. Monuments and shelter systems: (Kuyambana, Durbi-ta-Kusheyi, city walls and palaces)\n\n \n\nObjectives: \n\nCandidates should be able to:\ni. examine the significance of various centres;\nii. establish the historical significance of the various monuments such as caves and rocky formations;\n\n \n3. Origin and formation of States in the Nigeria Area\n\n \n\nTopics:\n\na. Central Sudan -Kanuri and Hausa, states.\nb. Niger-Benue Valley - Nupe, Jukun, Igala, Idoma, Tiv and Ebira\nc. Eastern Forest Belt - Igbo and Ibibio\nd. Western Forest Belt - Yoruba and Edo\ne. Coastal and Niger-Delta - Efik, Ijo, Itsekiri and Urhobo\ni. Factors influencing their origin and migration\nii. Social and political organizations\niii. Inter-State relations, religion war and peace.\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. relate the different groups of people occupying the various zones to their traditions of origin;\nii. determine the inter-state relations;\niii. account for their, social and political organizations\n\n \n4. Economic Activities and Growth of States:\n\n \n\nTopics: \n\na. Agriculture - hunting, farming, fishing, animal husbandry and horticulture.\nb. Industries - pottery, salt-making, iron-smelting, blacksmithing, leather-working, wood-carving, cloth-making, dyeing and food processing.\nc. Trade and trade routes:- local, regional, long distance, including trans-Sahara trade?\nd. Expansion of states.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. identify the various economic activities of the people;\nii. differentiate the economic activities and specialties of the people;\niii. relate trade and other economic activities to the growth of the states.\n\n \n5. External Influences:\n\n \n\nTopics: \n\na. North Africans/Arabs\ni. introduction, spread and impact of Islam;\nii. trans-Saharan trade.\n\n\nb. Europeans:\ni. early European trade with the coastal states.\nii. the trans-Atlantic slave trade (origin, organization and impact)\n\n \n\nObjectives: \n\nCandidates should be able to:\ni. assess the impact of the contact with North Africa on the people and states South of the Sahara.\nii. examine the impact of early European contact with the coastal people;\niii. trace the origin, organization and impact of the trans-Atlantic slave trade;\n\n \nSECTION B: THE NIGERIA AREA 1800 - 1900\n\n \n\nTopics:\n\n1. The Sokoto Caliphate, The Sokoto Jihad - (causes, courses and consequence)\na. The causes and the process of the jihad\nb. The establishment and administration of the caliphate and relations with neighbours\nc. The achievements and impact of the caliphate.\nd. The collapse of the caliphate.\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. examine the causes, and the processes of the Jihad;\nii. determine the factors that led to the rise of the caliphate;\niii. examine the administrative set-up of the caliphate and its relations with its neighbours;\niv. examine the impact of the caliphate;\nv. trace the internal and external factors that led to the collapse of the caliphate.\n\n \n2. Kanem-Borno\n\n \n\nTopics:\n\na. The collapse of the Saifawa dynasty\nb. Borno under the Shehus\nc. Borno under Rabeh\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. determine the factors that led to the collapse of the Saifawa dynasty;\nii. examine Borno under the administration of the Shehus;\niii. assess the role of Rabeh in Borno's history.\n\n \n3. Yorubaland:\n\n \n\nTopics:\n\na. The fall of the Old Oyo Empire\nb. The Yoruba wars and their impact\nc. The peace treaty of 1886 and its aftermath\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. examine the causes of the fall of the Old Oyo;\nii. examine the causes and effects of the Yoruba wars:\niii. assess the impact of the 1886 peace treaty.\n\n \n4. Benin\n\n \n\nTopics: \n\na. Internal political development\nb. Relations with neighbours\nc. Relations with the Europeans\n\n \n\nObjectives: \n\n \n\nCandidates should be able to:\ni. examine the internal political development;\nii. examine her relations with her neighbours;\niii. assess her relationship with the Europeans.\n\n \n5. Nupe\n\n \n\nTopic:\n\na. Internal political development\nb. Relations with neighbours.\n\n \n\nObjective:\n\n\ni. examine Nupe internal political development.\nii. assess her relations with her neighbours.\n\n \n6. Igbo\n\n \n\nTopics:\n\na. Internal political development\nb. Relations with neigbhours.\n\n \n\nObjectives:\n\ni. examine Igbo internal political development.\nii. assess her relations with her neighbours.\n\n \n7. Efik\n\n \n\nTopics:\n\na. Internal political development\nb. Relations with neigbhours\n\n \n\nObjectives: \n\ni. examine Efik internal political development.\nii. assess her relations with her neighbours.\n\n \n8. European Penetration and Impact:\n\n \n\nTopics:\n\na. European exploration of the interior.\nb. The suppression of the trans-Atlantic slave trade.\nc. The development of commodity trade and rise of consular authority.\nd. Christian missionary activities.\ne. The activities of the trading companies\nf.  Impact of European activities on the coast and the hinterland. Objectives:\n\nCandidates should be able to:\ni. examine the motive for the exploration of the interior.\nii. give reasons for the suppression of the trans-Atlantic slave trade;\niii. trace the development of commodity trade;\niv. examine missionary and European activities in the area;\niv. asses the activities of the European trading companies\nv. account for the rise of consular authority.\n\n \n9. British Conquest of the Nigeria Area:\n\n \n\nTopics:\n\na. Motives for the conquest\nb. Methods of the conquest and its result.\nc. Resistance to and aftermath of the conquest.\n\n \n\nObjectives: \n\nCandidates should be able to:\ni. determine the reasons for the conquest and the methods used;\nii. examine the various resistance to the conquest\niii. evaluate the results and the aftermath of the conquest\n\n \nSECTION C: NIGERIA 1900 - 1960\n \n1. The Establishment of Colonial Rule up to 1914:\n\n \n\nTopics:\n\na. Administration of the protectorates\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. examine the administrative set-up of the protectorates;\n\n \n2. The Amalgamation of 1914:\n\n \n\nTopics: \n\na. Reasons\nb. Effects\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. examine the reasons for the 1914 Amalgamation\nand its effects.\n\n \n3. Colonial Administration After the Amalgamation:\n\n \n\nTopics:\n\na. Central Administration:- Legislative and Executive Councils\nb. Indirect Rule - reasons, working and effects\nc. Local administrative institutions, Native Authorities, Native Courts and Native Treasuries.\nd. Resistance to colonial rule - Ekumeku Movement in Asaba hinterland 1898 - 1911, the Satiru uprising 1906, Egba and the Anti-tax Agitation 1918, and the Aba Women Movement in 1929.\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. relate the composition of the central administrative set-up to its consequences;\nii. identify the reasons for the introduction and workings of the indirect rule system;\niv. assess the effects of indirect rule;\nv. examine the local administrative units.\niv. account for the anti-colonial movements and their significance\n\n \n4. The Colonial Economy:\n\n \n\nTopics:\n\na. currency, taxation and forced labour\nb. Infrastructure (transportation, post and telecommunication)\nc. Agriculture\nd. Mining\ne. Industry\nf. Commerce\ng. Banking.\n\n \n\nObjectives: \n\nCandidates should be able to:\ni. examine the nature of the economy as it affects taxation. Currency, infrastructures, agriculture, mining, industry, commerce and banking.\n\n \n5. Social Development under Colonial Rule:\n\n \n\nTopics:\n\na. Western education\nb. Urbanization/social integration\nc. Improvement unions\nd. Health institutions\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. identify the areas of social development under colonial rule;\nii. examine the impact of urbanization on the people;\niii. examine the level of social integration among the people.\n\n \n6. Nationalism, Constitutional Developments and Independence:\n\n \n\nTopics:\n\na. The rise of nationalist movements;\nb. The 1922 Clifford Constitution and the rise of Nigeria's first political party.\nc. World War II and the agitation for independence\nd. The Richards Constitution of 1946\ne. The Macpherson Constitution of 1951.\nf. Party politics - regionalism, federalism and minorities agitations.\ng. Lyttleton Constitution of 1954.\nh. constitutional conference in Lagos in 1957 and in London in 1958\ni. The general elections of 1959 and independence in 1960\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. trace the emergence of the nationalist movement;\nii. assess the roles of the different constitutions in constitutional development;\niii. examine the effect of World War II in the agitation for independence and the constitutional developments;\niv trace the development of party politics and its impact on regionalism and minority question ;\nv. examine the impact of the constitutional conferences.\nvi. determine the factors that aided the attainment of independence;\n\n \nSECTION D: NIGERIA SINCE INDEPENDENCE\n \n1. The politics of the First Republic and Military intervention\n\n \n\nTopics:\n\na. Struggle for the control of the centre;\nb. Issue of revenue allocation\nc. Minority question\nd. The 1962/63 census controversies\ne. The Action Group crisis and the General Elections of 1964/65.\nf. The coup d'etat of January 1966 and the Ironsi Regime.\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. give reasons behind the struggle for the control of the centre;\nii. account for the controversies in revenue allocation;\niii. account for the controversies generated by the minority question and the creation of states;\niv. account for the controversies generated by the 1962/63 census;\nv. examine the problems created by the Action Group crisis and the General Elections of 1964/65\nvi. assess the significance of military intervention and the Ironsi Regime.\n\n \n2. The Civil War:\n\n \n\nTopics:\n\nCause and effects\na. Causes\nb. Course\nc. Effects\n\n \n\nObjectives:\n\nCandidates should be able to\ni. examine the remote and immediate causes of the war;\nii. examine the course.\niii. assess the effects of the war;\n\n \n3. The Gowon Regime.\n\n \n\nObjectives:\n\nCandidates should be able to\ni. assess the challenges and achievements of the Gowon Regime.\n\n \n4. Murtala/Obasanjo Regime\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. assess the challenges and achievements of the Murtala/Obasanjo Regime;\n\n \n5. The Second Republic\n\n \n\nObjectives: \n\nCandidates should be able to:\ni. evaluate the challenges and achievements of the Second Republic.\n\n \n6. The Buhari Regime\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. assess the challenges and achievements of the Buhari Regime\n\n \n7. The Babangida Regime\n\n \n\nObjectives: \n\nCandidates should be able to:\ni. assess the challenges and achievements of the Babangida Regime;\n\n \n8. The Interim National Government (ING)\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. examine the role and challenges of the Interim National Government.\n\n \n9. The Abacha Regime\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. assess the challenges and achievements of the Abacha Regime.\nii. assess the challenges and achievements of the Abdulsalami Regime;\n\n \n10. Nigeria in International Organizations; Topics:\n\na. Economic Community of West African States (ECOWAS),\nb. African Union (AU)\nc. Commonwealth of Nations\nd. Organization of Petroleum Exporting Countries (OPEC)\ne. United Nations Organization\nf. The role of Nigeria in Conflict Resolution\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. examine the role of Nigeria in ECOWAS\nii. assess the role of Nigeria in the AU\niii. evaluate the role of Nigeria in the Common Wealth of Nations\niv. assess the role of Nigeria in the OPEC\nv. Examine the role of Nigeria in the UN\nvi. examine the role of Nigeria in conflict resolutions in the Congo, Chad, Liberia, Sierra Leone, Guinea and the Sudan.\n\n \nPART II: AFRICA AND THE WIDER WORLD SINCE 1800\nSECTION A: WEST AND NORTH AFRICA\n \n1. Islamic Reform Movements and State Building in West Africa:\n\n \n\nTopics:\n\na. Relationship between Sokoto and other Jihads.\nb. The Jihads of Seku Ahmadu and Al-Hajj Umar\nc. The activities of Samori Toure\n\nObjectives:\n\nCandidates should be able to:\ni. establish the relationship between the Sokoto Jihad and other Jihads in West Africa:\nii. compare the achievements of the Jihads of Seku Ahmadu and Al-Hajj Umar.\niii. examine the activities of Samori Toure of the Madinka Empire.\n\n \n2. Sierra Leone, Liberia and Christian Missionary Activities in West Africa\n\n \n\nTopics:\n\na. The foundation of Sierra Leone and Liberia and the spread of Christianity\nb. The activities and impact of Christian missionaries.\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. determine the factors that led to the founding of Sierra Leone and Liberia;\nii. examine the importance of Sierra Leone and Liberia in the spread and impact of Christianity in West Africa.\niii. assess the impact of Christian missionary activities in West Africa\n\n \n3. Egypt under Mohammed Ali and Khedive Ismail:\n\n \n\nTopics:\n\na. The rise of Mohammad Ali and his reforms\nb. Mohammad Ali's relations with the Europeans\nc. Ismail's fiscal policies\nd. The British occupation of Egypt\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. determine the factors that aided Mohammad Ali's rise to power and his reforms;\nii. establish the relationship between Mohammad Ali's Empire and the Europeans;\niii. account for the fiscal policies of Ismail;\niv. examine the reasons for the British occupation of Egypt\n\n \n4. The Mahdi and Mahdiyya Movement in the Sudan\n\n \n\nTopics:\n\na. Causes\nb. Course\nc. Consequences\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. examine the causes, the course and consequences of the Mahdiyya Movement in the Sudan\nSECTION B: EASTERN AND SOUTHERN AFRICA\n1. The Omani Empire\n\n \n\nTopics:\n\na. The rise of the Omani Empire\nb. The empire's commercial and political relations with the coast and the hinterland.\nc. The Empire's relations with the Europeans\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. determine the factors that led to the rise of the Omani Empire;\nii. assess the establishment of commercial and political relations between the Omani Empire, the coast and the hinterland.\niii. examine the relationship that existed between the Omani Empire and the Europeans.\n\n \n2. Ethiopia in the 19th century\n\n \n\nTopics:\n\na. The rise of Theodore II and his attempt at the unification of Ethiopia\nb. Menelik II and Ethiopian independence\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. examine the factors that led to the rise of Theodore II as the Emperor of Ethiopia;\nii. analyse the strategies that were adopted to achieve Ethiopian unification.\niii. assess the role of Menelik II in the maintenance of Ethiopian independence\n\n \n3. The Mfecane:\n\n \n\nTopics:\n\na. The rise of the Zulu Nation\nb. Causes, Course and consequences of the Mfecane\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. trace events in Nguniland before the Mfecane;\nii. determine for the factors that led to the rapid rise of Shaka.\niii. examine the causes, course and consequences of the Mfecane\n\n \n4. The Great Trek\n\n \n\nTopics:\n\na. The frontier wars\nb. British intervention in the Boer African relations\nc. The Great Trek and its consequences\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. determine the factors that led to the frontier wars;\nii. account for British intervention in the Boer-African relations;\niii. describe the nature of the Great Trek;\niv. examine its consequences\n\n \nSECTION C: IMPERIALISM, COLONIALISM AND PROBLEMS OF NATION-BUILDING IN AFRICA\n \n1. The New Imperialism and European Occupation of Africa\n\n \n\nTopics:\n\na. The New Imperialism in Africa\nb. European scramble for Africa\nc. The Berlin Conference\nd. The occupation and resistance by Africans\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. assess the causes of the New Imperialism\nii. examine the causes of the scramble;\niii. account for the significance of the Berlin Conference.\niv. examine African resistance to the occupation.\n\n \n2. Patterns of Colonial Rule in Africa:\n\n \n\nTopics:\n\na. The British\nb. The French\nc. The Portuguese\nd. The Belgians\n\n \n\nObjectives: \n\nCandidates should be able to:\ni. examine and compare the patterns of colonial rule by the various European powers.\n\n \n3. The Politics of Decolonization\n\n \n\nTopics:\n\na. Colonial policies and African discontent\nb. The impact of the two world wars\nc. Nationalist activities and the emergence of political parties and associations\nd. Strategies for attaining independence\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. examine the policies employed by the colonial masters and the magnitude of African discontent;\nii. assess the impact of the First and Second World Wars on African nationalism,\niii. determine the strategies used in the attainment of independence.\n\n \n4. Apartheid in South Africa\n\n \n\nTopics:\n\na. The origin of apartheid\nb. Rise of Afrikaner nationalism\nc. Enactment of apartheid laws\nd. Internal reaction and the suppression of African nationalist movements\ne. External reaction to apartheid, the Frontline States, the Commonwealth of Nations, OAU and the UN.\nf. The dismantling of apartheid\ng. Post-apartheid development\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. trace the origin of apartheid in South Africa;\nii. give reasons for the rise of Afrikaner nationalism;\niii. evaluate apartheid laws;\niv. relate the internal reactions to apartheid to the African struggle for majority rule;\nv. relate the contributions of African states and international organizations to the fight against apartheid;\nvi. identify the steps taken towards the dismantling of apartheid in South Africa\nvii. assess the post-apartheid development in South Africa.\n\n \n5. Problems of Nation-building in Africa\n\n \n\nTopics:\n\na. Political and economic challenges and constraints\nb. Physical and environmental challenges\nc. Ethnic and religious pluralism\nd. Military intervention and political instability.\ne. Neo-colonialism and under -development.\nf. Boundary disputes and threat to African unity\ng. Civil wars and the refugee problem.\n\n \n\nObjectives:\n\nCandidates should be able to:\ni. examine the political and economic problems faced by assess the effects of natural disasters on Africa\niii. determine the role of ethnic and religious problems in African;\niv. examine the role of the military in African politics;\nv. examine the role of neo-colonialism in Africa;\nvi. assess the problems of boundary disputes;\nvii. establish the relationship between civil wars and refugee problems in Africa RECOMMENDED TEXTS\n\n \n\nAbba, A (2006): The Politics of Mallam Aminu Kano, Kaduna Vanguard and Publishers.\n\nAyandele, A. E. et al (1986): The Making of Modern Africa, The Twentieth Century Vol 2., Longman.\n\nAjayi and Crowther (1971): History of West Africa Vol. I, London, Longman.\n\nAjayi and Crowther (1974): History of West Africa Vol. II, London, Longman\n\nAkinloye, S. A. (1976): Emergent African States: Topics in Twentieth Century African History, Longman.\n\nAkinyemi, A. B., Agbi, S. O and Otunbanjo, A. O. (eds) (1989): Nigeria since Independence: The First 25 years. (International Relations) Vol x, Heinemann. Ibadan.\n\nAnene J. C. and Brown, G (1966): African in the 19th and 20th centuries, Ibadan: University Press.\n\nAnene J. C. (1966): Southern Nigeria in Transition, 1885 - 1906, Cambridge: University Press.\n\nAnene, J. C and Brown, G (eds) (1972): African in the Nineteenth and Twentieth Centuries: A Handbook for Teachers and Students, Ibadan: University Press and Nelson.\n\nAshiwaju A. I., Croder, M and Denzer, I. R. (eds) Tariki 25, Grassroots Leadership in Colonial West Africa, Vol. 7, London: Longman.\n\nAtanda, J. A. Ashiwaju, G and Abubakar, Y. (eds) (1989) Nigeria since Independence: The First Years: Religion Vol. i., Ibadan Heinemann.\n\nBarkindo, B. et al (1989): Africa and the Wider World, Vol. 1. Lagos: Longman.\n\nBarkindo, B. et al (1996): African and the Wider World, Vols. 2 and 3, Lagos: Longman\n\nBoahen, A (1969) The Revolutionary years: Africa since 1800 Longman publishers.\n\nBoahen, A (1969): The Revolutionary years: West Africa since 1800, Longman Publishers\n\nSokoto Caliphate: History and Legacies, 1804 - 2004, vols. I and II, Kaduna: Arewa House.\n\nCeleman, J. S. (1986) Nigeria: Background to Nationalism, Benin: Broburg and Wistrom.\n\nClerk, T. A. (1991): Right Honourable Gentleman: The Life and Times of Alhaji Sir Abubakar Tafawa Balewa, Zaria: Hudahuda Publishing Company.\n\nCohen, D. I. and Daniel, J. (eds) (1981): Political Economy of Africa: Selected Readings, London, Longman.\n\nCrowther, M. West Africa: An introduction to its History, Longman,1977.\n\nCrowther, M. Nigeria: An introduction to its History, London:Longman,1979.\n\nDike, K. O. (1956): Trade and Politics in the Niger Delta, London: Oxford University Press.\n\nEkeh, P. P and Ashiwaju, G. (eds) (1989): Nigeria since Independence: The First 25 Years: Culture, Vol. VII, Ibadan: Heinemann.\n\nFalola, T. et. al (1989): History of Nigeria Vol. I, Lagos: Longman.\n\nFalola T. et. al (1989): History of Nigeria Vol. 2 and 3, Lagos: Longman.\n\nGboyega, A., Abubakar, Y and Aliyu Y. (eds) (1989): Nigeria since Independence: The First 25 Years Public Administration, Vol. III, Ibadan: Heinemann.\n\nHallet, R. (1975): Africa since 1875, Ibadan: Heinemann.\n\nHopkins, A. G. (1973): An Economic History of West Africa, Longman.\n\nIkime, O and Osoba, S. O. (eds) Tarikh: Independence Movement in Africa (Part I), Vol. 3, No. 4 London: Longman.\n\nIkime, O and Osoba, S. O. (eds) Tarikh: Government in Pre-Colonial Africa, Vol. 4, No. 2 London, Longman\n\nIkime, O and Osoba, S. O. (eds) (undated): Peoples and Kingdoms of West Africa in the Pre-colonial Period, Vol. 5, No. 1 London: Longman.\n\nIkime, O and Osoba, S. O. (eds) (undated) Tarikh: Europeans Conquest and African Resistance (Part 2), Vol. 4, London: Longman.\n\nIkime, O (1977) The Fall of Nigeria: The British Conquest, London: Heinemann.\n\nIkime, O (ed) (1974) Leadership in 19th Century Africa: Essays from Tarikh, London: Longman\n\nIkime, O. (1968) Merchant Price of the Niger Delta, London: Heinemann.\n\nIkime, O. (ed) (1980) Ground work of Nigerian History, Ibadan: Heinemann.\n\nIseihei, E. (1983) A History of Nigeria, London: Longman.\n\nJorre, J. D. (1972) The Nigeria Civil War, London: Hordder and Stoughton.\n\nKani, A. M. and Gandi, K. (1990) A State and Society in the Sokoto Caliphate, Series I, Usman Danfodio University, Sokoto.\n\nMahdi, A., Kwanashei, G. A and Yakubu M. (eds) (1994) Nigeria: The state of the Nation and the Way Forward, Kaduna: Arewa House.\n\nMartin, P. M and Omera, P. (1995) (eds) Africa (Third Edition), Bloomington: Indiana University Press.\n\nMohammed, B. (1982) Africa and Non-alignment: A study in the Foreign Relations of New Nations, Kano: Triumph Publishers.\n\nMohammed A. S. and Adamu, S.(eds) (2005) Nigeria and the Reform of the United Nations, Zaria: Hanwa.\n\nNzula, A. T., Potekhin and Zusmanovich (1979) Forced Labour in Colonial Africa, London: Zed Press.\n\nOffiong, D. A. (1980) Imperialism and Dependency: Obstacles to Development, Enugu: Fourth Dimension Publishers.\n\nOjigbo, O. (1982) Shehu Shagari: The Biography of Nigeria's First Executive President, Yugoslavia Mlandiska Knjiga.\n\nOkafor, I. (1989) History for Senior Secondary Schools, Onitsha, Jet Publishers.\n\nOliver, T. and Afmore, A. (1996) Africa since 1880 (Fourth Edition) New York: Cambridge University Press.\n\nOlusanya G. O. (1973) The Second World War and Politics in Nigeria, 1939 - 1953, Ibadan: Evans.\n\nOmar O. (1966) The Zulu Aftermath: A Nineteenth-Century Revolution in Bantu Africa, London: Longman.\n\nOmolewa, M. (1986) Certificate History of Nigeria, Lagos: Longman.\n\nOnoja, I. (1998) Peace-keeping and International Security in a Changing World., Jos: Mono Expressions.\n\nOnwubiko, K. (1983) School Certificate History of West Africa, Onitsha: African - First Publishers.\n\nTamuno, T. N. and Atanda A. (eds) (1989) Nigeria since Independence: The First 25 Years. Vol. III, Ibadan: Heinemann.\n\nTamuno, T. N. and Atanda J. A. M. (eds) (1989) Nigeria since Independence: The First 25 Years. (Government and Public Policy), Vol. IV, Ibadan: Heinemann.\n\nTamuno, T. N. and Ukpabi, S. C. (eds) (1989) Nigeria since Independence: The First 25 Years (The Civil War years). Vol. IV, Ibadan: Heinemann.\n\nThompson, L. A. (2000) History of South Africa, Yale: Yale University Press.\n\nUsman Y. B. (ed) (1979) Studies in the History of Sokoto Caliphate, New York: Third Press International.\n\nUsman Y. B. (ed) (1981) The Transformation of Katsina, 1400 - 1883, Zaria: Ahmadu Bello University Press.\n\nUsman Y. B. (ed) and Alkali M. N. (1983) Studies in the History of Pre-Colonial Borno, Zaria: NNPC.\n\nUsman Y. B. and Kwanashei, G. A. (eds) Inside Nigeria History 1950-1970: Events: Issues and Sources (Presidential Panel on Nigeria: Since Independence), University of Ibadan.\n\nUsman Y. B. (ed) (1989): Nigeria since Independence: The First 25 Years: The Society Vol.I, Ibadan: Heinemann.\n\nUsman Y. B. (2002) Election Violence in Nigeria: The Terrible Experience, 1952 - 2002, Zaria: Abdullahi Smith Centre for Historical Research.\n\nWebster, J. B. and Ikime, O. (eds) Tarikh: Early African Christianity, Vol. 2. No. 1. London: Longman.\n\nWilmot, P. F. (1980): Apartheid and African Liberation: The Grief and the Hope, Ife: University of Ife Press.\n\nYakubu, A. M., Jumare, I and Saeed, A. G. (eds) (2005) Northern Nigeria: A century of Transformation, 1903 - 2003, Kaduna: Arewa House.\n\nYakubu A. M. (2006) Emirs and Politicians: Reform, Reactions and Recrimination in Northern Nigeria, 1950 - 1966, Kaduna: Baraka Publishers.\n\nWisdomline Pass at Once JAMB."
}