{
  "chapIndex": "",
  "text": "SECTION A: HOME ECONOMICS EDUCATION\n\n1. Home Economics\na. Meaning, scope and importance of Home Economics.\nb. Objectives and ideals of Home Economics.\n\n \n\nCandidates should be able to:\ni. examine the importance of Home Economics to the individual, family and society;\nii. identify the objectives of Home Economics.\niii. determine the scope of Home Economics.\n\n \n\n2. Areas/Careers in Home Economics\na. Home Management - Interior decoration - Credit management - Florist\nb. Foods and Nutrition - Catering - Dietetics - Nutritionist - Public Health Education\nc. Clothing and Textile - Fashion designing\nd. Family and Child development - Early and Childhood education\ne. Teaching\nf. Counseling\ng. Media\nh. Research\n\n \n\nCandidates should be able to:\ni. recommend possible vocations in the different areas of Home Economics.\nii. relate skills required to each vocation;\niii. assess the benefits of each vocation to the individual and society;\niv. identify current vocations in Home Economics;\nv. identify sources of career information\n\n \n\n3. Interrelationship of Home Economics with other subjects:\nBiology, Geography, Chemistry, Physics, Agricultural Science, Fine Arts, Economics, Mathematics etc.\n\n \n\nCandidates should be able to:\ni. compare the different areas of study from which Home Economics derive its knowledge\nii. determine the contributions of these subjects to Home Economics.\n\n \nSECTION B: HOME MANAGEMENT\n\n1. Principles of Home Management\na. Meaning of Home Management\nb. Steps in the management process\nc. Decision-making: meaning and process\nd. Motivation for Home Management e.g. goals, values, standards, needs and wants, likes and dislikes\n\n \n\nCandidates should be able to:\ni. highlight the meaning of Home Management\nii. identify steps involved in the management process;\niii. determine issues for decision-making in the home;\niv. examine the role of motivators in home management.\n\n \n\n \n\n2. Resources\na. Human Resources: definition and types\ni. Time management; definition/ types - types of worktime - factors influencing the use of time - advantages of time management\nii. Energy, definition and reasons for energy management; - work simplification - its purpose - guidelines for work simplification and time saving gadgets;\niii. Skills, creativity, attitudes etc.\nb. Material Resource: definition/types - income and money management - meaning and types of income - principles of money management - household budgeting; steps in making a budget - economic security of the family - bank accounts - traditional savings, building societies and insurance.\n\n \n\nCandidates should be able to:\ni. identify the resources available to the individual and family;\nii. determine the steps involved in household budgeting;\niii. examine ways of family saving;\niv. apply the principle of time management to work simplification in the home;\nv. examine the sources of income available to an individual;\nvi. give reasons for saving family income;\nvii. suggest alternative resources for home management;\nviii. analyse the principles of money management\n\n \n\n \n\n3. Family Living\n\na. Definition and types of family\ni. Advantages and disadvantages of family types\nii. The family life cycle\nb. Family relationships - husband/wife relationship, parent/child relationship, brother/sister or sibling relationships - factors that influence family relationship\nc. Basic personality profiles - meaning of personality - extroversion, introversion and anxiety/ stability\nd. Adolescents and their problems\ne. Family crises\nf. Conflict and conflict resolution\ng. Human right\ni. Meaning of human rights and fundamental human rights\nii. Right of women and children\niii. Violation of human right\nh. Communication and role of ICT in the Family\n\n \n\nCandidates should be able to:\ni. compare types of family;\nii. assess the effect of family life cycle on family living;\niii. differentiate between the types of relationships that exist in the family;\niv. determine the factors that influence family relationships;\nv. assess the influence of family size on family relationships;\nvi. identify characteristics and problems of adolescents.\nvii. compare the basic personality profiles (extrovert, introvert);\nviii. identify types of family crises and ways of solving them;\nix. identify sources of conflict and solution strategies;\nx. identify types of human right and human rights violation;\nxi. suggest remedies for breach of human rights;\nxii. identify factors that hinder communication in the family;\nxiii. determine factors that enhance communication in the family;\nxiv. identify the advantages and disadvantages of ICT.\n\n \n\n4. Marriage/Sex Education\nMeanings of marriage and sex education\na. Boy/Girl relationship - courtship - factors to consider when choosing a partner\nb. Preparation for marriage - meaning and purpose of engagement - types of marriage; Islamic, Christian, Court and Traditional - planning a family.\nc. Reproductive health - sexually transmitted infections/ diseases (STIs/STDs and HIV/AIDS)\n\n \n\nCandidates should be able to:\ni. differentiate between types of marriages in Nigeria;\nii. compare the advantages and disadvantages of inter-tribal marriages;\niii. analyse the role of courtship and engagement in marriages;\niv. examine the different ways of planning a family;\nv. identify types, causes and prevention of sexually transmitted infections and diseases\n\n \n\n5. Pregnancy and childbirth\na. Menstruation, pregnancy and childbirth, labour delivery and post-natal care\nb. Childcare, baby’s layette care of the baby, bathing, feeding etc.\nc. Care of toddlers - common ailments in children - immunization\nd. child development - stages, social and emotional - good habits and character training - play and play materials\ne. Parenting - meaning and importance - responsibilities of parents\n\n \n\nCandidates should be able to:\ni. describe the process from conception to birth;\nii. determine the care an infant needs from birth to 5 years;\niii. determine the factors that affect pregnancy;\niv. analyse complications that arise during labour;\nv. differentiate between the stages of labour;\nvi. identify the symptoms of common ailments in children;\nvii. differentiate between the types of play materials\nviii. trace the stages of development in children;\nix. recommend suitable play materials for children;\nx. identify responsibilities of parenting 6. Housing the family\na. Houses and home - types of houses - factors that affect the choice of a house - ways of acquiring a house\n\nb. Interior decoration - wall finishing and the application of principles of art and design to - colours - textures - lines and - proportions - flower arrangements\n\nc. Furniture and furnishings in the home - types - factors that affect choices and position.\n\nd. Utilities in the Home i. Water – source, uses, purification etc. ii. Household fuels e.g gas, coal, kerosene, fire wood and sawdust iii. Electricity – related terms, generation, safety etc. iv. Communication devices e.g. GSM, computer\n\n \n\nCandidates should be able to:\ni. differentiate between a house and a home;\nii. determine the factors that influence residential choice;\niii. identify items that beautify living areas;\niv. suggest suitable colours, textures and other related factors that should be considered in interior decoration;\nv. determine factors that influence choice and arrangement of furniture;\nvi. compare different floral arrangements;\nvii. identify utilities in the home;\nviii. appraise the advantages and disadvantages of these utilities in relation to their alternatives\n\n \n\n \n\n7. Home surfaces\na. Types and care of surface and coverings e.g. wood, tiles, formica, concrete plastics, linoleums, mats, rugs and terrazzo\nb. Identification, preparation and use of cleaning agents such as water, soap, abrasives and polish - Care of home surfaces and coverings e.g. washing, sweeping, dusting, shampooing, buffing and polishing.\n\n \n\nCandidates should be able to:\ni. identify common surfaces in the homes\nii. suggest cleaning agents and their uses in the home;\niii. identify materials needed for preparing local cleaning agents;\niv. compare the care of the following: - wood - plastic - concrete - rugs - mats - linoleum\n\n \n\n8. Sanitation in the Home\na. Drainage systems – types and care\nb. Disposal of household refuse\nc. Household pests and control\nd. Pollution and health hazards\n\n \n\nCandidates should be able to:\ni. differentiate between the types of liquid household refuse;\nii. suggest ways of disposing household refuse;\niii. identify common household pests and their control\niv. identify some diseases transmitted by pests;\nv. examine sources of pollution;\nvi. determine the health hazards of pollution\n\n \n\n9. Consumer Education\na. Meaning and importance of consumer education\nb. Definition and types of market\nc. Distributors or consumer agents\nd. Sources of consumer information\ne. Purchasing practices\nf. Advertising\ng. Consumer rights and responsibilities\nh. Government agencies and regulatory bodies\n\n \n\nCandidates should be able to:\ni. identify the types of media used by advertisers;\nii. assess its advantages and disadvantages;\niii. determine sources of consumer, advice and information;\niv. apply the principles of consumer education to wise shopping;\nv. analyse the rights and responsibilities of the consumer;\nvi. identify government agencies, regulatory bodies and their functions.\n\n \n\n \nSECTION C: FOODS & NUTRITION\n \n\n1. Foods and Nutrition\na. Definition of food and nutrition\ni. Classification of nutrients, their source and function, deficiency diseases\nii. Classification of foods, cereals, fats and oils, sugars, milk and milk products, meat, fish pulses, nuts, fruits and vegetables.\nb. Nutrition and health\ni. Relation of nutrition and health\nii. Factors affecting good nutrition e.g. income, food in season, availability of food etc.\nc. The digestive system\nd. Nutrition for special groups e.g. infants, toddlers, adolescents, manual workers, etc.\n\n \n\n \n\nCandidates should be able to :\ni. differentiate between the following terms: food nutrients, carbohydrates, mineral elements, fatty acids, enzymes, metabolism and digestion;\nii. analyse the process which break down large food molecules;\niii. recommend the nutritional need for special groups;\niv. determine the reasons for the nutritional needs of the following: - expectant/ lactating mothers - sedentary /manual workers - children between 5 and 8 years - adolescents.\nv. identify factors affecting good nutrition\n\n \n\n2. Meal planning\na. Principles of meal planning\nb. dietary needs and meals for special occasions and groups\nc. preparation and serving of meals\nd. snacks and beverages - meaning, types and functions\ne. Table setting, table manners and hostessing\n\n \n\nCandidates should be able to:\ni. identify factors that influence the choice and preparation of food for the family;\nii. plan meals for special occasions e.g. weddings, birthdays, anniversaries, etc;\niii. plan meals for special groups e.g. vegetarians, invalids convalescence, HIV/AIDS, etc.\niv. identify types of snacks/beverages and their functions\nv. compare types of table setting;\nvi. determine the qualities of a good hostess.\n\n \n\n \n\n3. Cookers and cooking\na. Types, choice and care of cookers e.g. gas, electric, microwave, etc\nb. Reasons for cooking\nc. Cooking terms\nd. Methods of cooking e.g. boiling, stewing, baking, steaming etc - moist and dry methods of cooking\ne. Methods of heat transfer e.g. conduction, convection and radiation.\n\n \n\nCandidates should be able to:\ni. suggest reasons for cooking food;\nii. identify types of cookers, their choice and care.\niii. group the methods of cooking into the following: - Moist methods - Dry methods - Fast methods - Slow methods\niv. determine the method of heat transfer in the various methods of cooking\n\n \n\n \n\n4. Flours and uses\na. Types and uses of flours\nb. Raising agent e.g air, yeast, palm wine, steam, etc.\n\n \n\nCandidates should be able to:\ni. identify types of flours and their uses;\nii. select appropriate raising agents for basic mixtures;\niii. use flour to produce assorted food items; 5. Basic mixtures - Pastries/Batters - Definition/uses\n\n \n\nCandidates should be able to:\ni. differentiate between batters and pastries;\nii. use batters and pastries for different purposes\n\n \n\n6. Scientific methods in foods and nutrition\na. measure units and accuracy\nb. various nutrients tests in food e.g test for protein, fats and carbohydrates\nc. recipe development\n\n \n\nCandidates should be able to:\ni. develop basic recipes in food preparation\nii. demonstrate skills in unit measurements;\niii. detect the nutrient in a given food\n\n \n\n7. The Kitchen: - types of kitchen; - arrangement - tools and equipment - selection, use and care\n\n \n\nCandidates should be able to:\ni. compare large and small kitchen equipment and tools;\nii. determine factors to consider in selecting tools and equipment.\n\n \n\n8. Safety and hygiene\na. Common accidents in the home - causes of accidents in the home/ preventive measures.\nb. First Aid; definition/components of a first aid kit - simple first aid for burns, scalds, cuts bruises, bleeding, electric shock, poisoning, chocking and bites.\nc. Kitchen, personal and food hygiene - Communicable and noncommunicable disease.\nd. Sense organs and care - Exercise and cosmetics\n\n \n\nCandidates should be able to:\ni. identify common accidents in the home, their causes and preventive measures;\nii. suggest ways of making the home a safe place to live in;\niii. specify items which should be included in a first aid kit\niv. suggest simple first aid for scalds, cuts, bleeding, burns etc.\nv. detect ways in which food is contaminated;\nvi. compare communicable and noncommunicable diseases and their preventive measures;\nvii. determine the effect of exercise and cosmetics on the skin;\nviii. describe the structure of the sensory organs;\nix. suggest ways of taking care of the sensory organs.\n\n \n\n \n\n9. Food Storage and Preservation\na. Meaning and purpose of preservation - causes of food spoilage - principles of food preservation - methods of food preservation.\nb. Convenience foods - definition and types - guidelines for selection - additives to convenience foods.\nc. Food additives - Types and uses\nd. Rechauffe dishes - meaning, rules and types - advantages and disadvantages of rechauffe dishes\n\n \n\nCandidates should be able to:\ni. identify agents of food spoilage;\nii. analyse the principles involved in the preservation and storage of foods;\niii. compare the advantages and disadvantages of food preservation;\niv. identify convenience foods;\nv. compare the advantages and disadvantages of using convenience foods\nvi. determine guidelines for selecting convenience foods;\nvii. identify additives used in foods;\nviii. compare the advantages and disadvantages of rechauffe dishes\n\n \n\n10. Home Gardening\na. definition\nb. common gardening tools\nc. advantages of home gardening\nd. types of soil\ne. plants and crops suitable for home garden\nf. preparation and care of home garden\n\n \n\nCandidates should be able to:\ni. determine the procedure involved in home gardening;\nii. identify gardening tools;\niii. assess the economic importance of home gardening;\n\n \nSECTION D: CLOTHING & TEXTILE\n\n1. Fibres and Fabrics\na. origin of fibres - definition of textile terms, eg fibres, fabrics, yarn, staple, filament, blends, etc.\nb. locally made fabric e.g. aso-oke, Okene cloth, Benue cloth, akwete, gwado etc.\nc. classification and properties of fibres e.g cotton, rayon and silk\nd. fabric finishes: moth-proofing, embossing, durable pleating, flameproofing and stain-repellant print e.g tie and dye, screen printing etc.\ne. Textile labelling - meaning and types - recognition of washing, cleaning and ironing symbols, wool symbols\n\n \n\nCandidates should be able to;\ni. differentiate between weaves using diagrams;\nii. determine the characteristics of fabrics;\niii. identify reasons for giving finishing to fabrics;\niv. compare types of labels found on clothing;\nv. state the uses and importance of locally made fabric;\nvi. assess the importance of label on garments\n\n \n\n2. Sewing equipment and garment construction\na. Sewing machine, basic tools and equipment - types, parts, use and its care\nb. Basic process in garment construction e.g basic stitches, seams edge finishes, crossway strips.\nc. Style features e.g collars, yokes, pockets, frills, cuts and belts.\nd. Arrangement of fullness e.g darts, tuck gathering, pleats, smocking and shirring.\ne. Decorative design, decorative stitches, needlecraft e.g tarting, crocheting, knitting, appliqué patch work and soft toys.\nf. Simple processes and mend garments e.g patching, darning and renovation, batik/tie and dye\ng. Garment construction - figure types, basic body measurement and pattern drafting - choice of styles for different figures - factors influencing the choice of fabric.\nh. Wardrobe planning and maintenance - basic rules in wardrobe planning - factors affecting wardrobe planning, weather, occupation, personal features.\ni. good grooming, dress sense and accessories - definition\n\n \n\nCandidates should be able to:\ni. identify the types and parts of a sewing machine;\nii. identify basic tools and equipment used in garment construction;\niii. describe various process in garment constructions;\niv. apply basic process in garment construction;\nv. determine style features on garments;\nvi. determine style features to enhance the beauty and quality of garments;\nvii. apply decorative designs on fabrics;\nviii. differentiate between types of household clothing using various designs;\nix. apply the knowledge of sewing to mend and renovate garments;\nx. compare the process of making batik/tie and dye;\nxi. relate body figures to the selection of styles and fabrics;\nxii. determine factors which affect the choice of clothing;\nxiii. identify factors to consider in wardrobe planning;\nxiv. compare the following terms: - good grooming - dress sense - accessories - colour harmony\n\n \n\n3. Laundry and care of clothes\na. Washing and finishing process, sorting, mending, removal of stains, soaking, rinsing, drying and ironing\nb. Laundry agents – water, detergents, soaps, stiffness and disinfectants\nc. Stain i. meaning, types, removing agents ii. process of removal\nd. Iron and ironing temperatures\n\n \n\nCandidates should be able to:\ni. arrange in correct order the processes involved in the washing and finishing of clothing;\nii. compare the role of stiffeners and disinfectants in laundry work;\niii. suggest ways of removing common stains;\niv. differentiate between the following: - laundry agents - stains - ironing temperatures. RECOMMENDED TEXTS\n\n \n\nAnfani-Joe, M.E. and Ogunjide, L.O. (1993) Home Management for Senior Secondary School 1 – 3, Ibadan: University Press Plc.\nAnyakoha, E.U. and Eluwa, M. (1990) Home Management for Schools and Colleges, Onitsha: Africana FIRST Publishers.\nAnyakoha, E.U (2006) Home Economics for Junior Secondary Schools Books 1 – 3, Onitsha Africana FIRST Publishers.\nNeil, A and Hesmondhalgh, Z. (1985) A Complete Revision Course for O’Level and GCE, Revised Home Economics, Charles Co. Ltd.\nOgunjide, L.O., Egbuchulam, B., Eyisi, O. Anfani-Joe, M.E and Olusanya, J.O. (1993) Clothing and Textiles for Senior Secondary Schools 1 – 3, Ibadan: University Press Plc.\nOlusanya, J.O., Eyis, O., Anfani-Joe, M.E., Ogunjide, L.O. and Egbuchulam, B. (1990) Foods and Nutrition for Secondary Schools Books 1 – 3, Ibadan: University Press Plc.\nOlusanya, J. O., Olojala, S. O., Bala, F and Eyisi, O. (2000) Exam Focus, Food and Nutrition for WASSCE and SSCE, Ibadan: University Press Plc."
}