{
  "chapIndex": "",
  "text": "TOPICS/CONTENTS/NOTES\n\nSECTION A: LAGUAGES (ASỤSỤ)\n\n1. Essay (Edemede)\n \n\n(a) Basic principles of essay writing: introduction, body and conclusion\n(b) Basic essay types and their characteristics\n(i) Narrative (Akọmakọ)\n(ii) Descriptive and Expository (Nkọwa na Nkọwami)\n(iii) Argumentative (Mgbagha/Arụmarụụka)\n(iv) Speech making (Ekwumekwu)\n(v) Letter Writing (Edemleta)\n(vi) Dialogue (Mkparịtaụka)\n\n \nOBJECTIVES\n\nCandidates should be able to:\n(i) identify the basic principles of essay writing;\n(ii) use words and expressions appropriate to a particular topic;\n(iii) differentiate between different essay types;\n(iv) describe the characteristics of essay types;\n(v) compare different types of essay;\n(vi) criticize other people’s essays.\n\n \n\n2. Comprehension (Aghọtaazaa)\n\nOne passage of about one hundred and fifty (150) words.\n\n \nOBJECTIVES\n\nCandidates should be able to:\n(i) explain the meanings of difficult words;\n(ii) give correct answers;\n(iii) differentiate between figurative and idiomatic expressions from the passage;\n(iv) deduce conclusion based on the passage\n\n \n\n3. Sounds and Sound Patterns (Ụdaasụsụ na Usoro Ụdaasụsụ)\n(a) Vowels and Consonants (Ụdaume na mgbochiume)\n(b) Sound Patterns/Processes\ni. Syllabic nasals (myiri ụdaume)\nii. Syllable structure (nkeji mkpụrụokwu)\niii. Vowel harmony (ndakọrịta ụdaume);\niv. Vowel assimilation (olilo ụdaume);\nv. Vowel elision and consonant elision (ndapụ ụdaume na ndapụ mgbochiume)\n(c) Tone and tone marking (Akara ụdaolu)\n\n \nOBJECTIVES\n\nCandidates should be able to:\n(i) identify vowels, consonants and syllabic nasals;\n(ii) distinguish between the speech sounds of the Igbo language;\n(iii) recognize syllabic nasals ‘m’ & ‘n’;\n(iv) determine the syllabic structure of any word;\n(v) identify the vowel groups in Igbo;\n(vi) describe vowel assimilation and vowel and consonant elision;\n(vii) assign tone marks appropriately\n\n \n\n4. Spelling and spelling rules (Nsupe na Iwu Nsupe)\n\n5. Igbo Orthography (Mkpụrụedemede Igbo) \n\nCandidates should be able to:\n(i) detect words written correctly in Igbo;\n(ii) observe consonant restrictions in Igbo;\n(iii) determine appropriate word division in Igbo;\n(iv) apply correct spellings in writing\n\n \n\n6. Dialect and Standard Igbo (Olundị/Olumba na Igbo Izugbe)\nOBJECTIVES\n\nCandidates should be able to:\n(i) differentiate between standard Igbo and dialects;\n(ii) use standard Igbo in their writings.\n\n \n\n7. Vocabulary (Mkpụrụokwu dị n’asụsụ)\nExpansion through word derivation processes, coinages, loans and loansblends (Ịmụbawanye mkpụrụokwu site n’usoro mmepụta, mkpụpụta, mbite na mbiọgwa).\n\n \nOBJECTIVES\n\nCandidates should be able to:\n(i) differentiate between loan and coined words;\n(ii) identify loan words and loan-blends in Igbo;\n(iii) use words appropriately.\n\n \n\n8. Grammar (Ụtọasụsụ)\n(a) Parts of speech (Nkejiasụsụ): Nominals (Mkpọaha), verbs (ngwaa), adjectives (nkọwa), adverbs (nkwuwa), affixes (mgbakwunye), enclitics (nsokwunya),dgz.\n(b) The structure, types and functions of the morpheme (Ndokọ, ụdị na ọrụ mọfịm) Free & bound (nnọọrọonwe na ndabe)\n(i) the word (mkpụrụokwu)\n(ii) the phrase (nkebiokwu)\n(iii) the clause (nkebiahịrị) nominal, relative adverbial (kemkpọaha na kenkwuwa)\n(iv) the sentence (ahịrịokwu) simple (mfe), compound (ukwu), complex (mgbagwọ, dgz\n \nOBJECTIVES\n\nCandidates should be able to:\n(i) differentiate between grammatical categories;\n(ii) identify parts of speech and their functions;\n(iii) differentiate between types of affixes and their functions;\n(iv) determine types of morphemes and their functions;\n(v) identify words, phrases, clauses, sentences and their functions.\n\n \n\n9. Translation (Ntụgharị)\n\n \nOBJECTIVES\n\nCandidates should be able to:\n(i) translate English into Igbo and vice versa;\n(ii) communicate effectively in Igbo and English\n\n \n\n \nSECTION B: LITERATURE (AGỤMAGỤ)\n \n\n1. Literary devices (Atụmatụokwu na atụmatụ agụmagụ) dịka alliteration (bịambia mgbochiume), assonance (bịambịa ụdaume), parallelism (kwunkwugha), metaphor (mbụrụ), simile (myiri), hyperbole (egbeokwu), personification (mmemmadụ) and proverbs (ilu), dgz.\n\n \n\nCandidates should be able to:\n(i) identify all literary devices in the passages;\n(ii) interpret literary devices;\n(iii) differentiate between types of literary devices;\n(iv) use Igbo literary devices appropriately\n\n \n\n2. Oral Literature: Agụmagụ Ọnụ/ Agụmagụ Ọdịnala Questions will be set on the following: folktales (ifo), anecdotes (ụkabụilu), myths (nkọmịrịkọ), legends (nkọkịrịkọ), poems (abụ), songs (uri), chants (mbem), riddles (agwụgwa), oral drama (ejije ọnụ), tongue-twister (okwuntụhị) dgz.\n\n Candidates should be able to:\n(i) create folk stories, anecdotes, chants, riddles, oral drama etc.\n(ii) analyse various genres of oral literature;\n(iii) present ideas/formulae in accordance with underlying principles;\n(iv) apply the lessons of oral literature to their everyday life.\n\n \n\n3. Written Literature (Agụmagụ Ederede) (a) Prose (iduuazị) (i) Ude Ọdịlọra (1981) Ọkpa Akụ Eri Eri. Onitsha: University Press. (NECO/WAEC) (2016- 2020).\n\nCandidates should be able to:\n(i) interpret the text;\n(ii) isolate the characters in the book;\n(iii) compare figurative and idiomatic expressions in the text;\n(iv) analyse the text;\n(v) identify the author, publisher and date of the book;\n(vi) draw moral lessons from the text.\n\n(b) Poetry (Abụ) (i) Ikeokwu E.S & Onyejekwe M.C. (2009) Uche Bụ Ahịa. Enugu: Format Publishers Nig. LTD. (WAEC/NECO 2016- 2020).\n\n \n\nCandidates should be able to:\n(i) compare the types and themes of the poems;\n(ii) relate the poets’ idea to the contents of the poems;\n(iii) compare figurative and idiomatic expressions in the texts/poems;\n(iv) analyse the structures of the poems;\n(v) apply acquired knowledge and moral lessons from the poems to their daily lives.\n\n \n\nABỤ NDỊ A HỌPỤTARA (Selected Poems)\n1 Ụwa Ndọlị Ndọlị - 1\n2. Ọchịchị - 14\n3. Ọnwụ 1 – 16\n4. Chi-Ukwu – 20\n5. Ire 1 - 22\n6. Ozi Ọma - 28\n7. Mmụta - 30\n8. Ezi Nwaanyị - 36\n9. Anyanwụ – 40\n10. Akụ – 44 \n11. Akaraka - 49\n12. Ọnwa – 69\n13. Akwụkwọ – 71\n14. Nwanne - 89\n\n \n\n(c) DRAMA (EJIJE)\ni. Nwaozuzu G.I. (2005). Nke M Ji ka. Enugu: CIDJAP Press. (WAEC/NECO 2016- 2020).\n\n \n\nCandidates should be able to:\n(i) identify types of drama;\n(ii) determine the themes of the text;\n(iii) identify the story lines;\n(iv) find out the characters in the stories;\n(v) appreciate the language of the play;\n(vi) appraise the social problems raised by the author in the play;\n(vii) apply acquired knowledge to their personal lives.\n\n \n\nSECTION C: CUSTOMS AND INSTITUTIONS (Omenala na Ewumewu)\n\nIgbo customs and institutions as categorized below:\n\n1. Ekele dị icheiche: ekele ụtụtụ, ehihie, anyasị, nri, nlakpu, ọrụ dgz.\n2. Alụmdi na nwunye, ịgba alụkwaghịm.\n3. Ọmụmụ na ile ọmụgwọ, ikupụta nwa, ibi ugwu, ịgụ aha.\n4. Echichi: Ọzọ, Eze/Obi/Igwe/Iyom.\n5. Ike ekpe, ịkwa ozu, ịgba mkpe.\n6. Ụmụnna, ụmụọkpụ/ụmụada.\n7. Ọgbọ/ebiri/uke, ọhanaeze, ezinaụlọ\n8. Arụ na nsọala: Ihe nsọ - anụ, osisi, ebe, igbu ọchụ.\n9. Ọchịchị Ọdịnala: Igwe/Eze, Nze na Ọzọ, Ụmụnna, Ezinaụlọ dgz.\n10. Nnabata ọbịa, ọji na ịtu nzu, itu aha, dgz.\n11. Ịgba afa, ịchụ aja, ịgọ mmụọ, ofufe.\n12. Nkwenye: ịdụ isi/ịṅụ iyi, ịgba ndụ, orikọ, dgz\n13. Akụnaụba: inwe ala, ike ala, ekpe, elulu (ịkpa ọkụkọ, ewu, dgz).\n14. Ikikere mmụọ: ọfọ, ogu, ọtọnsi, okpesi,ikenga.\n15. Egwuregwu: mgba, egwu ọnwa, ikpọ ụga, ịzụ ǹchò, ịzụ okwe, dgz.\n16. Akaọrụ ndị Igbo: Ọrụ ugbo, ịkụ azụ, ịkpụ ụzụ, ịzụ ahịa, ịtụ ihe ọtụtụ, dgz.\n\n \n\nCandidates should be able to:\n(i) describe the customs of their people;\n(ii) determine the rules and regulations guiding specified aspects of the culture and tradition of the Igbo people;\n(iii) describe the importance of the aspects of Igbo culture;\n(iv) identify changes that have occurred as a result of civilization;\n(v) explore their environment for a better appreciation of their culture\n\n \nSECTION D: General and Current Affairs (Ihe Ndị na-eme Ugbua)\n \n\n1. Topical issues on the Igbo language, literature and culture e.g. Ahịajiọkụ and Odenigbo lectures.\n2. Ọhanaeze Ndị Igbo\n3. Authors, Publishers, dates and places of publication of works in Igbo.\n4. Igbo Studies Association (ISA)\n\n \n\nCandidates should be able to:\n(i) identify some dates and themes of Ahịajiọkụ and Odenigbo lectures;\n(ii) identify authors and dates of publication of various textbooks in Igbo;\n(iii) identify some publishing companies;\n(iv) analyse some functions of Ọhanaeze ndị Igbo;\n(v) acquaint themselves with the functions and contributions of the Igbo Studies Association (ISA).\n\n \n\nCURRENT ISSUES (Okwuakpụnọnụ)\nNote: Item writers should also choose their topics for comprehension exercises from such current issues as the following: HIV/AIDS (Mmịnwụ/Obirinaajaọcha) Drug Abuse (Ịṅu Ọgwụ Agharaaghara) Cultism (Otu Nzuzo) Rights of Women and Children (Oruuru Ụmụnwaanyị na Ụmụaka) Human Rights Violation (Ịnapụ Mmadụ Ikike) Religious Conflicts (Nsogbu Ndọkụrịta Ekpemekpe Ụka)\n\n \n\nCandidates should be able to:\n(i) acquaint themselves with current issues;\n(ii) examine their effects;\n(iii) suggest remedies to the problems\nRECOMMENDED TEXTS\n\n1. Emenanjo, E. N., Okolie, F. O. and Ekwe, B. U. (1995) Igbo maka Sinịọ Sekọndịrị Sukul I.\n2. Emenanjo, E. N., Dike, O. N., Agomo S. N and Ezeuko, R. O. (1999) Exam Focus maka WASSCE na UME, Ibadan: University Press Plc.\n3. Ezikeojiaku, P. A. Okebalama, C. N. Onweluzo, C. N and Ekwe B. U. (1991) Ule Igbo maka Sinịọ Sekọndịrị, Ibadan: University Press Plc.\n4. Ikekeonwu, C., Ezikeojiaku, P. A., Ubani, A. and Ugoji, J. (1999) Fonọlọji na Grama Igbo, Ibadan: University Press Plc\n5. Nzeakọ, J. U. T. (1972): Omenala Ndị Igbo, Ibadan: Longman.\n6. Okoye, O. F. S., Ofoegbu, N. F. and Ezidiegwu, B. L. (1997) Ọgbara Ọhụrụ Ụtọasụsụ Igbo maka Sinịọ Sekọndịrị, Onitsha: Houston Publishers Ltd.\n7. Osuagwu, B. I. N. (1979): Ndị Igbo na Omenala Ha, Nigeria: Macmillan.\n8. Ubesie, T. U. (1978): Ọdịnala Ndị Igbo, Ibadan: Oxford University Press.\n9. Umeh, I. O. A; Onyekaonwu, G. O. Nwadike, I. U. and Okeke I. O. (1992): Ụtọasụsụ na Agụmagụ Igbo nke Sinịọ Sekọndịrị Sukul, Ibadan: Evans.\n10. Ụba – Mgbemena, A. (2006): Ntọala Usoroasụsụ Igbo, Ibadan: Gold Press Ltd.\n11. Anọzie, C. C. (2003), Igbo Kwenu: Akụkọ na Omenala ndị Igbo Enugu: Computer Edge Publishers.\n12. Ọfọmata, C. E. (2005): Ndezu Ụtọasụsụ Igbo. Enugu: Format Publishers (Nig) Ltd.\n13. Ofili, D. N., Anozie C.C. and Chukwu, A.O. (2012): Lingwistiiki Sayensị Asụsụ II. Enugu: Computer Edge Publishers."
}