{
  "text": "<html>\r\n    <head>\r\n    <style>\r\n        .unselectable {\r\n          -webkit-user-select: none;\r\n          -webkit-touch-callout: none;\r\n          -moz-user-select: none;\r\n          -ms-user-select: none;\r\n          user-select: none;\r\n        }\r\n      <\/style>\r\n      <\/head>\r\n\r\n<body class=\"unselectable\">\r\n \r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">WILLIAM SHAKESPEARE&#39;S TEMPEST<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:0pt; text-align:center; border-bottom:0.75pt solid #000000; padding-bottom:1pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman'; display:none;\">Top of Form<\/span><strong><span style=\"font-family:'Times New Roman';\">By William Shakespeare<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">About<\/span><\/strong><strong><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/strong><strong><span style=\"font-family:'Times New Roman';\">the Tempest<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Records indicate that<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">The Tempest<\/span><\/em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">was performed before James I on November 1, 1611, but there may also have been earlier performances.<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">The Tempest<\/span><\/em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">was again performed during the winter of 1612-13 to celebrate the marriage of Princess Elizabeth, the daughter of King James I. But this play was not printed until it appeared for the first time in the 1623 Folio.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">It is relatively easy to date<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">The Tempest<\/span><\/em><span style=\"font-family:'Times New Roman';\">&#39;s composition, since Shakespeare used material that was not available until late 1610: letters from the new Virginia colony in Jamestown and an account of a 1609 shipwreck off Bermuda. Unlike many of Shakespeare&#39;s other plays,<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">The Tempest<\/span><\/em><span style=\"font-family:'Times New Roman';\">, is not drawn from another, earlier literary work. There is no formal source, except for the ideas that the author might have found in reading accounts of the Bermuda shipwreck or the stories emerging from the new colonies, which had been recently established in the New World.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Character List<\/span><\/strong><\/p>\r\n<h2 style=\"margin-top:0pt; margin-bottom:0pt; page-break-inside:avoid; page-break-after:avoid; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Prospero<\/span><\/h2>\r\n<p style=\"margin-top:0pt; margin-bottom:0pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">The rightful Duke of Milan, though his kingdom and title were usurped by his brother Antonio. Prospero was able to survive a plot on his life, and he and his daughter Miranda were set aboard a wrecked craft, but managed to land safely on the island. Prospero is able to gain control of the spirits of the island, and uses his vast knowledge and control over the spirits to direct acts of magic as he pleases. He is ruler of the island, after taking control of it from its rightful heir, Caliban, and he makes sure that Alonso&#39;s ship wrecks on the island, so he can get his revenge on his brothers for their wrongdoing.<\/span><\/p>\r\n<h2 style=\"margin-top:0pt; margin-bottom:0pt; page-break-inside:avoid; page-break-after:avoid; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Alonso, King of Naples<\/span><\/h2>\r\n<p style=\"margin-top:0pt; margin-bottom:0pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Was involved in a plot to overthrow Prospero, and gave Prospero&#39;s dukedom to Antonio. Has a son, Ferdinand, who is also heir to the kingdom. Alonso may have been corrupt in his dealings with his brothers, but he does not prove to be an evil-natured man; he is a flawed politician, but is a highly regarded king and is not a villain.<\/span><\/p>\r\n<h2 style=\"margin-top:0pt; margin-bottom:0pt; page-break-inside:avoid; page-break-after:avoid; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Sebastian<\/span><\/h2>\r\n<p style=\"margin-top:0pt; margin-bottom:0pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Brother to Alonso, Sebastian is easily infected by a plot for the crown made by Antonio, and impressed upon him by the magic of the spirit Ariel. He is also not evil, but has a flawed nature.<\/span><\/p>\r\n<h2 style=\"margin-top:0pt; margin-bottom:0pt; page-break-inside:avoid; page-break-after:avoid; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Antonio<\/span><\/h2>\r\n<p style=\"margin-top:0pt; margin-bottom:0pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Usurped the dukedom of Milan from his brother Prospero, while Prospero was absorbed in study. Antonio is probably the least scrupulous character in the play, and he is the originator of another plot to take the throne from Alonso through more murders&lsaquo;though this plot is engineered by Prospero, and made possible by Ariel&#39;s magical powers. He is typically sarcastic and remote, and unrepentant of his crimes.<\/span><\/p>\r\n<h2 style=\"margin-top:0pt; margin-bottom:0pt; page-break-inside:avoid; page-break-after:avoid; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Miranda<\/span><\/h2>\r\n<p style=\"margin-top:0pt; margin-bottom:0pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Prospero&#39;s only daughter, and so young that she cannot remember anyone she knew before she came to the island. She is intelligent and headstrong, having learned a lot from her father; but, when under Ariel&#39;s enchantment, she follows her father&#39;s plan, and falls in love with Ferdinand willingly. She and Ferdinand end up together, bound by their mutual infatuation.<\/span><\/p>\r\n<h2 style=\"margin-top:0pt; margin-bottom:0pt; page-break-inside:avoid; page-break-after:avoid; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Ferdinand<\/span><\/h2>\r\n<p style=\"margin-top:0pt; margin-bottom:0pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Alonso&#39;s son, and heir to the kingdom of Naples. Prospero arranges, through his magic, for Ferdinand to fall in love with Prospero&#39;s daughter, Miranda; Prospero&#39;s plot to have Miranda and Ferdinand married is his key to reclaiming his power in Italy. For the brief span of the play, Ferdinand is completely lovelorn and presumed dead by his father because they are separated during the shipwreck; out of his infatuation with Miranda, he agrees to become Prospero&#39;s servant for a span. Prospero finally declares him worthy, and the engagement is at last approved by both Prospero and Alonso.<\/span><\/p>\r\n<h2 style=\"margin-top:0pt; margin-bottom:0pt; page-break-inside:avoid; page-break-after:avoid; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Ariel<\/span><\/h2>\r\n<p style=\"margin-top:0pt; margin-bottom:0pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A spirit of the island, over whom Prospero becomes master after ousting Sycorax. He is the source of Prospero&#39;s magical powers, causing the tempest and many of the conspiracies in the play, and works for Prospero somewhat against his will. He is an intelligent, capable servant, and is finally freed by Prospero for his devoted service.<\/span><\/p>\r\n<h2 style=\"margin-top:0pt; margin-bottom:0pt; page-break-inside:avoid; page-break-after:avoid; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Gonzalo<\/span><\/h2>\r\n<p style=\"margin-top:0pt; margin-bottom:0pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">The councilor to the king, and an honest man as well; he is the one who helps Prospero and Miranda survive Antonio&#39;s plot to have them murdered. Gonzalo is optimistic, good-tempered, and loyal; he is one of the unquestionably good characters in the play, with no apparent dark side in him.<\/span><\/p>\r\n<h2 style=\"margin-top:0pt; margin-bottom:0pt; page-break-inside:avoid; page-break-after:avoid; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Adrian and Francisco<\/span><\/h2>\r\n<p style=\"margin-top:0pt; margin-bottom:0pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Noblemen, and companions of Alonso who are shipwrecked with the rest. Adrian tries his best to console Alonso when Alonso believes that his son is dead; and Francisco also tries to be helpful to the king. Neither play a very important role within the play, but they do appear to be good-tempered men, and Adrian at least is taunted by the very sarcastic pair of Antonio and Sebastian.<\/span><\/p>\r\n<h2 style=\"margin-top:0pt; margin-bottom:0pt; page-break-inside:avoid; page-break-after:avoid; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Caliban<\/span><\/h2>\r\n<p style=\"margin-top:0pt; margin-bottom:0pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A native of the island on which Prospero lands, and the one from whom Prospero steals control of the island. He becomes Prospero&#39;s only subject, doing all of his dirty work; Caliban tries to rape Miranda, and is shunned by both Miranda and Prospero because of this. All who encounter Caliban regard him as sub-human, or reprehensible, because of his different looks and strange ways. However, Caliban has a capacity for poetry and understanding beauty, as shown by a speech in Act III, which is one of the most poetic, beautiful, and descriptive of the play. Gonzalo is the only one within the play who even tries to evaluate Caliban and his kind fairly; the others, blinded by prejudice, mistreat him to various extents.<\/span><\/p>\r\n<h2 style=\"margin-top:0pt; margin-bottom:0pt; page-break-inside:avoid; page-break-after:avoid; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Trinculo<\/span><\/h2>\r\n<p style=\"margin-top:0pt; margin-bottom:0pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A consistently drunken jester, who is a servant of Alonso&#39;s, and brought ashore in the shipwreck. He is a dull fool mostly, not capable of any real action, and providing a good deal of comic relief. When Caliban meets him, he immediately dislikes him and his inebriated insults; but, Trinculo does become a part of Caliban&#39;s plan to murder Prospero and take over the island, though Trinculo proves completely ineffective in this.<\/span><\/p>\r\n<h2 style=\"margin-top:0pt; margin-bottom:0pt; page-break-inside:avoid; page-break-after:avoid; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Stephano<\/span><\/h2>\r\n<p style=\"margin-top:0pt; margin-bottom:0pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Trinculo&#39;s friend, a consistently drunken butler. He is jolly, inebriated, and somehow Caliban takes him on as a new master, thinking that he has some magical powers. He agrees to Caliban&#39;s plot to make him ruler of the island, and gain him the favors of Miranda. However, like Trinculo, he is not cunning, and is completely incapable of carrying out the plan.<\/span><\/p>\r\n<h2 style=\"margin-top:0pt; margin-bottom:0pt; page-break-inside:avoid; page-break-after:avoid; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Master of a Ship, Mariners<\/span><\/h2>\r\n<p style=\"margin-top:0pt; margin-bottom:0pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Appear only in Act 1, scene 1. The master tries to hearten the sailors, and get them to sail the boat through the storm; but, one of Ariel&#39;s spells makes them lose heart and abandon ship. They are whisked safely away, and will take the party back to Italy at the play&#39;s end.<\/span><\/p>\r\n<h2 style=\"margin-top:0pt; margin-bottom:0pt; page-break-inside:avoid; page-break-after:avoid; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Boatswain<\/span><\/h2>\r\n<p style=\"margin-top:0pt; margin-bottom:0pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Right hand to the ship master, in control of the workings of the ship. Antonio and Sebastian try their best to pick a fight with him in the first act, and basically keep him from doing his job. The boatswain reappears in the last act, and tells about what happened to the ship&#39;s crew after the tempest.<\/span><\/p>\r\n<h2 style=\"margin-top:0pt; margin-bottom:0pt; page-break-inside:avoid; page-break-after:avoid; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Iris, Ceres, Juno, Nymphs, Reapers<\/span><\/h2>\r\n<p style=\"margin-top:0pt; margin-bottom:0pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Figures that appear in Prospero&#39;s betrothal masque for Miranda and Ferdinand in Act IV. Iris, Ceres, and Juno are goddesses from Roman myth; Iris is goddess of the rainbow, Ceres presides over agriculture, and Juno is queen of the gods. The parts are all performed by spirits, with Ariel performing the part of Ceres.<\/span><\/p>\r\n<h4 style=\"margin-top:1.8pt; margin-bottom:1.8pt; text-align:center; page-break-inside:avoid; page-break-after:avoid;\"><em><span style=\"font-family:'Times New Roman'; font-weight:normal;\">&nbsp;<\/span><\/em><\/h4>\r\n<h2 style=\"margin-top:2pt; margin-bottom:0pt; page-break-inside:avoid; page-break-after:avoid; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/h2>\r\n<h2 style=\"margin-top:2pt; margin-bottom:0pt; page-break-inside:avoid; page-break-after:avoid; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">Summary<\/span><\/h2>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><em><span style=\"font-family:'Times New Roman';\">The Tempest<\/span><\/em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">opens in the midst of a storm, as a ship containing the king of Naples and his party struggles to stay afloat. On land, Prospero and his daughter, Miranda, watch the storm envelop the ship. Prospero has created the storm with magic, and he explains that his enemies are on board the ship.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">The story Prospero relates is that he is the rightful Duke of Milan and that his younger brother, Antonio, betrayed him, seizing his title and property. Twelve years earlier, Prospero and Miranda were put out to sea in little more than a raft. Miraculously, they both survived and arrived safely on this island, where Prospero learned to control the magic that he now uses to manipulate everyone on the island. Upon his arrival, Prospero rescued a sprite, Ariel, who had been imprisoned by the witch Sycorax. Ariel wishes to be free and his freedom has been promised within two days. The last inhabitant of the island is the child of Sycorax and the devil: Caliban, whom Prospero has enslaved. Caliban is a natural man, uncivilized and wishing only to have his island returned to him to that he can live alone in peace.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">Soon the royal party from the ship is cast ashore and separated into three groups. The king&#39;s son, Ferdinand, is brought to Prospero, where he sees Miranda, and the two fall instantly in love. Meanwhile, Alonso, the king of Naples, and the rest of his party have come ashore on another part of the island. Alonso fears that Ferdinand is dead and grieves for the loss of his son. Antonio, Prospero&#39;s younger brother, has also been washed ashore with the king&#39;s younger brother, Sebastian. Antonio easily convinces Sebastian that Sebastian should murder his brother and seize the throne for himself. This plot to murder Alonso is similar to Antonio&#39;s plot against his own brother, Prospero, 12 years earlier.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">Another part of the royal party &mdash; the court jester and the butler &mdash; has also come ashore. Trinculo and Stefano each stumble upon Caliban, and each immediately sees a way to make money by exhibiting Caliban as a monster recovered from this uninhabited island. Stefano has come ashore in a wine cask, and soon Caliban, Trinculo, and Stefano are drunk. While drinking, Caliban hatches a plot to murder Prospero and enrolls his two new acquaintances as accomplices. Ariel is listening, however, and reports the plot to Prospero.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">Meanwhile, Prospero has kept Ferdinand busy and has forbidden Miranda to speak to him, but the two still find time to meet and declare their love, which is actually what Prospero has planned. Next, Prospero stages a masque to celebrate the young couple&#39;s betrothal, with goddesses and nymphs entertaining the couple with singing and dancing.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">While Ferdinand and Miranda have been celebrating their love, Alonso and the rest of the royal party have been searching for the king&#39;s son. Exhausted from the search and with the king despairing of ever seeing his son alive, Prospero has ghosts and an imaginary banquet brought before the king&#39;s party. A god-like voice accuses Antonio, Alonso, and Sebastian of their sins, and the banquet vanishes. The men are all frightened, and Alonso, Antonio, and Sebastian run away.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">Prospero punishes Caliban, Trinculo, and Stefano with a run through a briar patch and swim in a scummy pond. Having accomplished wh<\/span><span style=\"font-family:'Times New Roman';\">at he set out to do, Prospero has the king&#39;s party brought in. Prospero is clothed as the rightful Duke of Milan, and when the spell has been removed, Alonso rejects all claims to Prospero&#39;s dukedom and apologizes for his mistakes. Within moments, Prospero reunites the king with his son, Ferdinand. Alonso is especially pleased to learn of Miranda&#39;s existence and that Ferdinand will marry her.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">Prospero then turns to his brother, Antonio, who offers no regrets or apology for his perfidy. Nevertheless, Prospero promises not to punish Antonio as a traitor. When Caliban is brought in, Caliban tells Prospero that he has learned his lesson. His two co-conspirators, Trinculo and Stefano, will be punished by the king. Soon, the entire party retires to Prospero&#39;s cell to celebrate and await their departure home. Only Prospero is left on stage.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">In a final speech, Prospero tells the audience that only with their applause will he be able to leave the island with the rest of the party. Prospero leaves the stage to the audience&#39;s applause.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><strong><em><span style=\"font-family:'Times New Roman';\">The Tempest<\/span><\/em><\/strong><strong><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/strong><strong><span style=\"font-family:'Times New Roman';\">as a Romance<\/span><\/strong><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><em><span style=\"font-family:'Times New Roman';\">The Tempest<\/span><\/em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">is a difficult play to categorize. Although it ends in a wedding and thus might be defined as a comedy, there are many serious undertones that diminish the comedic tone. Instead, most modern anthologies of Shakespeare&#39;s works list this play as a romance. This separate division of romances includes what are generally labeled as &quot;the problem plays.&quot; Along with<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">The Tempest<\/span><\/em><span style=\"font-family:'Times New Roman';\">, the romances include<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">Pericles<\/span><\/em><span style=\"font-family:'Times New Roman';\">,<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">Cymbeline<\/span><\/em><span style=\"font-family:'Times New Roman';\">,<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">The Winter&#39;s Tale<\/span><\/em><span style=\"font-family:'Times New Roman';\">, and<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">The Two Noble Kinsmen<\/span><\/em><span style=\"font-family:'Times New Roman';\">, plays of Shakespeare&#39;s later years. These plays were written between 1604 and 1614, just prior to his retirement, when Shakespeare was composing plays that combined romance with some of the darker aspects of life. The romances are plays with the potential for tragedy but in which these tragic elements are resolved.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">With<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">The Tempest<\/span><\/em><span style=\"font-family:'Times New Roman';\">, Shakespeare turns to fantasy and magic as a way to explore romantic love, sibling hatred, and the love of a father for his child. In addition,<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">The Tempest<\/span><\/em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">examines many of the topics that Shakespeare had focused on in his earlier plays, topics such as the attempts to overthrow a king (<\/span><em><span style=\"font-family:'Times New Roman';\">Macbeth<\/span><\/em><span style=\"font-family:'Times New Roman';\">,<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">Richard II<\/span><\/em><span style=\"font-family:'Times New Roman';\">, and<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">Julius Caesar<\/span><\/em><span style=\"font-family:'Times New Roman';\">), nature versus nurture (<\/span><em><span style=\"font-family:'Times New Roman';\">The Winter&#39;s Tale<\/span><\/em><em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/em><span style=\"font-family:'Times New Roman';\">and<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">King Lear<\/span><\/em><span style=\"font-family:'Times New Roman';\">), and innocence (<\/span><em><span style=\"font-family:'Times New Roman';\">Twelfth Night<\/span><\/em><span style=\"font-family:'Times New Roman';\">).<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">Although<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">The Tempest<\/span><\/em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">provides the first masque within a play, the idea of a play within a play had occurred in earlier works, such as<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">Hamlet<\/span><\/em><em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/em><span style=\"font-family:'Times New Roman';\">and<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">Much Ado About Nothing<\/span><\/em><span style=\"font-family:'Times New Roman';\">. In many ways<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">The Tempest<\/span><\/em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">serves as a culmination of Shakespeare&#39;s earlier work, since in this play, he brings many of these earlier ideas together in one work.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><strong><span style=\"font-family:'Times New Roman';\">Historical and Cultural Context<\/span><\/strong><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">By the beginning of the seventeenth century, the threat of the Black Death (the plague) was diminishing, but it still continued to be a seasonal problem in London, which was overcrowded and suffered from poor sanitation and too much poverty.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">A hundred years earlier, Henry VII had formed alliances with neighboring countries and trade was flourishing in London. But the coming of trade changed the face of England. Instead of a country composed largely of an agrarian culture, England, and especially London, became an important center of trade. There was more wealth, and the newly rich could now afford to escape the congestion of the city. There was a need for large country estates, and so more and more farm land was enclosed.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">Displaced rural families fled to the larger cities, where crowding, unemployment, and disease increased with the increase in population. As city life flourished, there was a resulting nostalgia for the loss of country life. In response to this sentimentality, England&#39;s poets began to compose poetry recalling the tranquility of rustic life.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">Early in the seventeenth century, the masque that comprises much of the fourth act of<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">The Tempest<\/span><\/em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">was becoming a regular form of court entertainment. Masques were elaborate spectacles, designed to appeal to the audience&#39;s senses and glorify the monarch. Furthermore, their sheer richness suggested the magnificence of the king&#39;s court; thus they served a political purpose as well as entertained.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">It is important to remember that the masque fulfilled another important function, the desire to recapture the past. As is the case with most masques, Prospero&#39;s masque is focused on pastoral motifs, with reapers and nymphs celebrating the fecundity of the land.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">The masques, with their pastoral themes, also responded to this yearning for a time now ended. The country life, with its abundance of harvests and peaceful existence, is an idealized world that ignores the realities of an agrarian life, with its many hardships. The harshness of winter and the loss of crops and animals are forgotten in the longing for the past.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">Elaborate scenery, music, and costumes were essential elements of earlier masques, but during the Jacobean period, the masque became more ornate and much more expensive to stage. Eventually the cost became so great &mdash; and the tax burden on the poor so significant &mdash; that the masques became an important contributing cause for the English Revolution, and ultimately, the execution of Charles I.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><strong><span style=\"font-family:'Times New Roman';\">Structure of<\/span><\/strong><strong><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/strong><strong><em><span style=\"font-family:'Times New Roman';\">The Tempest<\/span><\/em><\/strong><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">There is really very little plot in<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">The Tempest<\/span><\/em><span style=\"font-family:'Times New Roman';\">. There is the love story, and then there is the story of two younger brothers who covet their older brothers&#39; titles and possessions. And finally, there is the story of Caliban&#39;s plot to murder Prospero. But none of these plots are given much attention or substance; instead, the play is about the complexities of human nature and about reminding the audience that the division between happiness and tragedy is always fragile and must be carefully maintained.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">Although<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">The Tempest<\/span><\/em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">ends with the promise of a wedding, it could just as easily have ended with tragedy. In this play, there are two murder plots and a betrayal to resolve. In a tragedy, these might have ended with the stage awash in blood, as in<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">Hamlet<\/span><\/em><span style=\"font-family:'Times New Roman';\">, but in<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">The Tempest<\/span><\/em><span style=\"font-family:'Times New Roman';\">, Prospero&#39;s careful manipulation of all the characters and their plans also controls the direction of the action. Prospero&#39;s avoidance of tragedy reveals his character&#39;s decency and contradicts some critics&#39; arguments that he is an amoral demigod exploiting the natural inhabitants of this island.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><em><span style=\"font-family:'Times New Roman';\">The Tempest<\/span><\/em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">is unique in its adherence to the three unities. In his<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">Poetics<\/span><\/em><span style=\"font-family:'Times New Roman';\">, Aristotle argued that<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">unity of action<\/span><\/em><em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/em><span style=\"font-family:'Times New Roman';\">was essential for dramatic structure. This meant that a dramatic work should have a clear beginning, middle, and end. The<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">unity of time<\/span><\/em><em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/em><span style=\"font-family:'Times New Roman';\">is derived from Aristotle&#39;s argument that all the action should occur within one revolution of the sun &mdash; one day. The<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">unity of place<\/span><\/em><em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/em><span style=\"font-family:'Times New Roman';\">developed later and is a Renaissance idea, which held that the location of the play should be limited to one place. These unities added verisimilitude to the work and made it easier for the audience to believe the events unfolding on stage.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">Shakespeare rarely used the three unities, but he uses them in this play, something he has only done in one other play,<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">The<\/span><\/em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">Comedy of Errors<\/span><\/em><span style=\"font-family:'Times New Roman';\">. All the events occur on the island and within one brief three-hour period. Shakespeare needed the three unities, especially that of time, to counter the incredulity of the magic and to add coherence to the plot.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><em><span style=\"font-family:'Times New Roman';\">The Tempest<\/span><\/em><span style=\"font-family:'Times New Roman';\">, although it is one of Shakespeare&#39;s shortest plays, still maintains the integrity of the five-act structure. In fact, most Elizabethan theatre adheres to the five-act structure, which corresponds to divisions in the action. The first act is the Exposition, in which the playwright sets forth the problem and introduces the main characters. In<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">The Tempest<\/span><\/em><span style=\"font-family:'Times New Roman';\">, the first act establishes the nature of Antonio&#39;s betrayal of Prospero, and it explains how Prospero and Miranda came to live on the island. This first act also opens with a violent storm, which establishes the extent of Prospero&#39;s power. Most of the play&#39;s remaining characters also make an appearance in this act.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">The second act is the Complication, in which the entanglement or conflict is developed. In<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">The Tempest<\/span><\/em><span style=\"font-family:'Times New Roman';\">, the conspiracy to murder Alonso is developed, which establishes that Antonio is still an unsavory character. In addition, the audience learns more about Caliban, and Stefano and Trinculo appear, allowing the groundwork for a second conspiracy to be formed.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">The third act is the Climax; and as the name suggests, this is when the action takes a turning point and the crisis occurs. In a romance, this is the point at which the young lovers assert their love, although there may be complications. It is important that the way to love not be too easy, and so in<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">The Tempest<\/span><\/em><span style=\"font-family:'Times New Roman';\">, Prospero has forbidden contact between Miranda and Ferdinand, although the audience knows this is only a pretense. In this act, the conspiracy to murder Prospero is developed, although the audience knows that Ariel is listening, and so there is no real danger. And finally, the essential climactic moment occurs in this act when Prospero confronts his enemies at the ghostly banquet.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">The fourth act is called the Falling Action, which signals the beginning of the play&#39;s resolution. In this act, the romance between Ferdinand and Miranda is acknowledged and celebrated with a masque, and Prospero deals with the conspiracy to murder him by punishing Caliban, Stefano, and Trinculo.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">The fifth act is called the Catastrophe, wherein the conclusion occurs. As the name suggests, this act brings closure to the play, a resolution to the conflict, and the plans for a wedding. As the play draws to a close, Prospero is victorious over his enemies, Ferdinand is reunited with his father, Antonio and Sebastian are vanquished, and Caliban regrets his plotting.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><strong><span style=\"font-family:'Times New Roman';\">Literary Devices in<\/span><\/strong><strong><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/strong><strong><em><span style=\"font-family:'Times New Roman';\">The Tempest<\/span><\/em><\/strong><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">Students of Shakespeare&#39;s plays quickly come to appreciate the literary devices that the playwright employs in constructing his plays. For example, most Shakespearean plays contain<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">soliloquies,<\/span><\/em><em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/em><span style=\"font-family:'Times New Roman';\">which offer a way for the playwright to divulge a character&#39;s inner thoughts. The soliloquy requires that the character must think that he is alone on stage, as he reveals to the audience what he is really thinking. In<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">The Tempest<\/span><\/em><span style=\"font-family:'Times New Roman';\">, the soliloquy is not used as often as it would be in a tragedy, because the dramatic moments are not as intense. However, Prospero still uses this device, most notably in Act V, when he tells the audience what he has accomplished with the help of magic and that soon he will no longer have need for such devices.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">A soliloquy is different from a<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">monologue<\/span><\/em><span style=\"font-family:'Times New Roman';\">, in which a character speaks aloud his thoughts, but with other characters present. Shakespeare also frequently employs the<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">aside<\/span><\/em><span style=\"font-family:'Times New Roman';\">, in which the character addresses the audience, but other characters do not hear these words. There is a suggestion of conspiracy in the aside, which allows the audience to learn details that most of the characters on stage do not know. For example, Miranda uses an aside in Act I, Scene 2, when she confides to the audience her concern for her father. The aside is usually assumed to be truthful.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><strong><span style=\"font-family:'Times New Roman';\">Shakespeare&#39;s Language<\/span><\/strong><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">Shakespeare&#39;s Elizabethan language can sometimes intimidate his audience. Shakespeare wrote most of<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">The Tempest<\/span><\/em><em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/em><span style=\"font-family:'Times New Roman';\">in verse, using iambic pentameter.<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">Iambic pentameter<\/span><\/em><em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/em><span style=\"font-family:'Times New Roman';\">is a literary term that defines the play&#39;s meter and the stresses placed on each syllable. In iambic pentameter, each complete line contains ten syllables, with each pair of syllables containing both an accented syllable and an unaccented syllable. Many Renaissance poets used iambic pentameter because the alternating stresses create a rhythm that contributes to the beauty of the play&#39;s language.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">Shakespeare also included prose passages in his plays, with prose lines being spoken by characters of lower social rank. Shakespeare uses this device to reveal the complexity of Caliban. In<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">The Tempest<\/span><\/em><span style=\"font-family:'Times New Roman';\">, Caliban speaks prose when he is conspiring with Stefano and Trinculo, but when Caliban speaks of the beauty of the island, he speaks in verse.<\/span><\/p>\r\n<p style=\"margin-top:14pt; margin-bottom:14pt; font-size:12pt; background-color:#ffffff;\"><span style=\"font-family:'Times New Roman';\">Shakespeare&#39;s Elizabethan language can be difficult to understand at first. Use of a Shakespearean glossary and the<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">Oxford English Dictionary<\/span><\/em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">are two sources that can help in understanding the language, but the biggest assist comes with practice. Reading and listening to Shakespeare&#39;s words becomes easier with practice. Reading aloud also helps in becoming familiar with early modern English. With time, the unfamiliar language and the rhetorical devices that Shakespeare employed in writing his texts cease to be strange, and the language assumes the beauty that is hidden within it.<\/span><\/p>\r\n<h2 style=\"margin-top:2pt; margin-bottom:3pt; page-break-inside:avoid; page-break-after:avoid; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Plot<\/span><\/h2>\r\n<p style=\"margin-top:0pt; margin-bottom:12pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A ship is caught in a powerful storm, there is terror and confusion on board, and the vessel is shipwrecked. But the storm is a magical creation carried out by the spirit Ariel, and caused by the magic of Prospero, who was the Duke of Milan, before his dukedom was usurped and taken from him by his brother Antonio (aided by Alonso, the King of Naples). That was twelve years ago, when he and his young daughter, Miranda, were set adrift on the sea, and eventually stranded on an island. Among those on board the shipwreck are Antonio and Alonso. Also, on the ship are Alonso&#39;s brother (Sebastian), son (Ferdinand), and &quot;trusted counsellor&quot;, Gonzalo. Prospero plots to reverse what was done to him twelve years ago, and regain his office. Using magic he separates the shipwreck survivors into groups on the island:<\/span><\/p>\r\n<ul style=\"margin:0pt; padding-left:0pt;\" type=\"square\">\r\n    <li style=\"margin-left:12.58pt; margin-bottom:3pt; padding-left:8.42pt; font-family:serif; font-size:10pt;\"><em><span style=\"font-family:'Times New Roman'; font-size:12pt;\">Ferdinand, who is found by Prospero and Miranda. It is part of Prospero&#39;s plan to encourage a romantic relationship between Ferdinand and Miranda; and they do fall in love.<\/span><\/em><\/li>\r\n    <li style=\"margin-left:12.58pt; margin-bottom:3pt; padding-left:8.42pt; font-family:serif; font-size:10pt;\"><em><span style=\"font-family:'Times New Roman'; font-size:12pt;\">Trinculo, the king&#39;s jester, and Stephano, the king&#39;s drunken butler; who are found by Caliban, a monstrous figure who had been living on the island before Prospero arrived, and whom Prospero adopted, raised and enslaved. These three will raise an unsuccessful coup against Prospero, acting as the play&#39;s &#39;comic relief&#39; by doing so.<\/span><\/em><\/li>\r\n    <li style=\"margin-left:12.58pt; margin-bottom:3pt; padding-left:8.42pt; font-family:serif; font-size:10pt;\"><em><span style=\"font-family:'Times New Roman'; font-size:12pt;\">Alonso, Sebastian, Antonio, Gonzalo, and two attendant lords (Adrian and Francisco). Antonio and Sebastian conspire to kill Alonso and Gonzalo so Sebastian can become King; at Prospero&#39;s command Ariel thwarts this conspiracy. Later in the play, Ariel, in the guise of a Harpy, confronts the three nobles (Antonio, Alonso and Sebastian), causing them to flee in guilt for their crimes against Prospero and each other.<\/span><\/em><\/li>\r\n    <li style=\"margin-left:12.58pt; margin-bottom:3pt; padding-left:8.42pt; font-family:serif; font-size:10pt;\"><em><span style=\"font-family:'Times New Roman'; font-size:12pt;\">The ship&#39;s captain and boatswain who, along with the other sailors, are asleep until the final act.<\/span><\/em><\/li>\r\n<\/ul>\r\n<p style=\"margin-top:0pt; margin-bottom:12pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Prospero betroths Miranda to marry Ferdinand, and instructs Ariel to bring some other spirits and produce a masque. The masque will feature classical goddesses, Juno, Ceres, and Iris, and will bless and celebrate the betrothal. The masque will also instruct the young couple on marriage, and on the value of chastity until then.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:12pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">The masque is suddenly interrupted when Prospero realizes he had forgotten the plot against his life. He orders Ariel to deal with this. Caliban, Trinculo, and Stephano are chased off into the swamps by goblins in the shape of hounds. Prospero vows that once he achieves his goals, he will set Ariel free, and abandon his magic, saying:<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-left:36pt; margin-bottom:3pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">I&rsquo;ll break my staff,<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-left:36pt; margin-bottom:3pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">Bury it certain fathoms in the earth,<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-left:36pt; margin-bottom:3pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">And deeper than did ever plummet sound<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-left:36pt; margin-bottom:3pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">I&rsquo;ll drown my book.[1]<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:12pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Ariel brings on Alonso, Antonio and Sebastian. Prospero forgives all three, and raises the threat to Antonio and Sebastian that he could blackmail them, though he won&#39;t. Prospero&#39;s former title, Duke of Milan, is restored. Ariel fetches the sailors from the ship; then Caliban, Trinculo, and Stephano. Caliban, seemingly filled with regret, promises to be good. Stephano and Trinculo are ridiculed and sent away in shame by Prospero. Before the reunited group (all the noble characters plus Miranda and Prospero) leaves the island, Ariel is told to provide good weather to guide the king&#39;s ship back to the royal fleet and then to Naples, where Ferdinand and Miranda will be married. After this, Ariel is set free. In the epilogue, Prospero requests that the audience set him free&mdash;with their applause.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">UNN PUTME QUESTION<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Questions 10 and 11 are based on William Shakespeare&#39;s Tempest<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">1. In the play, a character that wasn&#39;t seen is___.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. Sycorax B. Prospero C. Arid D. Caliban<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(Sycorax)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">2. Ariel&#39;s three evil men are____.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. Caliban, Trinculo and Staphano B. Alonso, Sebastian and Antonio<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">C. Trinculo, Sebastian and Gonzalo D. Prospero, Ferdinand and Caliban<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(Alonso, Sebastian and Antonio)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Questions 12 to 13 is based on William Shakespeare&#39;s Hamlet.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">3. The call made on Hamlet to avenge his father&#39;s death makes him____.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. purposeful B. impoverished C. confused D. amused<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(Purposeful)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">4. The principal function of play-within- the-play in Hamlet is to___.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. amuse Claudius B. confirm the claim of the ghost<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">C. divert attention from the main event D. create some comic relief in the tragedy<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(confirm the claim of the ghost)<\/span><\/em><\/p>\r\n<\/body>\r\n\r\n<\/html>",
  "chapIndex": "SUMMARY OF WILLIAM SHAKESPEARE'S TEMPEST"
}