{
  "text": "<html>\r\n    <head>\r\n    <style>\r\n        .unselectable {\r\n          -webkit-user-select: none;\r\n          -webkit-touch-callout: none;\r\n          -moz-user-select: none;\r\n          -ms-user-select: none;\r\n          user-select: none;\r\n        }\r\n      <\/style>\r\n      <\/head>\r\n\r\n<body class=\"unselectable\">\r\n \r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">THE NEW MAN: TWENTY-NINE YEARS A SLAVE, TWENTY-NINE YEARS A FREE MAN&nbsp;<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">By Henry Clay Bruce, 1836-1902<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">About the book<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Henry Clay Bruce (1836-1902) was born a Virginia slave in the year that &quot;Martin Van Buren was elected president&rdquo;. He thus deduced later in life that he was born in 1836 to two slaves who took the last name of their owner, Lemuel K. Bruce. Henry grew up a slave with his family, shuffling between masters and going back and forth between cities and plantations. He spent twenty-nine years enduring what he considered a relatively humane form of slavery. Amid the Civil War and the push for emancipation, he and his betrothed made the decision to flee Virginia for Leavenworth, Kansas, and pursue life in free society. However, with freedom came new difficulties. Though he was able to get a job and provide for his family, he found it challenging to earn a living wage and remain employed. Owing to the success and support of his brother, United States Senator Blanche K. Bruce, Henry was able to secure a position in the U.S. postal service and publish his reflections on experiences both as a slave and a free man. His autobiography was published in 1895, and he died seven years later in 1902, leaving behind an iconic piece of abolitionist literature.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Summary<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Bruce begins<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">The New Man: Twenty-Nine Years a Slave, Twenty-Nine Years a Free Man<\/span><\/em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">(1895) with a preface explaining that he is now a free man and that his experiences with kind white men allow him to present an unbiased depiction of slavery. He explains that &quot;[he] considers himself competent to deal with all concerned, fairly and without prejudice, and he will feel more than repaid for his labor, if he can throw even some little new light upon this much mooted question&quot;. This preface establishes a frame for the narrative that follows. Bruce suggests that the problem of slavery and inequality is not caused by color of skin, but actually by the caliber of blood within any given man; thus, slavery was the fault of both blacks and whites alike. He states, &quot;Of course I do not wish to be understood as teaching the doctrine, that blood is to be divided into white blood and black blood, but on the contrary, I wish to be understood as meaning that it should be divided into inferior and superior, regardless of the color of the individual in whose veins it flows&quot;. He then elaborates on his experiences with this idea in mind, exhibiting how men with bad blood contribute to the oppression of African Americans, while men with good blood help alleviate racial prejudice and inequality.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Shortly after Henry&#39;s birth, Lemuel K. Bruce dies and Henry&#39;s family comes under the ownership of his daughter, Rebecca Bruce and her new husband, Pettis Perkinson. Henry Bruce is allowed to hunt and fish until he is grown, for &quot;the slave children had nothing to do but eat, play and grow, and physically speaking, attain to good size and height, which was the special wish and aim of their masters, because a tall, well-proportioned slave man or woman, in case of a sale, would always command the highest price paid&quot;. As he grows, Bruce is required to take on different responsibilities. His masters allow him an education, teaching him that slaves well-cared for will be more compliant in their duties. Thus, Bruce begins his education and a pattern of devoted service to his various masters. While acknowledging that slavery, as an institution, is innately bad, he still suggests that where there is a pattern of civility from one side, those with &quot;good blood&quot; will respond in kind. He states that his fellow slaves, &quot;having superior blood in their veins, they did not give up in abject servility, but held up their heads and proceeded to do the next best thing under the circumstances, which was, to so live and act as to win the confidence of their masters, which could only be done by faithful service and an upright life&quot;. As if to demonstrate the benefits that accrue to slaves who behave themselves, Bruce recounts experiences where his masters confide in him and exhibit confidence in his work. Notwithstanding this congenial working relationship, however, Bruce emphasizes that he did not voluntarily remain a slave.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Bruce&#39;s owners occasionally sell the rights to Bruce&#39;s labor on an annual basis. Thus, he is frequently transported back and forth between cities and plantations. On one such journey back to Perkinson in Virginia, Bruce suggests that he almost became a free man much earlier in his life. He relates a journey by steamboat on which he learned that if he just set foot in the free state of Ohio, the abolitionists would come and get him. Due to their ignorance of the abolitionist movement&#39;s purpose, Bruce and other fearful slaves on board inform their masters of the possibility that the vessel might dock in Ohio, and the slave owners avoid landing on its banks. Bruce later laments that this lost opportunity caused him to remain in slavery for 17 extra years.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">These seventeen years do not pass with complete ease. Bruce recalls the difficulty of his experiences in the cotton field. On one occasion, he refuses to let one of his masters whip him, which leads to his master&#39;s wife hitting him with a switch instead. Even when he is put in positions of responsibility, Bruce finds that his masters need to establish their own superiority. He recalls, &quot;I was held responsible for everything, as our owner seldom went over any part of the farm, and left me to manage it entirely, reporting to him every morning. I really had full control of the place, but he did not want me to think so. He had a habit of calling me to report what was done the previous day, and what I thought should be done that day. I would state my opinion, and he would be certain to make light of it, get angry, tell me I had no sense then cool down and tell me to go ahead and do just the work I had suggested&quot;).<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">During his final years as a slave, Bruce lives near a slave owner named Cabel, who beats his slaves for their apparent laziness. Often, Cabel discusses the situation of his own farm with Bruce while he works in Perkinson&#39;s fields. Ultimately, Bruce conjectures that the punitive relationship between Cabel and his slaves could be blamed on both parties. Bruce observes, &quot;The master who treated his slaves humanely had less trouble with them, got better service from them, and could depend upon their doing his work faithfully, even in his absence, having his interest in view always. Maltreated slaves and ill-treated beasts of burden are much alike; if trained to be punished, whether deservedly or not, they take no interest in their service, and go no further than the lash forces them, because they receive no encouragement even when they perform their duty well&quot;.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">As the Civil War draws to a close and emancipation seems nigh, Union troops begin to enlist blacks in Bruce&#39;s town. Bruce&#39;s owner offers to compensate him if he stays with him instead of joining Union forces. This decision is a difficult one for Bruce, who admits to being kindly treated by his current master. He initially agrees to stay but reneges and escapes to Kansas when he sees that Perkinson lacks the funds to provide the promised compensation. Bruce explains that &quot;[My owner] agreed to give me fifteen dollars per month, with board and clothing, if I would remain with him on the farm, an offer which I had accepted to take effect January 1, 1864. But by March of that year I saw that it could not be carried out, and concluded to go to Kansas. I might have remained and induced others to do so and made the crop, which would have been of little benefit to him, as it would have been spirited away. I made the agreement in good faith, but when I saw that it could not be fulfilled had not the courage to tell him that I was going to leave him&quot;. He thus decides to escape and pursue a new life with his free wife.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Eventually (after several unsuccessful business endeavors and political campaigns), Bruce secures a position of the Doorkeeper to the Kansas State Senate in 1881, and ultimately works for the Pension office, where his brother, United States Senator Blanche K Bruce, helps him to get a job. He serves diligently, noting that promotions were given for merit rather than skin color. He observes that life in this freed society, though not devoid of challenges, is preferable to slavery because of the efforts of those with good blood who understand equality.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">UNN PUTME Examples<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Questions below are based on Perri Ademuluyi&#39;s &quot;The New Man&quot;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">1. The eventual conflict between Ayo Badejo and the people of Ipaja was most pointedly foretold by____.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. Prophet Elijah B. Hon. Bulawayo C. Chief Layeni D. the school Headmaster<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(D. the school Headmaster, 2010\/2011, no 5)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">2. A strong or prominent feature of &quot;The New Man&quot; is____.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. sermons B. political rallies C. festivals D. violence<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(C. Festivals, 2010\/2011, no 6)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">3. The author&#39;s use of his name as a character in the hovel is intended to____.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. display his mastery of fiction B. give the story an impression of truth C. displace the prominence of the hero D. convert the story into a historical document<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(B. give the story an impression of truth, 2010\/2011, no 7)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">4. The religious life of the people of Ipaja could be described as___.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. pure and devout B. exclusively heathenish C. contentious and rowdy D. a mixture of superstitions and Christian beliefs<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(D. a mixture of superstitions and Christian beliefs, 2010\/2011, no 8)<\/span><\/em><\/p>\r\n<\/body>\r\n\r\n<\/html>",
  "chapIndex": "SUMMARY OF THE NEW MAN: TWENTY-NINE YEARS A SLAVE, TWENTY-NINE YEARS A FREE MAN "
}