{
  "text": "<html>\r\n    <head>\r\n    <style>\r\n        .unselectable {\r\n          -webkit-user-select: none;\r\n          -webkit-touch-callout: none;\r\n          -moz-user-select: none;\r\n          -ms-user-select: none;\r\n          user-select: none;\r\n        }\r\n      <\/style>\r\n      <\/head>\r\n\r\n<body class=\"unselectable\">\r\n \r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">THE JOYS OF MOTHERHOOD&nbsp;<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">By Buchi Emecheta<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">About the Novel<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">The novel is considered a classic of feminine literature,<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">The Joys of Motherhood<\/span><\/em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">is the 1979 novel written by Nigerian-born British author&nbsp;<\/span><a name=\"_Hlk46472321\"><span style=\"font-family:'Times New Roman';\">Buchi Emecheta<\/span><\/a><span style=\"font-family:'Times New Roman';\">. Set in Lagos, Nigeria over the course of decades, the tragic story follows Nnu Ego, a young African woman struggling to overcome her temporary inability to rear children and embrace a motherly role in a patriarchal society. Unable to conceive a child in her first marriage, Nnu Ego is banished to Lagos, where she eventually gives birth to several children and redefines her role in the community. As Nnu Ego grapples with the traditional values and customs of becoming a &ldquo;mother,&rdquo; &ldquo;wife&rdquo; and &ldquo;woman,&rdquo; she must do everything in her power to protect her children and maintain her dignity. In 2008,<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">The Joys of Motherhood<\/span><\/em><em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/em><span style=\"font-family:'Times New Roman';\">was reissued in Heinemann&rsquo;s African Writers Series.<\/span><br><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Character List<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Nnu Ego<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">The novel&rsquo;s protagonist. At the beginning of the novel, slim, long-necked Nnu Ego is known for her youthful beauty and is often compared to her mother, the high-spirited Ona. Although she has her mother&rsquo;s strength and singleness of purpose, she is more polite and compliant and less aggressive and outspoken than Ona. She leaves her husband after she cannot get pregnant, and she later attempts suicide when her firstborn is found dead. Eventually, she settles into a bittersweet life of challenge and sacrifice with Nnaife and her children in Lagos.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Amatokwu<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Nnu Ego&rsquo;s first husband. When Amatokwu fails to impregnate Nnu Ego, he eventually asks her to move to an outer hut to make room for his second wife. He forces Nnu Ego to work in the fields if she cannot be productive bearing children. When he discovers Nnu Ego breast feeding his second wife&rsquo;s son, he savagely beats her, prompting their eventual divorce. Despite the abuse, Nnu Ego still holds him up as the standard of Ibo manhood.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Nnaife<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Nnu Ego&rsquo;s second husband. Nnaife is short, with a large paunch, pale skin, puffy cheeks, and untraditionally long hair. He is both sensitive and tender with his wife as well as nasty and unsympathetic about the demands made of her as a woman. After he loses his job washing for the Meers, he becomes an assistant to a group of Englishmen and is then employed cutting grass for the railroad, where he is forced to join the army. He is sent to India and Burma to fight in World War II. Eventually disillusioned with his life and family, he attempts to murder Kehinde&rsquo;s Yoruba father-in-law and is sentenced to five years in prison. When he is released early, he returns to Ibuza a broken man.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Ngozi<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Nnu Ego and Nnaife&rsquo;s first child. Ngozi dies in infancy, and his death marks a turning point in the novel, prompting Nnu Ego&rsquo;s suicide attempt. He is a source of guilt and regret, a specter that haunts Nnu Ego for years.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Adaku<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Nnaife&rsquo;s brother&rsquo;s wife whom Nnaife inherits when his brother dies. Young, attractive, peaceful, and self-satisfied, Adaku joins the family in Lagos and soon starts a thriving and lucrative business selling in the marketplace. Her wealth and success go unrecognized because she bears no sons, only two daughters. Tired of her role of inferiority, she moves out of the household and threatens to become a prostitute. The name<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">Adaku<\/span><\/em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">means &ldquo;daughter of wealth.&rdquo;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Adankwo<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">The eldest wife of Nnaife&rsquo;s older brother. Tough, strong, wiry, and dependable, Adankwo is in her early forties and a voice of wisdom and reason among the Ibuza women. She advises Nnu Ego to return home to Lagos in order to keep an eye on Adaku. When Nnaife impregnates her with her last child, she refuses to return to Lagos with him and arranges to have Okpo sent instead.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><a name=\"_\"><\/a><strong><span style=\"font-family:'Times New Roman';\">Adimabua<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">The second living son of Nnu Ego and Nnaife, known as Adim. Observant and intelligent, Adim grows up in the shadow of his older brother. He quickly figures out the entitlement due him as a male and realizes the opportunities denied him as the second oldest. Quick to act, he prevents his father from murdering the Yoruba butcher. Like Oshia, Adim aspires to better things and later leaves Nigeria to pursue his education in Canada. His name means &ldquo;now I am two&rdquo; and shows his place in the male hierarchy of the family.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><a name=\"_\"><\/a><strong><span style=\"font-family:'Times New Roman';\">Agbadi<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Nnu Ego&rsquo;s father. Agbadi is a highly respected local chief known for both his skill at oratory and for his physical prowess. Cold, disrespectful, and cruel to his wives, he is loving and indulgent to his daughter, whom he treats as the embodiment of and last link to his beloved mistress, Ona. He is a constant source of support and a voice of reason in Nnu Ego&rsquo;s life.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><a name=\"_\"><\/a><strong><span style=\"font-family:'Times New Roman';\">Cordelia<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Ubani&rsquo;s wife. Cordelia is kindhearted and a good friend to Nnu Ego when she makes the initially tough transition to life in Lagos. She is also a source of jealousy and conflict. Nnu Ego resents the easier, more stable life Cordelia seems to have, an attitude that sparks squabbles and petty disagreements<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">between the women. Her name reveals the colonial influence on the region.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><a name=\"_0\"><\/a><strong><span style=\"font-family:'Times New Roman';\">Mama Abby<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A prosperous Ibo woman and confidant of Nnu Ego&rsquo;s. Mama Abby earns respectability through the advancement of her son, the intelligent, upwardly mobile Abby. Her husband was a European who had worked in the Nigerian colonial service. He eventually returned to Europe, leaving his family well provided for. She, too, is of a mixed racial background. Slim, ladylike, and an eventual mother figure to Nnu Ego, Mama Abby is considered upper class but likes to live modestly with other Ibos. Many of the men view her as a negative influence and do not want their wives associating with her.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><a name=\"_1\"><\/a><strong><span style=\"font-family:'Times New Roman';\">Dr. Meers<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Nnaife and Ubani&rsquo;s employer. Dr. Meers is the chief occupant of the Yaba compound and works at the Forensic Science Laboratory in Taba. The doctor makes little attempt to hide his racist attitudes concerning his African employees, overtly calling Nnaife a &ldquo;baboon.&rdquo;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><a name=\"_2\"><\/a><strong><span style=\"font-family:'Times New Roman';\">Mrs. Meers<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Dr. Meers&rsquo;s wife. Mrs. Meers, the only white female character in the novel, has gray, sunken eyes, and appears to have been prematurely aged by the climate and her life in West Africa. She believes she is kind to her African staff, chiding her husband for his racist remarks, but at the same time she maintains a haughty and aloof demeanor of social superiority in their presence.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><a name=\"_3\"><\/a><strong><span style=\"font-family:'Times New Roman';\">Obi Umunna<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Ona&rsquo;s father. A great chief and doting father, Obi Umunna is particularly protective of his daughter&rsquo;s honor and freedom. He allows her to have lovers but does not force her to commit to a marriage. He prizes only an elusive male heir, which his daughter never produces. He is ridiculed for not finding a suitable match for his daughter and viewed by some as an ineffective father because of it.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><a name=\"_4\"><\/a><strong><span style=\"font-family:'Times New Roman';\">Okpo<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Nnaife&rsquo;s sixteen-year-old bride. Okpo is sent to Lagos to live with the family when Adankwo refuses to leave Ibuza. Though she is Nnaife&rsquo;s wife, Okpo has childlike qualities herself. She understands her traditional role as a wife and praises and flatters Nnu Ego for raising such clever and accomplished children.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><a name=\"_5\"><\/a><strong><span style=\"font-family:'Times New Roman';\">Ona<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Nnu Ego&rsquo;s mother. Ona is known for her catlike grace and youthful exuberance as she runs about the village with her breasts exposed. She wears expensive waist beads and is later held to be conservative, haughty, cold, and remote when she wins the role of Agbadi&rsquo;s favorite mistress. She is often reminded of her place as an Ibuzan women when she openly challenges and taunts her lover.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><a name=\"_6\"><\/a><strong><span style=\"font-family:'Times New Roman';\">Oshiaju<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Nnu Ego&rsquo;s oldest surviving son, known as Oshia. Medicine men predict Oshiaju will be an intelligent man of infinite resources whose success will provoke jealousy in others. Tender and firm, Oshia physically resembles his father. He aggressively pursues higher education, working in a laboratory in Lagos and eventually winning a scholarship to a university in America. His name means &ldquo;the bush has refused this,&rdquo; referencing his health and the long life predicted for him.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><a name=\"_7\"><\/a><strong><span style=\"font-family:'Times New Roman';\">Taiwo and Kehinde<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Nnu Ego and Nnaife&rsquo;s oldest twin girls. Kehinde is quieter and more introspective than Taiwo. She radically breaks with tradition by marrying a Yoruba man. Taiwo is the more fun-loving and adaptable twin. She aspires for a dependable husband and stable home life, both of which she finds with the clerk Magnus. He finds his ideal match in an uneducated wife content with the more traditional role of bearing and raising children.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><a name=\"_8\"><\/a><strong><span style=\"font-family:'Times New Roman';\">Ubani<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Friend of the Owulums. At first, Ubani is a cook in the Meers&rsquo;s compound. A good provider, he later gets Nnaife a job cutting grass for the railroad. He is a stable presence in the lives of those around him. He is the one who calmly informs Nnaife that his son, Ngozi, has died.<\/span><br><strong><span style=\"font-family:'Times New Roman';\">Summary<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">The story begins in 1930s Lagos, Nigeria. An African woman named Nnu Ego ambles across the Yaba property in a state of depression and grief. Nnu Ego wanders to the water&rsquo;s edge of Carter Bridge with intentions to leap off and commit suicide. The story jumps backward 25 years in time. In the village of Ogboli in the Ibuza homeland, the proud and dignified local chief, Agbadi, has only one object of desire, an attractive and self-determined woman named Ona. While hunting one day, Agbadi is bludgeoned to near death by an elephant. Ona steadily nurtures him back to health. When he heals, Agbadi disgraces Ona with crude sexual advancements. A near rape ensues, resulting in Ona becoming pregnant. Agbadi declares that if the baby is a boy, it will belong to his father. If it&rsquo;s a girl, Agbadi will claim ownership. Nine months later, Nnu Ego is born and Ona dies during childbirth. A local shaman declares Nnu Ego&rsquo;s &ldquo;chi&rdquo; or guiding spirit is that of a slave child who was murdered and buried with one of Agbadi&rsquo;s wives.<\/span><br><br><span style=\"font-family:'Times New Roman';\">When Nnu Ego is 16, she is engaged to wed a man named Amatokwu. However, their relationship weakens after she is unable to become pregnant. Nnu Ego is transported to a different hut to assume a new role. She becomes demoted to tending the fields and caretaking for the new wife&rsquo;s baby son. Amatokwu finds Nnu Ego breastfeeding the hungry baby and beats her for it. Nnu Ego goes home to recover, at which point her wedding engagement is dissolved. Determined to find his daughter a better suitor, Agbadi arranges a marriage between Nnu Ego and a man named Nnaife, who resides in faraway Lagos. Nnaife&rsquo;s older brother takes Nnu Ego to Lagos to settle into her new environment.<\/span><br><span style=\"font-family:'Times New Roman';\">Nnu Ego and Nnaife reside in the Yaba compound in Lagos. Nnaife launders clothes for the Meers, an English couple. Nnu Ego enjoys a happy marriage and gives birth to a son named Ngozi. Nnu Ego also begins selling cigarettes and matches on the side of the road. One day, Nnu Ego discovers Ngozi&rsquo;s dead body in their one-room abode. Hopelessly devastated, Nnu Ego speeds to Carter Bridge with plans to jump off and commit suicide. Nwakusor, a local Ibo man just off of work, passes by and helps a crowd of people prevent Nnu Ego from leaping off the bridge.<\/span><br><br><span style=\"font-family:'Times New Roman';\">Afterwards, Nnu Ego struggles through a long process of grieving the death of Ngozi. She eventually has another baby named Oshia. Nnu Ego decides to spend less time at her roadside market stall and instead focus all of her attention on raising Oshia. However, when the Meers are forced back to England, Nnaife loses his job, necessitating Nnu Ego to continue selling cigarettes and matches. Naife finds work that takes him far away from home. In his absence, British troops enter the area and tell Nnu Ego she and Oshia must vacate immediately. Nnu Ego relocates across town, where she gives birth to another son, Adim. Without aid, the woman and child suffer malnutrition. Their neighbors offer a helping hand. Later, Nnaife returns home with a bundle of cash. As Nnu Ego is awarded a permanent post in the marketplace to sell cigarettes, she encourages Nnaife to find a new job.<\/span><br><br><span style=\"font-family:'Times New Roman';\">One day, Nnaife is informed from a friend that his brother has died in Ibuza. Nnaife has assumed his brother&rsquo;s wives as a result, but only one is willing to come live in Lagos with them. The wife, Adaku, arrives with her daughter, resulting in jealous tension among the two women. At night, Nnaife attempts to have sex with Adaku while Nnu Ego rests nearby. Later, Nnaife finds work mowing grass for the railroad. Around this time, Adaku and Nnu Ego both become pregnant. Nnu Ego births to twin girls, Taiwo and Kehinde, while Adaku&rsquo;s son dies shortly after birth. Feeling underpaid, Nnu Ego and other women go on strike for better wages. Nnu Ego&rsquo;s steadfastness wanes however, and she prepares a peace-making meal. Nnaife cannot be present to enjoy the meal because he&rsquo;s been forced to enlist in the army and transported to India to fight in WWII.<\/span><br><span style=\"font-family:'Times New Roman';\">Nnu Ego becomes pregnant again, and uses Nnaife&rsquo;s partially saved salary to take her family to Ibuza. Nnu Ego visits her dying father. Following these two funerals, Nnu Ego refuses to return to Lagos. However, she is convinced by Nnaife&rsquo;s brother&rsquo;s wife, Adankwo, to return to look after Adaku. Nnu Ego agrees. Upon her return, she finds a sum of money left behind by Nnaife during a brief visit back to Lagos. The tension between Nnu Ego and Adaku escalates; resulting in the former insulting the latter&rsquo;s cousins during a visit. Adaku decides to move out with her children. Nnu Ego is left impoverished when Nnaife&rsquo;s annual commissions are discontinued due to an institutional glitch. Nnaife returns and spends his remaining money. He returns to Ibuza, where he impregnates Adankwo. Later, Nnaife returns to Lagos with a 16-year-old wife, Okpo.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><br><span style=\"font-family:'Times New Roman';\">The family relocates to the other side of town. Oshia and Adim declare their intention to earn a higher education. Oshia tells Nnaife he has earned a scholarship to study in America. Nnaife condemns Oshia for betraying his sonly duties. Taiwo is arranged to marry an Ibo, while Kehinde elopes to wed a Yoruba. Enraged, Nnaife attempts to kill Kehinde&rsquo;s father-in-law with a sword. Nnaife is jailed, convicted and sentenced to serve five years in prison, a period that will become reduced provided Nnaife return to Ibuza following his release. Nnu Ego returns home, where she dies beside the road several years later. Oshia returns and holds a lavish funeral in honor of her mother&rsquo;s sacrifice.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">UNN PUTME Examples<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Questions below are taken from Ruchi Emecheta&#39;s The Joys of Motherhood<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">1. Nnu Ego, the daughter, of Aghadi, don&#39;t he greedy. Manage with Nnaife&rsquo;s income and look after your child. That is your duty. Be satisfied with his earnings. Let him do his duty.&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Who said the above?<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. Nwakusor B. Nnu Ego C. Adaku D. Dilibe<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(A. Nwakusor, 2011\/2012, no 1)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">2. If you were not the mother of my sons, I would have taught you a lesson this evening. But don&rsquo;t push me too far or I may still do it. Who brought you here? You think you can be defiant...<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">The bone of contention above is____.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. rent B. sacrifice C. feeding money D. baby napkins<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(C. feeding money, 2011\/2012, no 1)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">3. Nntiego&#39;s first reaction to Nnanne betrays<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. elation B. disgust C. contentment D. familiarity<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(B. Disgust, 2008\/2009, no 7)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">4. Nnuego&#39;s character could be summarized as____.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. extremely and unreasonably self- sacrificing B. deliberately arid negatively scheming C. extremely selfish D. irresponsible and care free<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(A. extremely and unreasonably self- sacrificing, 2008\/2009, no 8)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">JAMB Examples<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">1. In the novel, the society puts high value on __.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. egalitarianism B. male ascendancy C. procreation D. gender equity.&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(C. procreation)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">2.The medicine man links the lump discovered on the head of Nnu Ego at birth, to the __.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. possession of physical admirable qualities that makes her an epitome of perfection.&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">B. wound inflicted on the slave woman buried with Agbadi&rsquo;s wife C. coming back of the Agunwa to the&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">society to live again D. ill-luck and tragic events attributed to a predestined fate<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(B. wound inflicted on the slave woman buried with Agbadi&rsquo;s wife)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">3.The constant companions of Nnaife&#39;s family are __.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. togetherness and happiness B. poverty and hunger C. sickness and joblessness D. disagreement and humiliation<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(B. poverty and hunger)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">4. For attempted murder, Nnaife was jailed for&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. four months B. three months C. five months D. two months&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(A. four months)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">5. In the novel, Nwokocha Agbadi is famous for his oratorical powers and&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. height B. treachery C. illiteracy D. wealth&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(D. wealth)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">6. In the novel, the handing over of a baby boy in a dream to Nnu Ego by her personal god signifies&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. Reincarnation B. future blessing C. idol worship D. doom<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(B. future blessing)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">7. As a symbol of material success and fulfilment, Ibuzza community places a lot of importance on<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. childbirth B. wealth C. male child D. female child<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(A. childbirth)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">8. Ona on her dying bed appeals to Agbadi to<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. give her a befitting burial B. take good care of her children C. take another wife D. allow Nnu Ego marry a man of her choice<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(D. allow Nnu Ego marry a man of her choice)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">9. The little money Nnaife makes after returning from Fernando PO is used for<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. expanding Nnu Ego&#39;s business B. taking care of his family C. sending his children to school D. getting more wives<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(D. getting more wives)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">10. Nnu Ego is blamed for the misfortunes of her<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. parents B. husband C. siblings D. children<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(D. children)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">11. According to the novel Nnaife becomes frustrated when<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. Oshiaju secures a scholarship to study abroad B. he is arrested and charged for attempted murder of his in-law C. his wife gives birth to female twins D. he is recruited into the army<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">(C. his wife gives birth to female twins)<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">12. Adaku remains faithful to Nnaife until she<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. starts keeping unnecesary friends B. is unable to give birth to a male child C. is rebuked by the Ibuza society for abusing Nnu Ego D. becomes rich and powerful<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(A. starts keeping unnecesary friends)<\/span><\/em><\/p>\r\n<\/body>\r\n\r\n<\/html>",
  "chapIndex": "SUMMARY OF THE JOYS OF MOTHERHOOD "
}