{
  "text": "<html>\r\n    <head>\r\n    <style>\r\n        .unselectable {\r\n          -webkit-user-select: none;\r\n          -webkit-touch-callout: none;\r\n          -moz-user-select: none;\r\n          -ms-user-select: none;\r\n          user-select: none;\r\n        }\r\n      <\/style>\r\n      <\/head>\r\n\r\n<body class=\"unselectable\">\r\n \r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">THE POTTER&rsquo;S WHEEL<\/span><\/strong><br><strong><span style=\"font-family:'Times New Roman';\">By Chukwuemeka Ike<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">About the book<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">The Potter&rsquo;s Wheel is a novel that takes us to a village called Umuchukwu in the eastern part of Nigeria, where one of the basic elements of the local idioms is sayings or proverbs, much like a Bible-based community where people communicate through chapters and verses citations. In the story, even the young ones had riddle and proverb contests to see who knew the most. The story was set about the time of the Second World War (1939-1945). In the story, references are frequently made to the ongoing war, which Nigerians, at that time were part of, through conscription or voluntary involvement.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Summary<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">The story centres on Obu, an eight-year-old boy, who, as the only son with five older sisters and one younger sister, had been badly spoiled by his adoring mother. The mother&rsquo;s reason for her indulgence towards him was simple; it was the boy&rsquo;s eventual birth that gave her strong footing in her husband&rsquo;s house, for the husband&rsquo;s family had compelled him to take another wife who would give them &ndash; the family &ndash; a male child. In fact, the five female children that were born before Obu had been given names suggestive of the degree of anxiety and faith, with which Mama Obu and her husband had longed for a male child. The name &ldquo;Uzoamaka&rdquo;, given to their first female child, means &ldquo;The road is excellent&rdquo;; the second, &ldquo;Nkiru&rdquo; means &ldquo;That which is yet to come is greater&rdquo;; the third, &ldquo;Njideka&rdquo; means &ldquo;Hold what you have&rdquo;; the fourth, &ldquo;Nkechi&rdquo;, means &ldquo;Whatever God gives&rdquo;; and the fifth, &ldquo;Ogechukwu&rdquo;, means &ldquo;God&rsquo;s time is the best&rdquo;. Besides that, when Obu arrived, he became a cynosure to the parents, the mother particularly, so much so that apart from his first name &ldquo;Obuechima&rdquo;, which means &ldquo;Compound must not revert to bush&rdquo;, he was given all sorts of endearment names, such as &ldquo;Ezenwa&rdquo;, meaning &ldquo;infant king&rdquo;, &ldquo;Nwokenagu&rdquo;, meaning &ldquo;A male child is desirable&rdquo;, &ldquo;Oyinbo&rdquo;, meaning &ldquo;A companion&rdquo;, and &ldquo;Obiano&rdquo;, meaning &ldquo;Solace&rdquo;. No other boy came after Obu, but a girl came two years after his birth, and she was named &ldquo;Amuche&rdquo;, meaning &ldquo;No one knows God&rsquo;s mind&rdquo;. All these events depict the superstitious nature of the Ibos; how they weave some stories around everything that happens to them.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Obu&rsquo;s father, Mazi Lazarus Maduabuchi was a successful cloth dealer. He was a kindly man, but fearing for the boy&rsquo;s future in the hands of his over doting mother, he sent him off to be a servant of a weird, fearsome couple, Teacher Zaccheus Kanu and Madam Deborah Onuekwucha Kanu, both of whom were childless and lived in Aka, a village, some sixty miles away from Umuchukwu. Mama Obu was vehemently opposed to the seemingly suicidal idea of having her treasured son sent to the house of a &ldquo;wicked man and the witch he has as wife&rdquo;, even when her husband proverbially reasoned with her that, &ldquo;He who does not suffer hardship cannot develop any common sense&rdquo;. In the end however, her resistance, merely verbal, cut no ice, for she was the one, who even later took Obu to the Teacher&rsquo;s house in Aka, where the boy was to begin a new life as a servant. This event is symbolic of the prevalent mentality of African parents, fathers specifically, who so much believe, against the stifling fondness of mothers, that some degree of hardship and suffering is very essential in the upbringing of a child, if such child is to be useful to him\/herself in the future. Also, the subservience and abject obedience of mothers and wives to their husbands was aptly portrayed by Mama Obu, as such slavish compliance, as far as African traditions are concerned, is crucial to the continued survival of a marriage.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Teacher Zaccheus Kanu&rsquo;s house, a reformatory home of some sort, sheltered an assortment of other youngsters: Silence (who was 14yrs), Moses, Ada (who was 16, and a cousin to Teacher), Mary (who was a spoilt girl, already engaged to a man but was &lsquo;enrolled&rsquo; by the fianc&eacute; at Madam&rsquo;s home, for her to undergo some tutelage in domestic and wifely training), Monday (who was 19, and Madam&rsquo;s cousin), Bright (whom his father gave out to Teacher in exchange for the money the father was owing Teacher), and Obu, the newest arrival. These children were beaten and abused, and were subjected to slavish lives. For instance, apart from the &lsquo;baptism of fire&rsquo; slap that Obu got from Madam, Teacher&rsquo;s wife, on his first day at Teacher&rsquo;s house, for talking back at the woman, he also, at another time, was served another deafening smack by the ruthless Madam, because of his careless and wasteful attitude of pouring away the excessively salted pottage that she had asked him to prepare for her. The smack sent him sprawling on the ground and made him dizzy for some time. At some other time, Obu was openly embarrassed and beaten so wickedly on the assembly in his school, by the headmaster, who must have been told by Teacher that Obu stole a piece of meat from the pot at home the previous night.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Expectedly, these children, in their various childish ways, devised different acts of vengeance, to get back at their two oppressors &ndash; Teacher and Madam. First of all, they all developed strong flair for lying, as they mostly had to lie to escape from the unwarranted harsh punishment they were endlessly subjected to. Besides, Silence, the very tricky fourteen year old boy, would never answer a call by either Teacher or Madam, the first two successive times. He would neglect the call the first two times, with the hope that if he didn&rsquo;t answer it, his caller would call someone else. He would answer the call only if it came the third time. Bright was another character. Teacher almost always liked to insultingly remind him that he &ndash; Bright &ndash; was serving him (Teacher), because of his (Bright&rsquo;s) father&rsquo;s debt to him. When once, he gave Bright such humiliating reminder, and even attempted to wipe his oil-soiled hand dry on Bright&rsquo;s head, the boy, &ldquo;like a drenched dog&hellip;&rdquo; (pg. 133), &ldquo;&hellip;shook his dripping head vigorously&hellip;&rdquo;, and he let drops of the oily water splash on Teacher&rsquo;s shirt. Ada was yet another character!<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Exasperated by Madam&rsquo;s unrepentantly cruel behavior towards her and others in the house, Ada once poured on her Madam &ldquo;&hellip;a bowl of dirty water containing cocoyam peels, discarded ora leaves, and a coating of palm oil from the cooking utensils she had washed in the bowl&hellip;&rdquo; (pg. 186). Even after that mischief, Ada stood unremorseful and ready for the consequences of her actions. As the furious Madam punched and hit and smacked Ada, the girl defensively fended off some of the blows and mockingly took some, unwearyingly. Even the bigger punishment from Teacher, which came much later &ndash; scrubbing the school latrine every day for one whole week &ndash; meant nothing to the girl. She was happy that she had succeeded in cutting her Madam down to size!<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">The brutalities that abound in the Aka home provoked nostalgic feelings in Obu about his birth place. He had nostalgia about home, through dreams and reminiscences. He was so home-sick that he thought of what seemed to be a foolproof strategy, which was to write a letter in the guise of his mother, to Teacher. In the short letter which he eventually wrote, in Igbo, his impersonated mother said she wanted Obu to come home, to Umuchukwu, to look after his younger sister. What Obu had thought would work against Teacher was so easily faulted by the crafty Teacher. Teacher was nonetheless stunned by the creativity of the boy (for him to have thought of something as ingenious as impersonating his mother!)<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">After a year of the hellish life Obu had lived in Aka, his father requested that he be allowed to return home for Christmas, and by the time he returned to Umuchukwu, Obu had become so much transformed into a dutiful, hardworking boy. His return sent everywhere agog! He had shed his old habits &ndash; he was no more the loafing, bed-wetting, spoilt Obu! However, happy about his eventual rescue from the tortuous Aka life, Obu never wished to return to Teacher&rsquo;s house. He asked his mother to help him tell his father about his decision, but the mother, understanding how predictably fruitless such effort of hers would be, urged Obu to speak to his father himself. After some long contemplation as to how to tell his father about his decision not to return to Teacher&rsquo;s house, he finally broached the topic. His father&rsquo;s compromising response trivialized Obu&rsquo;s protracted worry, and he (Obu) wished he had said his mind long before he later did. And after Obu&rsquo;s father&rsquo;s seeming compromising response, he later called Obu to sit. With some wise cajolery, the silver-tongued father of Obu succeeded in making the boy see the need for him to return to Teacher&rsquo;s house.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&ldquo;Nobody who does not suffer can succeed in life. Edmund is what he is because his father forgot yams, forgot cocoyams, forgot meat and sent him to suffer in Teacher&rsquo;s hands. It was Teacher who made him. Teacher tells me your brain is even hotter than Edmund&rsquo;s. So, there is no reason why you should not drink tea with the white man and study in the white man&rsquo;s land. But if you want to be like Caleb, you should come and live with your mother, eating goat meat and drinking palm wine and dancing with masquerades. But when the time comes, don&rsquo;t say that I did not warn you. You can go.&rdquo;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">After this persuasive talk with his father, Obu himself voluntarily returned to Teacher&rsquo;s house in January (after the Christmas holiday).<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">The story ultimately centres (thematically) on the challenges of parenthood. With the constant interplay between the vernacular Igbo and the English language, the author enlightens us on many things: The plight of a &lsquo;maleless&rsquo; (without a male child) wife or couple in traditional Igbo or Nigerian society; the concept of Ogbanje (or Abiku) children and the societal attitudes to such children; the richness of traditional values as seen in the prevalently mentioned local food (especially the uncommon ones as fried termites, which were here considered as a treat; and the very common one, kola nuts, which are usually served, as etiquette demands, by hosts to visitors.); local names guarded or prompted by some superstition; local proverbs put to various communicative uses; local beliefs and traditions, etc.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">UNN PUTME Examples<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">1. Question 11 is based on Chukwuemeka Ike&#39;s The Potter&#39;s Wheel<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">11. If you have not beheld your chi in his stark nakedness, he prepared to do so as soon as you set foot in that man&rsquo;s house.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">From the excerpt above, whose house was being referred to?<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. Mazi Nwokike B. Teacher Zacchaeus C. Mazi Okeke D. Mazi Laza<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(B. Teacher Zacchaeus, 2017\/2018, no 11)<\/span><\/em><\/p>\r\n<\/body>\r\n\r\n<\/html>",
  "chapIndex": "SUMMARY OF THE POTTER’S WHEEL "
}