{
  "text": "<html>\r\n    <head>\r\n    <style>\r\n        .unselectable {\r\n          -webkit-user-select: none;\r\n          -webkit-touch-callout: none;\r\n          -moz-user-select: none;\r\n          -ms-user-select: none;\r\n          user-select: none;\r\n        }\r\n      <\/style>\r\n      <\/head>\r\n\r\n<body class=\"unselectable\">\r\n \r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">THE OLD MAN AND THE SEA<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">By Ernest Hemingway<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">The Old Man and the Sea was the last novel Ernest Hemingway published before killing himself in 1961. In many ways, the novel gives us a glimpse into the award-winning author&#39;s mind as this story&#39;s events and themes connect to Hemingway&#39;s life. Ernest Hemingway&#39;s novel The Old Man and the Sea creatively tells the story of an old man who struggles to reel in an enormous marlin. But it is actually about much more than a guy and a fish.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Character Analysis<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Santiago<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">An old fisherman down on his luck, Santiago, alone, goes farther out to sea than ever before. He hooks a marlin bigger and stronger than any he has caught previously and engages in an epic struggle as the fish pulls him even farther out to sea. Defying hunger, thirst, exhaustion, and pain, he perseveres and finally reels in the marlin, only to lose it to sharks. Destroyed but not defeated, the old man arrives home with his skiff damaged. Knowing he will go out again, doing what a fisherman must do, he accepts his fate, thus rising above it.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Manolin<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Manolin sees Santiago as his mentor whom he meets at the end of every day to help pack up the equipment and bring him food. Manolin&#39;s parents no longer allow him to fish with Santiago because of the old man&#39;s unfortunate luck. Upon Santiago&#39;s return with the marlin&#39;s skeleton, Manolin vows to restore the old man&#39;s boat and fish with him again, convinced his presence will turn the old man&#39;s luck for the better. As a representative of youth, he guarantees Santiago&#39;s great feat will live on in the future.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Marlin<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">The 18-foot marlin is the old man&#39;s worthy adversary. Although it has been hooked, the marlin shows no sign of defeat; instead it pulls the old man&#39;s skiff for several days and nights, taking control of the situation until exhaustion defeats it. Yet even in death, its skeleton bears witness to the magnificent struggle that took place out on the ocean.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Perico<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Perico, the reader assumes, owns the bodega in Santiago&rsquo;s village. He never appears in the novel, but he serves an important role in the fisherman&rsquo;s life by providing him with newspapers that report the baseball scores. This act establishes him as a kind man who helps the aging Santiago.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Martin<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Like Perico, Martin, a caf&eacute; owner in Santiago&rsquo;s village, does not appear in the story. The reader learns of him through Manolin, who often goes to Martin for Santiago&rsquo;s supper. As the old man says, Martin is a man of frequent kindness who deserves to be repaid.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Summary<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">There is an old fisherman in Cuba,<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">Santiago, who has gone eighty-four days without a catch. He is &quot;thin and gaunt with deep wrinkles in the back of his neck, and his hands had deep-creased scars from handling heavy fish on the cords. But none of these scars were fresh. They were as old as erosions in a fishless desert&quot;. Santiago&#39;s lack of success, though, does not destroy his spirit, as his &quot;cheerful and undefeated&quot; eyes show. He has a single friend, a boy named<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">Manolin, who helped him during the first forty days of his dryspell. After forty days, though, Manolin&#39;s parents decided the old man was unlucky and ordered their son to join another boat. Despite this, the boy helps the old man to bring in his empty boat every day.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Santiago tells Manolin that tomorrow he will go out far in the Gulf to fish. The two gather Santiago&#39;s things from his boat and go to the old man&#39;s house. His house is very simple with a bed, table, and chair on a dirt floor. The two friends speak for a while, then Manolin leaves briefly to get food. Santiago falls asleep.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">When Manolin returns, he wakes Santiago. The two eat the food the boy has brought. During the course of the meal, the boy realizes the squalor in which the old man lives and reminds himself to bring the old man a shirt, shoes, a jacket, and a blanket for the coming winter. Manolin and Santiago talk baseball for a while, and the boy then leaves to be woken in the morning by the old man. Santiago sleeps.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Santiago dreams of Africa, where he traveled as a shipmate in his youth. &quot;He lived along that coast now every night and in his dreams, he heard the surf roar and saw the native boats come riding through it. He dreamed of places now and lions on the beach&quot; (24). The old man wakes and retrieves the boy from his house. The two take the old man&#39;s supplies from his shack to his boat and enjoy coffee at an early morning place that serves fisherman. The boy leaves to fetch the sardines for the old man. When he returns, he wishes the old man luck, and Santiago goes out to sea.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Santiago leaves shore early in the morning, before sunrise. &quot;He knew he was going far out and he left the smell of the land behind and rowed out into the clean early morning smell of the ocean&quot;. Soon, Santiago rows over the &quot;great well,&quot; a sudden drop of seven hundred fathoms where shrimp, bait fish, and squid congregate. Moving along, Santiago spots flying fish and birds, expressing great sympathy for the latter. As he queries, &quot;Why did they make birds so delicate and fine as those sea swallows when the ocean can be so cruel? She is kind and very beautiful. But she can be so cruel....&quot;.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Santiago keeps pressing out, past the great well where he has been recently unsuccessful. Santiago sees a man-of-war bird overhead and notices that the bird has spied something in the water. The old man follows near the bird, and drops his own lines into the area, hoping to capture the fish the bird has seen. There is a large school of dolphin traveling fast, too fast for either the bird or Santiago to capture. Santiago moves on, hoping to catch a stray or perhaps even discover a marlin tracking the school. He catches a small tuna after not too long and then feels a bite on one of his deeper lines.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">The first bite is hard, and the stick to which the line is connected drops sharply. The next tug is more tentative, but Santiago knows exactly what it is. &quot;One hundred fathoms down a marlin was eating the sardines that covered the point and the shank of the hook where the hand-forged hook projected from the head of the small tuna&quot;. Encouraged by a bite at so deep a depth so far out in the Gulf, Santiago reasons that the fish much be very large.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">The marlin nibbles around the hook for some time, refusing to take the bait fully. Santiago speaks aloud, as if to cajole the fish into accepting the bait. He says, &quot;Come on. Make another turn. Just smell them. Aren&#39;t they lovely? Eat them good now and then there is the tuna. Hard and cold and lovely. Don&#39;t be shy fish. Eat them&quot;. After many false bites, the marlin finally takes the tuna and pulls out a great length of line.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Santiago waits a bit for the marlin to swallow the hook and then pulls hard on the line to bring the marlin up to the surface. The fish is strong, though, and does not come up. Instead, he swims away, dragging the old man and his skiff along behind. Santiago wishes he had Manolin with him to help.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">As the sun goes down, the marlin continues on in the same direction, and Santiago loses sight of land altogether. Expressing his resolve, Santiago says, &quot;Fish, ... I&#39;ll stay with you until I am dead&quot; (52). He expresses ambivalence over whether he wants the fish to jump, wanting to end the struggle as quickly as possible but worrying that the hook might slip out of the fish&#39;s mouth. Echoing his former resolve though with less certainty, Santiago says, &quot;Fish, &hellip; I love you and respect you very much. But I will kill you dead before this day ends&quot;.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A small bird land on the boat, and while Santiago is speaking to the bird, the marlin lurches forward and pulls the old man down, cutting his hand. Lowering his hand to water to clean it, Santiago notices that the marlin has slowed down. He decides to eat a tuna he has caught in order to give him strength for his ordeal. As he is cutting the fish, though, his left-hand cramps. &quot;What kind of hand is that,&quot; Santiago says, &quot;Cramp then if you want. Make yourself into a claw. It will do you no good&quot;. The old man eats the tuna, hoping it will renew his strength and help release his hand.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Just then, the marlin comes out of the water quickly and descends into the water again. Santiago is amazed by its size, two feet longer than the skiff. He realizes that the marlin could destroy the boat if he wanted to and says, &quot;... Thank God, they are not as intelligent as we who kill them; although they are more noble and more able&quot;. Santiago says prayers to assuage his worried heart, and settles into the chase once again.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">As the sun sets, Santiago thinks back to triumphs of his past in order to give himself more confidence in the present. He remembers a great arm-wrestling match he had at a tavern in Casablanca. It had lasted a full day and a night, but Santiago, El Campeon (The Champion) as he was known then, eventually won. &quot;He decided that he could beat anyone if he wanted to badly enough and he decided that it was bad for his right hand for fishing&quot;. He tried to wrestle with his left hand but it was a traitor then as it had been now.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Recalling his exhaustion, Santiago decides that he must sleep some if he is to kill the marlin. He cuts up the dolphin he has caught to prevent spoiling, and eats some of it before contriving a way to sleep. Santiago wraps the line around himself and leans against the bow to anchor himself, leaving his left hand on the rope to wake him if the marlin lurches. Soon, the old man is asleep, dreaming of a school of porpoises, his village house, and finally of the lions of his youth on the African beach.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Santiago is awoken by the line rushing furiously through his right hand. The marlin leaps out of the water and it is all the old man can do to hold onto the line, now cutting his hand badly and dragging him down to the bottom of the skiff. Santiago finds his balance, though, and realizes that the marlin has filled the air sacks on his back and cannot go deep to die. The marlin will circle and then the endgame will begin.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">At sunrise, the marlin begins a large circle. Santiago holds the line strongly, pulling it in slowly as the marlin goes round. At the third turn, Santiago sees the fish and is amazed by its size. He readies the harpoon and pulls the line in more. The marlin tries desperately to pull away. Santiago, no longer able to speak for lack of water, thinks, &quot;You are killing me, fish.... But you have a right to. Never have I seen a greater, or more beautiful, or a calmer or more noble thing than you, brother. Come on and kill me. I do not care who kills you&quot; (92). This marlin continues to circle, coming closer and pulling out. At last it is next to the skiff, and Santiago drove his harpoon into the marlin&#39;s chest.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&quot;Then the fish came alive, with his death in him, and rose high out of the water showing all his great length and width and all his power and his beauty&quot; (94). It crashed into the sea, blinding Santiago with a shower of sea spray. With the glimpse of vision, he had, Santiago saw the slain beast laying on its back, crimson blood disseminating into the azure water. Seeing his prize, Santiago says, &quot;I am a tired old man. But I have killed this fish which is my brother and now I must do the slave work&quot;.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Having killed the Marlin, Santiago lashes its body alongside his skiff. He pulls a line through the marlin&#39;s gills and out its mouth, keeping its head near the bow. &quot;I want to see him, he thought, and to touch and to feel him. He is my fortune, he thought&quot; (95). Having secured the marlin to the skiff, Santiago draws the sail and lets the trade wind push him toward the southwest.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">An hour after Santiago killed the marlin, a mako shark appears. It had followed the trail of blood the slain marlin left in its wake. As the shark approaches the boat, Santiago prepares his harpoon, hoping to kill the shark before it tears apart the marlin. &quot;The shark&#39;s head was out of water and his back was coming out and the old man could hear the noise of skin and flesh ripping on the big fish when he rammed the harpoon down onto the shark&#39;s head&quot;. The dead shark slowly sinks into the deep ocean water.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Two hours later, two shovel-nosed sharks arrive at the skiff. After losing his harpoon to the mako, Santiago fastens his knife to the end of the oar and now wields this against the sharks. He kills the first shark easily, but while he does this, the other shark is ripping at the marlin underneath the boat. Santiago lets go of the sheet to swing broadside and reveal the shark underneath. After some struggle, he kills this shark as well.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Santiago apologizes to the fish for the mutilation he has suffered. He admits, &quot;I shouldn&#39;t have gone out so far, fish.... Neither for you nor for me. I am sorry, fish&quot;. Tired and losing hope, Santiago sits and waits for the next attacker, a single shovel-nosed shark. The old man succeeds in killing the fish but breaks his knife blade in the process.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">More sharks appear at sunset and Santiago only has a club with which to beat them away. He does not kill the sharks, but damages them enough to prevent their return. Santiago then looks forward to nightfall as he will be able to see the lights of Havana, guiding him back to land. He regrets not having cleaved off the marlin&#39;s sword to use as a weapon when he had the knife and apologizes again to the fish. At around ten o&#39;clock, he sees the light of Havana and steers toward it.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">In the night, the sharks return. &quot;By midnight he fought and this time he knew the fight was useless. They came in a pack and he could only see the lines in the water their fins made and their phosphorescence as they threw themselves on the fish&quot;. He clubs desperately at the fish, but the club was soon taken away by a shark. Santiago grabs the tiller and attacks the sharks until the tiller breaks. &quot;That was the last shark of the pack that came. There was nothing more for them to eat&quot;.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Santiago &quot;sailed lightly now and he had no thoughts nor any feelings of any kind&quot;. He concentrates purely on steering homewards and ignores the sharks that came to gnaw on the marlin&#39;s bones. When he arrives at the harbor, everyone is asleep. Santiago steps out of the boat, carrying the mast back to his shack. &quot;He started to climb again and at the top he fell and lay for some time with the mast across his shoulder. He tried to get up. But it was too difficult and he sat there with the mast on his shoulder and looked at the road&quot;. When he finally arose, he had to sit five times before reaching home. Arriving at his shack, Santiago collapsed on his bed and fell asleep.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Manolin arrives at the shack while Santiago is still asleep. The boy leaves quickly to get some coffee for Santiago, crying on his way to the Terrace. Manolin sees fisherman gathered around the skiff, measuring the marlin at eighteen feet long. When Manolin returns to the shack, Santiago is awake. The two speak for a while, and Manolin says, &quot;Now we will fish together again,&quot; To which Santiago replies, &quot;No. I am not lucky. I am not lucky anymore&quot;. Manolin objects, &quot;The hell with luck.... I&rsquo;ll bring the luck with me&quot;. Santiago acquiesces and Manolin leaves to fetch food and a shirt.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">That afternoon there are tourists on the Terrace. A female tourist sees the skeleton of the marlin moving in the tide. Not recognizing the skeleton, she asks the waiter what it is. He responds in broken English &quot;eshark,&quot; thinking she wants to know what happened. She comments to her partner that she didn&#39;t know sharks had such beautiful tails. Meanwhile, back in Santiago&#39;s shack, the old man &quot;was still sleeping on his face and the boy was sitting by him watching him. The old man was dreaming about lions&quot;.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Metaphors<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">life: sea.<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Santiago often compares the sea to a woman. Like a woman, from Santiago&#39;s perspective, the sea is moody, forgiving and uforgiving, cold and warm.... Much like life, the sea both gives and takes, good weather and stormy weather....<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Themes<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Hemingway uses this seemingly simplistic plot to convey two important<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><strong><span style=\"font-family:'Times New Roman';\">themes<\/span><\/strong><span style=\"font-family:'Times New Roman';\">: there&#39;s dignity in determination and religion can connect people to the cyclical nature of life.&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Catholicism is used in different ways to point to the cyclical nature of life. When the fishing line cuts Santiago&#39;s palms it is reminiscent of Christ&#39;s stigmata.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Santiago also promises God that he&#39;ll say 100 &#39;Hail Marys&#39; and 100 &#39;Our Fathers&#39; in the hopes that God will help him endure and survive the struggle with this fish in spite of his pain and exhaustion.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Santiago&#39;s success with the marlin gives him hope for his future. He will no longer be the failing fisherman but the victor of his village. His religion helps him experience a sense of renewal.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">UNN PUTME Example<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">The Novel &#39;The Old Man and the Sea&#39; can be described as____.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. a satire B. an epic C. an allegory D. a love story<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(B. an epic, 2014\/2015, no 9)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">JAMB Examples<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">1. In the novel, the type of fish caught by Santiago after days of effort is&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. shark B. iris C. marlin D. geisha<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(C. marlin)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">2. The novel demonstrates the&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. attempt to catch fish B. desire to understand life C. influence of the sea on man D. struggle of man against-defeat<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(D. struggle of man against-defeat)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">3. In the novel, the attitude of the old man toward nature is quite&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. cautious and sceptical B. hostile and callous C. careless and indifferent D. warm and friendly.&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(A. cautious and sceptical)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">4. Santiago&#39;s second dream occurs&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. the night before his fishing expedition B. in his house C. at the end of the book D. when he sleeps on the boat for a few hours.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(D. when he sleeps on the boat for a few hours).<\/span><\/em><\/p>\r\n<\/body>\r\n\r\n<\/html>",
  "chapIndex": "SUMMARY OF  THE OLD MAN AND THE SEA"
}