{
  "text": "<html>\r\n    <head>\r\n    <style>\r\n        .unselectable {\r\n          -webkit-user-select: none;\r\n          -webkit-touch-callout: none;\r\n          -moz-user-select: none;\r\n          -ms-user-select: none;\r\n          user-select: none;\r\n        }\r\n      <\/style>\r\n      <\/head>\r\n\r\n<body class=\"unselectable\">\r\n \r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">PURPLE HIBISCUS<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">By Chimamanda Adichie<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><u><span style=\"font-family:'Times New Roman';\">Plot introduction<\/span><\/u><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">Purple Hibiscus<\/span><\/em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">is set in<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">postcolonial<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">Nigeria, a country beset by political instability and economic difficulties. The central character is Kambili Achike, fifteen for much of the period covered by the book, a member of a wealthy family dominated by her devoutly<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">Catholic<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">father, Eugene. Eugene is both a religious<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">zealot<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">and a violent figure in the Achike household, subjecting his wife Beatrice, Kambili herself, and her brother Jaja to beatings and psychological cruelty.<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">The story is told through Kambili&rsquo;s eyes and is essentially about the disintegration of her family unit and her struggle to grow to maturity. A key period is the time Kambili and her brother spend at the house of her father&rsquo;s sister, Ifeoma, and her three children. This household offers a marked contrast to what Kambili and Jaja are used to. Though Catholic, it practices a completely different form of Catholicism, making for a happy, liberal place that encourages its members to speak their minds. In this nurturing environment both Kambili and Jaja become more open, more able to voice their own opinions. Importantly, also, while at Aunty Ifeoma&rsquo;s, Kambili falls in love with a young priest, Father Amadi, which awakens her sense of her own sexuality. Ultimately, a critical mass is reached in terms of the lives of Kambili, Jaja and the existence of their family as it once was. Unable to cope with Eugene&rsquo;s continual violence, Beatrice poisons him. Jaja takes the blame for the crime and ends up in prison. In the meantime, Aunty Ifeoma and her family go to America to live after she is unfairly dismissed from her job as lecturer at the University of Nigeria. The novel ends almost three years after these events, on a cautiously optimistic note. Kambili has become a young woman of eighteen, more confident than before, while her brother Jaja is about to be released from prison, hardened but not broken by his experience there. Their mother, Beatrice, having deteriorated psychologically to a great degree, shows small signs of improvement. In essence, a better future is possible for them all, though exactly what it might involve is an open question.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Purple Hibiscus is an exquisite novel about the emotional turmoil of adolescence, the powerful bonds of family, and the bright promise of freedom.It is a book<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;about the blurred lines between childhood and adulthood; between love and hatred, between the old gods and the new.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><u><span style=\"font-family:'Times New Roman';\">Characters<\/span><\/u><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Kambili<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Kambili Achike is the central character in Purple Hibiscus and also the narrator of the story. She is an intelligent, observant, religious young woman, aged fifteen for much of the novel. At the same time, Kambili is shy and inhibited, at least until she has spent an extended amount of time away from her family home at the house of Aunty Ifeoma and her family. Kambili is the younger of Eugene and Beatrice Achike&rsquo;s two children. She does not like the living environment under her father after she gets used to the freedom of Nsukka. She was a very quiet girl at the beginning of the novel but afer staying with her Aunty Ifeoma, she builds up her courage and opens up much more towards other people.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Chukwuka &ldquo;Jaja&rdquo; Achike<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Chukwuka Achike, nicknamed &ldquo;Jaja&rdquo; by his family, is an intelligent young man about two years his sister&rsquo;s senior. For most of the novel, in the same way as the rest of his family, he is dominated by his father, although ultimately, he displays more overt defiance than them, especially by not going to communion on<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">Palm Sunday<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">and causing a massive family scene as a consequence. He takes the blame for his mother&rsquo;s crime and spends almost three years in prison before obtaining an<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">amnesty. Through this time, his personality has hardened but not been broken.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Eugene (Papa)<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Eugene Achike is Kambili&rsquo;s father. He is a wealthy and ostentatious businessman who is also a very strict Catholic who dominates his family for much of the novel by imposing a harsh religious regime in the family home. Indeed, for much of the novel he controls almost every aspect of his family&rsquo;s life, including imposing a schedule upon the lives of Kambili and her brother Jaja so that every minute of the day is mapped out for them. While on the one hand Eugene is an important man in his society and donates considerable amounts of money to needy individuals and worthy causes, he is prone to outbreaks of violence within the family house, subjecting his wife Beatrice and the two children to severe physical punishment.Eugene has two different masks to face public and private. He might be a kind hero in the public, however, at home he is quite the opposite.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Beatrice (Mama)<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Beatrice, mother and wife in the Achike family, is a quiet, maternal figure for much of the work, presenting a softer, warmer presence in the home in contrast to the often tyrannical presence of Eugene. Passive is another term applicable to her, at least for a great deal of the book. During the course of the novel, Beatrice suffers two miscarriages after severe beatings from Eugene. She polishes the figurines on the Etag&eacute;r&egrave; after every beating. It is insinuated that she stays with Eugene partially out of gratitude for his unwillingness to marry another woman after she could only have two children. Ultimately, however, Beatrice cannot cope with Eugene&rsquo;s behaviour and poisons him. Her son, Jaja, takes the blame for the crime and she is a shattered wreck after this point. At the conclusion of the novel, however, with Jaja&rsquo;s impending release from prison, there are some indications that her condition will improve.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Aunty Ifeoma<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Aunty Ifeoma is Eugene&rsquo;s only sibling, a tall, striking, intelligent woman who works as a lecturer at the University of Nigeria. She is highly capable in many aspects of her life, displaying determination and resourcefulness in bringing up her children without a husband. Though financially struggling, she creates a much happier environment for her children than does her brother Eugene for his family. She was married to Ifediora, who was a professor with her, until his unfortunate death.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Amaka<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Amaka is Ifeoma and Ifediora&rsquo;s only daughter. She is Kambili&rsquo;s age, around fifteen, and originally does not like Kambili, believing her to be a snob, and jealous of Kambili&rsquo;s supposedly lavish lifestyle. After a few weeks of getting to know each other, and after Kambili&rsquo;s beating, the two become close friends.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Obiora<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Obiora is the second oldest of Ifeoma and Ifediora&rsquo;s three children, at around age fourteen. He wears glasses, and is very good at maths. He is reserved, yet often speaks up when he feels someone is wrong, as is seen when he contradicts Chiaku.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Chima<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Chima is the youngest of Ifeoma and Ifediora&rsquo;s three children. Not much is known about this character, apart from the fact that he looks up to Obiora.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Father Amadi<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Father Amadi is a young priest in the circle of Aunty Ifeoma and her family. Being youthful, indigenous and well-versed in contemporary life, he could be described as a &ldquo;new generation&rdquo; priest, as opposed to white European priests in the country such as Eugene&rsquo;s pastor, Father Benedict. When Kambili falls in love with Father Amadi, he shows considerable thoughtfulness and honour in the sensitive way he makes it clear to her that, because he is devoted to the church, he will never be able to become her partner. He loves her, yet he dare not start a relationship with her because of his profession. He becomes socially and spiritually attached with some of the boys that he taught football. He is shown to be a little playful as he challenged Kambili to a sprint, this leads to him telling her that she had good legs for running. He also took her to plait her hair which led the hair dresser to tell Kambili that no man takes a young lady to plait her hair unless he likes her.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Papa-Nnukwu<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Papa-Nnukwu is both father and grandfather in the Achike family, being Eugene and Ifeoma&rsquo;s father. He is a kind, loving man rooted in the traditional non-Christian beliefs of his indigenous culture, presenting a marked contrast, in particular, to his son Eugene&rsquo;s adherence to European religion and lifestyle.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Father Benedict<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Father Benedict is St. Agnes&rsquo; white priest. He has been in Enugu for 7 years. Being a strict colonial product, Benedict feels strong resistance to the Igbo language, and prefers to lead his services in Latin and in English. He is a strong supporter of Papa&rsquo;s charity work.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Ade Coker<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Ade Coker is the lead editor of Papa&rsquo;s newspaper, The Standard. He is also the author of rebellious works, which ultimately leads to his death. He speaks out commonly against the current Nigerian government. He was killed by a package bomb in his house.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Kevin<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Kevin is Papa Eugene&rsquo;s personal driver in Enugu.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Other minor characters in the book include Aunty Chioma, Obioma, Celestine, Chidifu and others<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman'; display:none;\">Top of Form<\/span><span style=\"font-family:'Times New Roman'; display:none;\">Bottom of Form<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Summary<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Purple Hibiscus<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">takes place in Enugu, a city in post-colonial Nigeria, and is narrated by the main character,<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">Kambili Achike. Kambili lives with her older brother Jaja (Chukwuku Achike), a teenager who, like his sister, excels at school but is withdrawn and sullen. Kambili&rsquo;s father, Papa (Eugene Achike) is a strict authoritarian whose strict adherence to Catholicism overshadows his paternal love. He punishes his wife, Mama (Beatrice Achike), and his children when they fail to live up to his impossibly high standards.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">The novel begins on Palm Sunday. Jaja has refused to go to church and receive communion. Because Jaja has no reasonable excuse for missing church, Papa throws his missal at his son. The book hits a shelf containing his wife&rsquo;s beloved figurines. This defiant act and resulting violence marks the beginning of the end of the Achike family. Kambili then explains the events leading up to Palm Sunday, detailing the seeds of rebellion that are planted in the children&rsquo;s minds by their liberal<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">Aunty Ifeoma, Papa&rsquo;s sister.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Papa is a prominent figure in Enugu. He owns several factories and publishes the pro-democracy newspaper the Standard. He is praised by his priest,<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">Father Benedict, and his editor,<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">Ade Coker, for his many good works. Papa generously donates to his parish and his children&rsquo;s schools. His newspaper publishes articles critical of the rampant government corruption. Since the Standard tells the truth, the staff is under constant pressure from the Head of State, the military leader who assumes the presidency following a coup. When Ade Coker is arrested, Papa&rsquo;s bravery and position in the community help to free him.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Kambili is a quiet child. When she tries to speak, she often stutters or has a coughing fit. The rigid life that is shaped by her father renders her mute. Each day, she follows a schedule that allots only time to study, eat, sleep, pray and sit with her family. Kambili is a good student, rising to the top of her class. The girls at school assume she is a snob because she doesn&rsquo;t socialize and always runs straight to her father&rsquo;s car after class. When Kambili places second on term, Papa tells her she must excel because God expects more from her. Kambili is not a snob; she is motivated by fear, unable to create her own identity.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">At Christmas, the family returns to the Papa&rsquo;s ancestral town, Abba. The family supervises a feast that feeds the entire umunna &ndash; extended family. Papa is celebrated for his generosity in Abba as well. However, he does not allow his children to visit with his own father,<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">Papa-Nnukwu, for more than fifteen minutes each Christmas. Papa calls his father a &ldquo;heathen&rdquo; because he still follows the religious traditions of his people, the Igbo. When Aunty Ifeoma comes to visit from her University town of Nsukka, she argues with Papa about his mistreatment of their father. But Papa is firm. He will only acknowledge and support his father if he converts. Aunty Ifeoma invites Kambili and Jaja to visit so they can go on a pilgrimage to Aokpe, site of a miraculous apparition of the Virgin Mary. Papa begrudgingly agrees.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Nsukka is a different world. The University is beset by fuel shortages, pay stoppages, strikes at medical clinics, blackouts, and rising food prices. The widowed Aunty Ifeoma successfully raises her three children,<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">Amaka,<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">Obiora<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">and<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">Chima, with what little she has. But her family is a happy one. Unlike Papa, Aunty Ifeoma encourages her children to question authority, raising them with faith but also intellectual curiosity. Amaka and Kambili are very different girls. Amaka, like Kambili&rsquo;s classmates, assumes her cousin is a privileged snob since she does not know how to contribute to household chores. Kambili retreats into silence even in Nsukka. Jaja, on the other hand, blossoms. He follows the example of his younger cousin Obiora, concocting his own rite of initiation out of helping his family, tending a garden and killing a chicken. Kambili begins to open up when she meets<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">Father Amadi. A Nigerian-born priest, Father Amadi is gentle and supportive. He encourages Kambili to speak her mind. Through Father Amadi, Kambili learns that it is possible to think for oneself and yet still be devout. She even begins speaking above a whisper to Amaka, and they become closer.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Kambili and Jaja learn to be more accepting in Nsukka. When he falls ill, Aunty Ifeoma brings Papa-Nnukwu to her flat. Kambili and Jaja decide not to tell Papa that they are sharing a home with a &ldquo;heathen.&rdquo; Kambili witnesses her grandfather&rsquo;s morning ritual of innocence, where he offers thanks to his gods and proclaims his good deeds. She sees the beauty in this ritual and begins to understand that the difference between herself and Papa-Nnukwu is not so great. When her father finds out that Kambili and Jaja have spent time with their grandfather, he brings them home. Amaka gives her a painting of Papa-Nnukwu to take back to Enugu. Papa punishes his children by pouring hot water over their feet for &ldquo;walking into sin.&rdquo;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Pressure mounts on Papa. Soldiers arrest Ade Coker again and torture him, and they raid the offices of the Standard and shut down his factories for health code violations. Shortly thereafter, the government murders Ade Coker. Tensions rise in the home too. Kambili and Jaja take comfort in the painting of Papa-Nnukwu. Papa catches them, however, and he beats Kambili so severely that she ends up in critical condition in the hospital. When she is well enough to be released, she goes to Nsukka instead of home. Her crush on Father Amadi intensifies and she begins to break out of her shell more, learning how to laugh and to join in the Igbo songs. But Aunty Ifeoma gets fired from the University and decides to go to America to teach. Kambili is floored. She is not sure what she will do without the refuge provided by her aunt and cousins. Amaka does not want to go to America either because her roots are in Nigeria.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Mama comes to Nsukka, limping out of a cab. Papa has beaten her again, causing another miscarriage. Though both Kambili and Jaja have seen this happen before, this time it is different. Aunty Ifeoma urges her not to return to Enugu. But she takes her children back with her. The following week is Palm Sunday, when Jaja refuses to go to church. In the week between Palm Sunday and Easter, Jaja grows increasingly defiant. He finally demands that he and Kambili spend Easter with their cousins. Weakened by what the children believe is stress, he allows them to go to Nsukka. A few days later, Mama calls. Papa has died. When Mama left Nsukka, she began poisoning her husband&rsquo;s tea. Jaja takes the blame for the crime and goes to prison.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">The final chapter of the book takes place nearly three years later. Kambili and Mama visit a hardened Jaja in prison. He has faced severe punishments and miserable conditions over the course of his term. However, with the leadership in Nigeria now changing again, their lawyers are confident that Jaja will be released. Though Jaja has learned to not expect a favorable outcome, Kambili is overjoyed. She dreams that she will take Jaja to America to visit Aunty Ifeoma, together they will plant orange trees in Abba, and purple hibiscuses will bloom again.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">UNN PUTME Example<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Questions below are based on Chimamanda Adichie&#39;s Purple Hibiscus<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">1. The subject matter of the novel is___.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. domestic violence B. religious zeal C. child abuse D. marital infidelity<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(B. religious zeal, 2015\/2016, no 6)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">2. &ldquo;God knows best. God works in mysterious ways.&rdquo; Who made the statement and to whom?<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. Fattier Amadi\/Kamibili B. Aunty Ifeoma\/Kambili C. Kambili\/Jaja D. Obiora\/Mama<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(C. Kambili\/Jaja, 2015\/2016, no 7)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">3. Which part of the South-Eastern Nigeria did Kambili and Jaja visit&#39;?<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. Aba B. Oweni C. Nsukka D. Onitsha<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(C. Nsukka, 2015\/2016, no 8)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">4. The novel started with____.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. an oxymoron B. a rhetorical question C. a suspense D. a confusion<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(C. a suspense, 2015\/2016, no 9)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">JAMB Examples<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">1. In the novel, one of the changes introduced into St. Agnes&rsquo; church by Father is that<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. there must be fasting every month B. the Credo must be recited in lgbo C. the Kyrie must be rendered only in Latin D. everyone must take holy communion<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(B. the Credo must be recited in lgbo)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">2. Eugene Achike in the novel is portrayed as&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. a soft and gentle husband B. an uncompromising traditionalist C. a fanatical Catholic adherent D. a tough retired soldier.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(C. a fanatical Catholic adherent)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">3. In the Achike family, the character who is central to the theme is&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. Kambili B. Mama C. Sisi D. Jaja<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(A. Kambili)<\/span><\/em><\/p>\r\n<\/body>\r\n\r\n<\/html>",
  "chapIndex": "SUMMARY OF PURPLE HIBISCUS"
}