{
  "text": "<html>\r\n    <head>\r\n    <style>\r\n        .unselectable {\r\n          -webkit-user-select: none;\r\n          -webkit-touch-callout: none;\r\n          -moz-user-select: none;\r\n          -ms-user-select: none;\r\n          user-select: none;\r\n        }\r\n      <\/style>\r\n      <\/head>\r\n\r\n<body class=\"unselectable\">\r\n \r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">THE SUCCESORS<\/span><\/strong><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">By<\/span><\/strong><strong><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/strong><strong><em><span style=\"font-family:'Times New Roman';\">Jerry Agada<\/span><\/em><\/strong><br><span style=\"font-family:'Times New Roman';\">The Successors is an x-tray of two-family generations: The Atsens and the Amehs. Starting in January 1967 with the two friends and colleagues, Okoh Ameh and Terkura Atsen, both of whom were employees of the Provincial Hotel, Makurdi, they both were young friends, and their friendship too was young &ndash; less than six months they met. The enviable industrialist that Terkura later grew to be had been foreshadowed from the outset, with his idealistically ambitious nature. The youthful Terkura always dreamed of a future when he would become a huge force to reckon with in all ramifications, particularly in business. Ameh on the other hand didn&rsquo;t feel equally ambitious. He hadn&rsquo;t been as equally keen about such wondrous future as Terkura was foreseeing it. In fact, he had seen Terkura&rsquo;s longing as impractical. Ameh was simply optimistic that he would soon get a promotion at work, and with that promotion, he believed he would only need to apply to do some courses in that hospitality career, after which he would be able to attain greater heights, still in the hotel business. Terkura saw his present job of a porter at the Provincial hotel as a stepping stone to greater heights. Though without advanced education (university), Terkura saw that not as a barrier to reaching his set goals, although he had been scrimping and saving with the strong determination to return to school the coming year. Of great inspiration was Mr Eze to Terkura&rsquo;s dream. Mr Eze was one of the regular guests at the Provincial Hotel where Terkura was working, but the professional outlook and business-like composure of the man endeared him to the young Terkura. He became so attached to the man that in less than six months, he had learnt a lot from him. Terkura was so shocked when, in July 1967, the news broke that Mr Eze had been killed in a riot in Kano. The event of the man&rsquo;s death was predicated upon the pre-civil war (1967) crisis in Nigeria. In fact, Terkura&rsquo;s high opinion of his late mentor, Mr Eze, influenced his judgement of all Ibos, since Mr Eze, being an Ibo man was well travelled and very educated,<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">While Terkura had become tired of the restrictive influence the hotel job was having on him and his dreams, and he was thinking of quitting, Ameh seemed to be enjoying the work the more, still being propelled by his strong conviction that he was going to make a career out of the hotel and service industry. Besides, while marriage was part of Ameh&rsquo;s immediate plans, Terkura never had such even in his later plans. Even when his mother suggested that they should start the marriage preparation between him (Terkura) and one Torkwase, Terkura politely turned down the offer, saying marriage would be a huge distraction to him and his dreams at that moment. When Terkura told his catechist father, Mathew Atsen, that he would be quitting his job at the end of the year, to enable him return to school, the father was very proud of him, for being very ambitious, though the man would have loved the boy to be a priest, because he said he had high sense for right and wrong.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Ameh later travelled to his hometown, Ukporo to get married to Maria, a girl his parents had got for him. After the marriage rituals and ceremonies, Ameh returned to Makurdi with his new bride, where both of them had to share his one-room apartment. Aside from the inconvenience of the compact single room, the compound was full of children and always noisy, and the environment, very marshy, was a breeding ground for mosquitoes. Shortly after their marriage, their first child, a male arrived, and he was named Ifenne. After the baby&rsquo;s arrival, Ameh and his family relocated away from the flood-prone and mosquit0-infested areas to a better accommodation. While Ameh was moving on with his married life, Terkura was industriously in pursuit of knowledge, from Provincial College, Yandev for Higher School Certificate to The Ahmadu Bello University, in Zaria. Just that same time, Terkura&rsquo;s younger brother, Terngu, got married. The first part of the book ended here.<\/span><br><span style=\"font-family:'Times New Roman';\">In the second part of the book, starting in 1979, Terkura Atsen had become a grown up and shrewd entrepreneur, who had built from scratch. Yet, he wasn&rsquo;t a full-fledged business man, for he was still struggling to get his footing in the badly run economy of the country, filled with cruel, greedy, exploitative people, like Chief Ofega who had bluntly refused to pay Terkura the balance of the contract he had executed on his &ndash; Chief Ofega&rsquo;s &ndash; behalf. But for some rare courage which empowered Terkura to issue some threat to the adamant chief &ndash; obviously the rich are allergic to threat! &ndash; Terkura might not have got the unnecessarily withheld four hundred and eighteen thousand Naira balance, which later salvaged his dwindling business.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">In the third part of the book, set in 1985, actions shifted back to Okoh Ameh, who had now become the father of seven children: Ifenne, Agbo, Veronica, Innocent, Emmanuel, Ada, and Ene. However, his family had become messed up, and he had been largely responsible for the family&rsquo;s misfortune. His life also had been in shambles! He had just caught his sixteen-year-old son, Ifenne smoking hemp. He had abandoned his wife and their seven children, in the weak hands of the wife, and the family had helplessly fallen apart, while he frittered away his slim income on alcoholic addiction and womanizing. What had driven him into such life? Despite his obvious inadequacies and irresponsible, he yet would unfairly accuse the wife, heaping the blame on her for the dismal condition of the family. In his conspicuous absence, the wife had stretched herself to stand in for him, so as to avoid the total collapse of the family. Ameh would prefer to spend his time, money, and affection outside the home with mistresses and on drinking wildly.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">The complacency that had ruled his life from his youthful days had been partly responsible for his present predicament. After his secondary education, he had joined the Provincial Hotel, where he once worked with Terkura. After many years in service, he was promoted from an assistant supervisor to senior supervisor. After that single promotion, he had stagnated at that rank. As his family expanded without a commensurate expansion or increase in his income, be became worried and disillusioned, especially when he saw how far his colleagues, such as Terkura had gone in life. He felt defeated and considering himself a failure, he took to drinking, as a gullible means of consoling himself. Expectedly, drinking led him into womanizing. Cumulatively, his consistent alcohol consumption, his countless flings with many different mistresses, and the emotional torture of seeing his family destroyed, all fatally depressed him and had a heavy toll on his health. His health deteriorated fast, and he later died.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">The death of Ameh, Ifenne&rsquo;s father seemed to have made Ifenne sober. He prematurely took up the challenge of being the head of his family, as he began ferreting for jobs to do, to ensure he supplemented the little his mother had always brought home from his seamstress job. After his secondary school, Ifenne took up a bus conductor job, and he was fortunate to have a very disciplined and kind-hearted boss like Oga Olu. Oga Olu later had a great impact in the life of Ifenne, with his valuable, wise advice, and total tutelage. From the wayward cannabis-smoking boy, Ifenne gradually grew into a more go-getting young man. David Atsen was Ifenne&rsquo;s age mate, and was the son of Terkura&rsquo;s brother, Terngu. So, he was Terkura Atsen&rsquo;s nephew. David was an undergraduate student of Accounting at the University of Jos. However, despite his age, twenty, he was having an illicit affair with a married woman!<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">The fourth part of the book was set in the year 1993. Ifenne, now twenty-four, with three buses to his name on the road and other petty business, he still yearned to acquire a university education. So, seven years after his secondary education, he eventually gained admission to study Political Science. It was at the university that Ifenne met Mwuese. Mwuese was the daughter of Torkwase, the woman who Terkura was supposed to be married to in his youth. The two hit it off, and soon their union grew into a relationship, which after some years hit the rock (failed). Ifenne and Mwuese later met each other three years after graduation, and after some disagreement and agreement, they rekindled their love.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">In the fifth part of the back, Terkura Atsen died at fifty-one, approximately eight years after Okoh Ameh&rsquo;s death. Before his death however, Terkura had become more than the giant he assertively aspired to be. He built an enduring business empire, and he was very wealthy, in fact wealthier than his state. But he was never married before his death. Terkura Atsen made David Atsen, his nephew (brother&rsquo;s son), the chief beneficiary of his bequest, though there were yet many other of the late Terkura&rsquo;s property that had been willed to be given to other members of his family, all his long time employees, all the institutions he (Terkura) attended, all the four universities in Benue State, etc.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">No sooner had David Atsen acquired the bequest than he began living an extravagant lifestyle. He expended money frivolously on needless travels and embarked on unrestrained spending spree with women. Ifenne and David had met each other. While Ifenne was still struggling to make his agro-allied and his transport businesses grow stronger, David was wildly spending away his large acquired wealth, which his uncle had painstakingly struggled to build. While Ifenne had already successfully settled in marriage with Mwuese, David was yet to, as he still was enjoying the flings with his numerous girls. Because of his lascivious lifestyle, David almost lost Ene Okoh, the only girl he genuinely loved. Ene couldn&rsquo;t condone David&rsquo;s promiscuity. His resolve to try overcome his lecherous addiction, so as to regain Ene&rsquo;s trust and love eventually had a carry-over effect on his total person. His sincere love for Ene changed him to the real man his late uncle and benefactor had wanted him to be. As part of his desire to change, he later joined one of the Elite clubs that his late uncle had belonged to. David encouraged Ifenne to run for the position of the governor in the next election, though Ifenne wouldn&rsquo;t hear of it at first, he eventually yielded. In the end, with the powerful influence of David and other members of the Elite Club, Ifenne Okoh Ameh became the 2nd Executive Governor of Benue State<\/span><br><span style=\"font-family:'Times New Roman';\">While x-traying the lives and times of the two family generations of the Atsens and the Amehs, the story simultaneously looks at the challenges of succession in the society, business and politics.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">UNN PUTME QUESTION<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Question 11 is based on Chukwuemeka Ike&#39;s The Potter&#39;s Wheel<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">11. If you have not beheld your chi in his stark nakedness, he prepared to do so as soon as you set foot in that man&rsquo;s house.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">From the excerpt above, whose house was being referred to?<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. Mazi Nwokike<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">B. Teacher Zacchaeus<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">C. Mazi Okeke<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">D. Mazi Laza<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(Teacher Zacchaeus)<\/span><\/em><\/p>\r\n<\/body>\r\n\r\n<\/html>",
  "chapIndex": "SUMMARY OF THE SUCCESORS "
}