{
  "text": "<html>\r\n    <head>\r\n    <style>\r\n        .unselectable {\r\n          -webkit-user-select: none;\r\n          -webkit-touch-callout: none;\r\n          -moz-user-select: none;\r\n          -ms-user-select: none;\r\n          user-select: none;\r\n        }\r\n      <\/style>\r\n      <\/head>\r\n\r\n<body class=\"unselectable\">\r\n \r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">WOMEN OF OWU<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">By Femi Osofisan<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">About the book<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">Women<\/span><\/em><strong><em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/em><\/strong><em><span style=\"font-family:'Times New Roman';\">of<\/span><\/em><strong><em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/em><\/strong><em><span style=\"font-family:'Times New Roman';\">Owu<\/span><\/em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">is a 2006 book written by<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">Femi Osofisan<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">and published through University Press PLC.<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">Adapted from<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">Euripides&#39;<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><em><span style=\"font-family:'Times New Roman';\">The Trojan Women<\/span><\/em><span style=\"font-family:'Times New Roman';\">, the book uses the combination of choruses, songs and dance to depict the history of the people of<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">Owu kingdom<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">after a combined military force of<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">Ife,<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">Oyo<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">and<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">Ijebu<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">invaded the city of Owu for seven years killing all of its male inhabitants and children.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">Women of Owu<\/span><\/em><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">focuses on the aftermath of a 19th-century war-torn Owu Kingdom. It reflects on the pains, depression and agony of the survivors who were only women after the killing of all males in the kingdom by the combined forces of Ife, Oyo and Ijebu.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><u><span style=\"font-family:'Times New Roman';\">Characters<\/span><\/u><\/strong><br><span style=\"font-family:'Times New Roman';\">(1)&nbsp;<\/span><strong><span style=\"font-family:'Times New Roman';\">Erelu<\/span><\/strong><span style=\"font-family:'Times New Roman';\">, though, intelligent and emotional. In her deep emotions, she cursed the allied forces and predicted that they won&#39;t return home peacefully. Erelu is fearless and defiant even in the midst of defeat. She is a loving mother. Erelu likes to shift blames, instead of blaming herself for nursing her child Djumo to manhood and maturity She rather blamed the woman they captured and separated her from the real husband and gave Dejumo to marry. She is the wife of Oba Akinjobi, the reigning Olowu of Owu Iponle.<\/span><br><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">(2)&nbsp;<\/span><strong><span style=\"font-family:'Times New Roman';\">Gesinde<\/span><\/strong><span style=\"font-family:'Times New Roman';\">&nbsp;is thorough in his information. We see Gesinde as a cool-headed soldier who eschews violence and bitterness in the pursuit of his vocation. We can appreciate his good nature character when he permits the women to spend a brief time with Erelu in her soil before joining the Caravan. We can now appreciate the obiquitous character of Gesinde, his humility, humane desposition, dignity and intelligence as a soldier and devotion to duty<\/span><br><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">(3)&nbsp;<\/span><strong><span style=\"font-family:'Times New Roman';\">The women of Owu<\/span><\/strong><span style=\"font-family:'Times New Roman';\">&nbsp;at first act as information officers. They give the details of the ruins as they discuss with their ancestral god, Anlugbua. The women in most cases act as advisers. They advise the Anlugbua who they mistake for a strange old man to flee the scene, else the soldiers will slay him because they do not spare males whether young or old. They are mourners who constantly lament the ruin of their city and ill-motive of freedom the allied forces give. The women are undaunted; they attacked even their ancestral gods and goddesses. They have sharp retentive memory; in a flashback they recalled the seven years siege and their ordeals.<\/span><br><span style=\"font-family:'Times New Roman';\">(4)&nbsp;<\/span><strong><span style=\"font-family:'Times New Roman';\">Anlugbua<\/span><\/strong><span style=\"font-family:'Times New Roman';\">&nbsp;is the ancestral god of Owu and the guardian of their destiny. He appeared after the destruction of Owu by the allied forces, he met the women on their way. He is the<\/span><strong><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/strong><span style=\"font-family:'Times New Roman';\">Former Owu war leader, son of Oba Asunkungbade, ancestral founder of<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">Owu Ipole, now deified as Orisa.<\/span><br><span style=\"font-family:'Times New Roman';\">(5)&nbsp;<\/span><strong><span style=\"font-family:'Times New Roman';\">Lawumi<\/span><\/strong><span style=\"font-family:'Times New Roman';\">: Mother of Oba Asunkungbade, now also deified.<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><br><span style=\"font-family:'Times New Roman';\">(6)&nbsp;<\/span><strong><span style=\"font-family:'Times New Roman';\">Gesinde<\/span><\/strong><span style=\"font-family:'Times New Roman';\">:<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;Ijebu soldier, herald and staff officer of the Allied Army.<\/span><br><span style=\"font-family:'Times New Roman';\">(7)&nbsp;<\/span><strong><span style=\"font-family:'Times New Roman';\">Orisaye<\/span><\/strong><span style=\"font-family:'Times New Roman';\">: Half-mad daughter of Erelu, votary of the god Obatala.<\/span><br><span style=\"font-family:'Times New Roman';\">(8)&nbsp;<\/span><strong><span style=\"font-family:'Times New Roman';\">Adumaadan<\/span><\/strong><span style=\"font-family:'Times New Roman';\">: Widow of Lisabi, grandson of Erelu.<\/span><br><span style=\"font-family:'Times New Roman';\">(9)&nbsp;<\/span><strong><span style=\"font-family:'Times New Roman';\">Okunade<\/span><\/strong><span style=\"font-family:'Times New Roman';\">: The MAYE, Ife war leader, General of the Allied Forces.<\/span><br><span style=\"font-family:'Times New Roman';\">(10)&nbsp;<\/span><strong><span style=\"font-family:'Times New Roman';\">Iyunloye<\/span><\/strong><span style=\"font-family:'Times New Roman';\">: Erring wife of the Maye.<\/span><br><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Scene<\/span><\/strong><strong><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/strong><strong><span style=\"font-family:'Times New Roman';\">by Scene Summary<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><u><span style=\"font-family:'Times New Roman';\">Scene 1<\/span><\/u><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">The play opens with the sad event of the war that left the Owu City in complete ruin. Two women sent to fetch water met with an old man who asked to know what city it is that lies in utter ruins, shouldering. The women in response gave the account of the devastating war and the brutality the allied forces from Ife, Ijebu and the mercenary soldiers from Ibadan unleashed on the city; how they destroyed every male, both young and old, sparing only the beautiful women and those of the royal line, to keep as booty, especially for the generals. They feared for the old man and advised him to run for dear life before the soldiers would sight him and waste him as they did to other men of the city.<\/span><br><span style=\"font-family:'Times New Roman';\">They were shocked when they discovered that the old man is Anlugbua, their ancestral god who also is one of the founders of the city. The women at this revelation raised alarmed and later expressed their disappointment at<\/span><br><span style=\"font-family:'Times New Roman';\">Anlugbua&rsquo;s late coming; for they believed if he had come, as they expected any god would to defend his worshipers, the city would had been spared. But Anlugbua told them that the oath he took many years ago when he was departing prevented him from coming to their aid unless either the priests, chiefs or the diviners invoke his spirit as instructed.<\/span><br><span style=\"font-family:'Times New Roman';\">The women, in describing the gory attack, gave detailed account of what was responsible for the people&rsquo;s plight. Okunade, the Maye led the allied forces under the pretext of rescuing the oppressed Owu people from the despot king, Oba Akinjobi; and for seven years his army camped around the city after failed attempt to penetrate and invade it. Okunade, the notable craftsman had abandoned his trade to train as a soldier and in the process rose in ranks to become the Maye, to avenge his favorite wife, Iyunloye, who was taken captive alongside others, by the Owu soldier when they invaded the Apomu Market.<\/span><br><span style=\"font-family:'Times New Roman';\">Owu City was built round with very formidable walls and gate which kept the invaders off. Unfortunately for the people of the city, there arose a drought in the third year of the siege, which brought about untold hardship, hunger, disease and death among the people. In the face of these suffering, the people did not relent in sacrificing to the gods. The famine had been severe that in the fourth year of the siege, the city gate having being shut away from the invaders, they endured till the seventh years when one day the city woke up to see that their allied forces had left after seven years of futile attempts. They did not know that it was a tactics used to deceive them.<\/span><br><span style=\"font-family:'Times New Roman';\">While the city was celebrating the end of the siege, they were shocked seeing their city set ablaze. This forced them to axe down the city gate to escape death. The soldiers who hid in the forest came out at once and unleashed terror on the people. Those who attempted to counter had lesser weapons to fight back as they had only their cutlasses and incantations as against the formidable guns the forces acquired in the course of trading with the Europeans on the coast of Lagos.<\/span><br><span style=\"font-family:'Times New Roman';\">A night prior this attack, Oba Adejobi and some of his chiefs had escaped from the city through some of the secret exit routes. In the process, the sacred places were then desecrated by the allied armies who killed both men and women who ran there for refuge.<\/span><br><span style=\"font-family:'Times New Roman';\">Anlugbua and the women parted, both to nurse their pains: Anlugbua to mourn the loss of a dear city and worshipers; the women the loss of their beloved ones and the bitter experience of slavery.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><u><span style=\"font-family:'Times New Roman';\">Scene 2<\/span><\/u><\/strong><br><span style=\"font-family:'Times New Roman';\">The air is pervaded with the lamentation of the women as they mourn their losses. The marauding allied forces had finally turned the once-flourishing city of Owu Iponle, which they besieged for seven year, into a &lsquo;relic of history.&rsquo;<\/span><br><span style=\"font-family:'Times New Roman';\">Erelu Afin, the queen of Oba Adejobi, sprawled on the ground, mourning. Her eyes already have grown weary of shedding tears but now full of talk as she counted her losses and the fate that is yet to befall her.<\/span><br><span style=\"font-family:'Times New Roman';\">Other women who are as well victims of the war, and who seemed to have accepted their fate, made every attempt to placate her to take courage since the loss is irreversible. They took turn to tell her that they were all witnesses of all the ills that befell her, that the memory of the horrible death of the princes as well as the rape of the princesses stuck still to them. They also reminded her that they too lost things of greater values to the war.<\/span><br><span style=\"font-family:'Times New Roman';\">During the invasion, all the five princes who are sons of Erelu Afin were slaughtered in the full glare of other helpless survivors. The same soldiers also raped the princesses who &lsquo;were engaged already to be married to kings&rsquo;.<\/span><br><span style=\"font-family:'Times New Roman';\">The women in their sorrow cursed the soldiers who wrought the terrible acts in their city while they attempted to go back to their homes. They made a pronouncement that they would be afflicted and would not get back to their motherlands.<\/span><br><span style=\"font-family:'Times New Roman';\">While in their lamentation, the women made reference to The Apomu market which was the supposed cause of their doom. The market was notable for its uncommon merchandise and thus had attracted people from different lands for trading purposes in prized goods such as gold, silk, ivory and slaves. This market had been in contention between the people of Owu Iponle, the Ifes and the Ijebus. Some years before this particular war, the Owu forcefully took control of the market from the Ifes, killing their traders and attacking the Ijebu traders whom they felt were threat to them. The Owu soldiers looted the stalls of the Ijebu traders, killed many of them and sold others as slaves.<\/span><br><span style=\"font-family:'Times New Roman';\">Erelu Afin then observed that the soldiers as they put out the fire and started packing their loot with the readiness to embark on their journey home. So, she called the attention of the women to this. They all realized at this point that it was pointless to contest their fate as each of them would be shared out among the soldier also as booty.<\/span><br><span style=\"font-family:'Times New Roman';\">Then the two women who met Anlugbua arrived with the news. The news of the coming of Anlugbua, their ancestral father was welcome with much delight and they immediately braced up, calling on other women who were hiding to join them to face the soldiers. To them the coming of Anlugbua suggested the intervention of the gods. The women were soon disappointed when they got the news that Anlugbua himself conceded to defeat and had returned to heaven as a helpless victim.<\/span><br><span style=\"font-family:'Times New Roman';\">Hearing this disheartening tale, they then encouraged themselves to be ready for a life in slavery. So, they danced on to the dirge the chorus raised.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><u><span style=\"font-family:'Times New Roman';\">Scene 3<\/span><\/u><\/strong><br><span style=\"font-family:'Times New Roman';\">Lawumi appeared to Anlugbua who still remained at the spot where he appeared to the two women of Owu brooding over the destruction of his beloved city. He made to move away from Lawunmi whom he knew was responsible for the destruction. Lawumi did not deny but persuaded Anlugbua to wait to hear her reason for allowing it. The meeting finally turned into a historical discourse over what was responsible for the fall of the Owu Kingdom.<\/span><br><span style=\"font-family:'Times New Roman';\">Lawumi explained that she incited and edged the allied forces on to perpetuate the destructive war because of Owu Iponle&rsquo;s arrogance against her and Ife which was the origin of the city of Owu. She went into the account of the sins of the Owu in the past and how they started the fire:<\/span><br><span style=\"font-family:'Times New Roman';\">-Owu&rsquo;s early attack on Ife and Ijebu traders at the Apomu Market.<\/span><br><span style=\"font-family:'Times New Roman';\">-Owu Iponle held the belief that they were the superior kingdom among<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;the seven Yoruba kingdoms.<\/span><br><span style=\"font-family:'Times New Roman';\">These were some of the allegations Lawumi leveled against them.:<\/span><br><span style=\"font-family:'Times New Roman';\">-Owu, though founded by Oba Asunkungbade, was founded with the help and blessings of Ife. Asunkungbade was then a priest who married Lawunmi, an Ife princess; and for this Lawunmi&rsquo;s father agreed to crown him king. Thus, Owu Iponle became one of the seven kingdoms of Yoruba. Owu prospered in the course of time and became a very formidable city and was very prosperous. One of the reasons for Owu&rsquo;s prosperity was the slave trade. It was an act that violated the law Sango among l the Yoruba kingdoms. Sango had decreed that no Yoruba should sell other Yoruba into slavery. Thus, Ife attacked Owu at the Apomu Market which served the Owu Kingdom as her slave market. It was the source of Owu Iponle&rsquo;s prosperity. Owu then sent its army against Ife and razed it down, reducing it to dust to retaliate the earlier Ife attack.<\/span><br><span style=\"font-family:'Times New Roman';\">These are the details Lawumi gave for the dreadful attack the allied forces visited on the city of Owu Iponle. She was also determined to punish the allied forces because of their disregards for not sparing those who ran into her groove for refuge and for desecrating the sacred places as well as defiling Orisaye who was Obatala&rsquo;s vestal votary. For these she persuaded Anlugbua to team up with her in meting out the punishment.<\/span><br><span style=\"font-family:'Times New Roman';\">She informed him that Esu, Orisa Oko and Ogun had already promised to lend helping hands too.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><u><span style=\"font-family:'Times New Roman';\">Scene 4<\/span><\/u><\/strong><br><span style=\"font-family:'Times New Roman';\">Gesinde, an Ijebu officer and the herald to the allied forces came just as the women had anticipated to relay the decision of the generals to Erelu Afin. Gesinde had been known to the Owu Kingdom being the one who had served as the go-between the two armies from the day the kingdom was besieged. Seeing him, Erelu knew he had not come with good news. As far as her memory could recall, she cannot point to a particular time he had borne a single good tiding. So, she asked him to relay his order. Gesinde&rsquo;s order was simple: the women should prepare because they would soon be shared out to their &lsquo;future masters&rsquo;. He was furious when a woman asked if the sharing would be &lsquo;separately or together&rsquo;. By this response he confirmed their fear that there would be no preference for none of them no matter the status. He added that he would be taking Orisaye to Balogun Kusa who had requested that she should be added to his harem.<\/span><br><span style=\"font-family:'Times New Roman';\">Balogun Kusa did ask for Orisaye because he realised she was a virgin, having been betrothed to Obatala, the god of purity and creativity, since birth.When she could no longer protest what the generals had decided about her daughter Orisaye,Erelu asked him what their decision is about Adeoti, another daughter of hers. Gesinde hesitated<\/span><br><span style=\"font-family:'Times New Roman';\">at first, finding it her to tell but when he found his tongue said Adeoti had been sent to a place &lsquo;where pain can no longer reach her&rsquo;. Although Erelu could not decipher the truth of her daughter&rsquo;s whereabouts, she knew this officer was hiding something important from her. She further probed what was decided for Kesobo, whose husband, Sakula, died while defending the city, and Iyunloye who was the real cause of the war.As for Kesobo, she was to be be given to Otunba Lekki, the general who killed her husband.Iyunloye&rsquo;s fate would be announced at a later time at the arrival of Maye Okunade, Iyunade&rsquo;s wronged husband. He added that Okunade would soon be with them. Erelu persisted at least she needed to know what had been determined for her. To her utter dismay, it was Balogun Derin who asked that she be allocated to him. She lamented what her fate would be in the house of the man she knew as a dog and a double-dealing liar.<\/span><br><span style=\"font-family:'Times New Roman';\">Having heard all and no mention of their case was hinted, a woman in the chorus inquired what the generals had decided. She was hushed and told that commoners like them would be visited after the fate of the royal line is sorted out. Gesinde then ordered one of the soldiers who were waiting on him to fetch Orisaye whom her new master had asked to be brought to his camp immediately. But he was stopped at the sight of fire and warned the women against any attempt to commit suicide.<\/span><br><span style=\"font-family:'Times New Roman';\">Erelu seeing how Gesinde felt jittery scolded him for being frightened at the sight of Orisaye running around with a torch. She explained that such display was the impact of shock she experienced through the war that ravaged the city. Orisaye, who was deranged, emerged with the torch in her hand and pleaded that no one should take it away but should get his instead. She already knew what the generals decided and so began to tell them what the torch was meant for. She knelt before her mother to ask to stop crying for her and beg for the mother&rsquo;s blessing.<\/span><br><span style=\"font-family:'Times New Roman';\">In her ranting she declared what fate awaited her prospective husband and her own end. Her ranting which she claimed are revelations shown to her by Obatala was dismissed as incoherent babbling and futile prophecies on unsound lips.<\/span><br><span style=\"font-family:'Times New Roman';\">Gesinde at last began to deride the prophecy, imagining how Balogun Kusa who was revered and feared from Nupe Kingdom down to the Dahomey Kingdom could be smitten by a mad woman; and wonder how the general could stoop to ask for a woman who is known to all as unsound mind when there was a bee-hive of beautiful women who would be glad to marry him.<\/span><br><span style=\"font-family:'Times New Roman';\">As he made to take Orisaye away, he notified Erelu that it would soon be her turn soon as Balogun Derin is ready to set out. Orisaye was furious at the news of her mother becoming a slave to Balogun Derin&rsquo;s wife as declared by Gesinde. She cursed Gesinde for uttering such bad statement. She announced to him that her mother would die on Owu&rsquo;s soil and not being taken away as a slave. Gesinde asked her how Erelu would die since he was ready to prevent anyone attempting suicide. But Orisaye chose to keep her response as a secret not meant for the ears of an enemy. Instead she declared that Balogun Derin whose homeland was just three weeks away from Owu would wander for seventeen years in suffering, anguish and fighting without respite before reaching it.<\/span><br><span style=\"font-family:'Times New Roman';\">Orisaye danced as she was being led away. Erelu, unable to bear this, fainted. The women rushed to help her. When she came to, she was mad with them for rescuing her from the claws of death and rebuked the woman who suggested they call on the gods for help. She shifted the blame of it all on the gods for being silent in times like this.<\/span><br><span style=\"font-family:'Times New Roman';\">They started recalling what state they were in the previous day, that is, a day before the annihilation; how all the streets of Owu were in jubilation when they thought the invaders had left the city gates, seeing they all had deserted their camps, no smoke, or movement was perceived and no horse in sight. This departure of the allied forces marked the beginning of a new life for the city besieged for seven years. What the people of Owu thought was the end of famine and travailed soon became a bloodbath.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">First, arrows bearing torches were fired into the city. The thatches of the roofs caught fire. In a twinkling of an eye, the whole city was on fire and everyone began to scurry for safety. There was chaos in the streets because there were no more places to hide. Smoke from the balls of fire engulfed every corner of the city of Owu. People headed straight for the gates in blind daze. In panic, the gates were hacked down. It was too late for them to realize they had been deceived.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">The enemies who had gone to hide in the surrounding forest opened fire on the helpless victims whose best weapons were only cutlasses and incantations. This gruesome massacre was blamed again on the gods who had reclined at the time the city needed them the most for defense and deliverance but who let them face destruction alone. The women hinted at what the Owu priests told them when the siege was on: that Owu&rsquo;s fate was the handiwork of Lawumi. Rather than just accepting their plight in good faith, the women decided to rain curses on the allied soldiers.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><u><span style=\"font-family:'Times New Roman';\">Scene 5<\/span><\/u><\/strong><br><span style=\"font-family:'Times New Roman';\">The actions to be taken lingered till the dawn of another day as the women awaited the order of their new masters who would take them away. They were still in mourning as they raised their dirge. The delay was owing to the misunderstanding that ensued among the generals over the sharing of the loots.<\/span><br><span style=\"font-family:'Times New Roman';\">Just then the women observed an approaching figure. It was Adumaadan, the widow of Prince Lisabi, with her son, Aderogun, strapped to her back. Adumaadan had asked her new master to allow her fetch whatever belongings she could in the rubble. Erelu Afin&rsquo;s agony surged up again by the memory of the loss of her child which is responsible for Adumaadan&rsquo;s fate. Rather than looking her mother-in-law with pity, Adumaadan fired back at her for the role she played in aiding the hand of destruction on the city.<\/span><br><span style=\"font-family:'Times New Roman';\">Many years ago, when Dejumo was born, the gods decreed he be killed because he was destined to bring destruction on the city of Owu. Because Erelu would not allow it, the child was spared. Erelu became very protective knowing what she had done to preserve her child&rsquo;s life. It was because of this that Adumaadan had held on to the belief that if it was only Dejumo she loved amongst her sons.<\/span><br><span style=\"font-family:'Times New Roman';\">When he grew up, Dejumo was the one who took Iyunloye to wife when she was brought in among those captives taken from Apomu Market. Iyunloye was then the wife of Okunade, the notable craft man who had turned to Maye. It was because of her Okunade came to take revenge against Dejumo who took his wife after he finally learnt where Iyunade was taken to.<\/span><br><span style=\"font-family:'Times New Roman';\">Erelu then reminded Adumaadan that she only lost a husband, but she lost her husband, her five sons and a daughter safe, believing she still had Orisaye and Adeoti only to be told Adeoti was slaughtered during the onslaught. Adumaadan told her she found her dead at the entrance of the shrine of the goddess Lawunmi. Then Erelu realized what Gesinde meant when he said Adeoti had been sent to a place where pain can no longer reach her. While she mourned for her daughter,she thanked Adumaadan for the kindness she showed her daughter in closing her eyes and pouring sand on her which was the last respect given to the dead.<\/span><br><span style=\"font-family:'Times New Roman';\">Adumaadan considered Adeoti lucky because death had freed her from such terrible fate the survivors would have to experience. She pitied herself the most for being completely hopeless.<\/span><br><span style=\"font-family:'Times New Roman';\">She blamed her devotion to her late husband which she considered was what opened her up for the reason for being picked by her new man. For this Erelu cautioned her and encouraged her to learn to cope with the new life since she still had the boy. For as long as the boy lived, the kingdom was not wiped out.<\/span><br><span style=\"font-family:'Times New Roman';\">While saying this, Gesinde, whom Erelu addressed as &lsquo;man of misfortune&rsquo;, came in to announce to them what new order the generals had given that the boy should be killed. Balogun Derin warned the allied forces that as long as the boy lived, their own future is not safe if they spare a single heir to the Owu throne. Having warned the women not to resist, Adumaadan gave up the child and requested she hold him to her bosom for some moment before she finally surrendered him to be killed. Since it was a taboo to shoot a baby, the instruction was that its head must be bashed against the tree to crush its skull.<\/span><br><span style=\"font-family:'Times New Roman';\">As the boy was being taken away, the women raised a dirge to mourn the &lsquo;last hope of the land and last lamp that is about to be extinguished&rsquo;. Not long after the dirge was raised, Maye Okunade emerged with a detail of armed soldiers. He ordered that there be silence and announced to them that he had come to decide the fate of Iyunloye having had his rival Prince Adejumo killed through the hand of one of the lower ranked soldiers. He had concluded she would be killed but how and where are what he had not finalized. He ordered two of his detail to bring Iyunloye out dragging her by the hair from amongst the women. He wanted to hear her screaming for mercy.<\/span><br><span style=\"font-family:'Times New Roman';\">Erelu on hearing this was please beyond measure and felt vindicated by the gods for the first time. She told Okunade he would have her blessings if he killed her. Her request startled him, and he asked if she ever knew him. Erelu introduced herself, telling how she was connected in the episode. She warned Okunade ahead of time not to look Iyunade in the eye because that could call up the affection, he thought had died in him years back.<\/span><br><span style=\"font-family:'Times New Roman';\">Just as she said, Iyunade cunningly got him to listen to her side of the story. All she could do to keep Okunade&rsquo;s memory was to continue with the making of adire cloth and named it after him as Faari Okunade. She countered that all her effort to escape from the kingdom were aborted discarding the evidences Erelu gave against her.<\/span><br><span style=\"font-family:'Times New Roman';\">Okunade asked his men to take Iyunloye away to his tent to ride in his caravan as she would be stoned by the women of Ife who joined in the search with their husbands and lost them in the process.<\/span><br><span style=\"font-family:'Times New Roman';\">Though Erelu could not contest Maye Okunade&rsquo;s final decision she advised him to let Iyunade ride in a different caravan to avoid being won over and the hand of justice averted. Okunade left for his caravan and Iyunade was also led off. At this victory, Erelu raised a song of victory.<\/span><br><span style=\"font-family:'Times New Roman';\">While the women rejoiced, Gesinde comes in to deliver the baby&rsquo;s corpse along with Adumaadan&rsquo;s last wish for her baby&rsquo;s burial. He relayed to them the current state of things at the generals&rsquo; camps. Orisaye&rsquo;s prophecies had started to find fulfillment. Otunba Lekki left in a hurry because he received a message that war had broken out back at home and his father&rsquo;s throne had been seized.After according the baby the honor, some women took it away to be buried.<\/span><br><span style=\"font-family:'Times New Roman';\">They observed fresh fire burning in the palace. Gesinde came in at the same moment and explained that they were instructed to be razed down whatever might still be standing. He told them that very soon, the horn would be blown which would suggest they all have to march along to the caravans with their captors to their new destinations.<\/span><br><span style=\"font-family:'Times New Roman';\">Then Erelu announced to the women that it was to say goodbye but the chorus leader reminded her she owed the departed souls one last duty being &lsquo;the mother of the city and the only mouth left to speak to the ancestors&rsquo;. After much persuasion, she agreed to take up the responsibility. The women asked Gesinde and other soldiers to excuse them and that they would join the caravan a moment after since the ritual must not be done in the presence of a stranger. Gesinde agreed, but instructed them to be brief and left.<\/span><br><span style=\"font-family:'Times New Roman';\">The women raised the song of invocation, broke into two columns of choruses dancing around Erelu. Erelu and the chorus leaders soon were conducted into a trance. As the incantatory chant got to the climax Erelu was possessed by the spirit of Anlugbua. The same moment Anlugbua himself appeared at the scene, watching. Erelu voice changed as she responded to the chant declaring the mind and the position of the gods and what had been determined against the land and the survivors before he finally departed. Erelu screamed as the spirit of Anlugbua left her and she collapsed. It took the women a while before they realized she was dead.<\/span><br><span style=\"font-family:'Times New Roman';\">Anlugbua who stood on the other side then responded, making his comment on the effect of war on both the living and the gods. He promised to see to it that Owu rises again, though not on the same site where it was and not as a single city again just as Lawumi would not allow it to be so. But Owu was to come back as little communities elsewhere within the cities of Yorubaland; which was &lsquo;the only atonement that can be made against ceaseless volition of self-destruction&rsquo;.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">Themes<\/span><\/strong><strong><span style=\"font-family:'Times New Roman';\">&nbsp;&nbsp;<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">-Ungratefulness, greed, war, revenge, disloyalty, prophesy, unfaithfulness, wickedness, disobedience of man (man versus gods), shallow-mindedness.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">The relationship of man and the supernatural has remain an interesting topic in the world of literature.<\/span><strong><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/strong><span style=\"font-family:'Times New Roman';\">The fact that Lawumi asked and gave aide to<\/span><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><span style=\"font-family:'Times New Roman';\">Owu enemies to defeat their craddle home&hellip; And also, her ruining the Ijebu alliance forces with the help of Anlugba&hellip; Shows that men are just cards in the hands of these divine beings&hellip;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">UNN PUTME On Feral Osofisan&#39;s Women of Owu<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">Questions 1 to 5 are based on Feral Osofisan&#39;s Women of Owu<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">1. The three allied forces that attacked Owu were_____.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. ljebu, Ogun, Ire B. ljebu, Ife, Oyo C. Ode, Oyo, Ife D. Ogun, Oyo, Ife<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(B. ljebu, Ife, Oyo, 2015\/2016, no 1)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">2. Who made the statement, &quot;Do you still trust in them (gods) after this?&quot;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. Anlugbua B. Adumaadun C. Gesinde D. Erelu<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(D. Erelu, 2015\/2016, no 2)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">3. The main character IF Women of Owu was___.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. Gesinde B. Erelu C. Adumaadun D. Oba Akinjobi<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(B. Erelu, 2015\/2016, no 3)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">4. The character that reaped the fruit of his folly in the end is____.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. Maye Okunade B. Erelu C. Oba Akinjobi D. Anlugbua<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(A. Maye Okunade, 2015\/2016, no 4)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">5. The major theme of the play is____.<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. manipulation or human beings by the gods B. the destructive nature of wars C. women D. casualties of war<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(B. the destructive nature of wars, 2015\/2016, no 5)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><strong><span style=\"font-family:'Times New Roman';\">JAMB Examples<\/span><\/strong><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">1. In the play, the gods are portrayed as&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. helpless B. architects of man&#39;s destiny C. amorous D. saviours of mankind&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(B. architects)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">2. Orisaye describes Balogun Kusa as&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. a great warrior B. an enemy and a butcher C. a friend in need D. a good leader<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(B. an enemy and a butcher)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">3. Erelu is&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. the oldest wife of the Oba Akinjobi B. a courtier to the Alaafin of Oyo C. the most brilliant woman in Owu D. the first wife of the Oba<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(A. the oldest wife of the Oba Akinjobi)<\/span><\/em><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">4. Balogun Kusa is killed by a&nbsp;<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><span style=\"font-family:'Times New Roman';\">A. god B. herbalist C. lunatic D. soldier<\/span><\/p>\r\n<p style=\"margin-top:0pt; margin-bottom:8pt; font-size:12pt;\"><em><span style=\"font-family:'Times New Roman';\">(C. lunatic)<\/span><\/em><\/p>\r\n<\/body>\r\n\r\n<\/html>",
  "chapIndex": "SUMMARY OF WOMEN OF OWU"
}