{
  "chapIndex": "",
  "text": "SECTION I: NUMBER AND NUMERATION\n\n \n1. Number bases:\n\n \n\nTopics:\n\n(a) operations in different number bases from 2 to 10;\n(b) conversion from one base to another including fractional parts.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. perform four basic operations (x,+,-,÷)\nii. convert one base to another.\n\n \n2. Fractions, Decimals, Approximations and Percentages:\n\n \n\nTopics: \n\n(a) fractions and decimals;\n(b) significant figures;\n(c) decimal places;\n(d) percentage errors;\n(e) simple interest;\n(f) profit and loss percent;\n(g) ratio, proportion and rate;\n(h) shares and valued added tax (VAT).\n\n \n\nObjectives: \n\nCandidates should be able to:\n\ni. perform basic operations (x,+,-,÷) on fractions and decimals;\nii. express to specified number of significant figures and decimal places;\niii. calculate simple interest, profit and loss percent; ratio proportion and rate;\niv. Solve problems involving share and VAT.\n\n \n3. Indices, Logarithms and Surds:\n\n \n\nTopics:\n\n(a) laws of indices;\n(b) standard form;\n(c) laws of logarithm;\n(d) logarithm of any positive number to a given base;\n(e) change of bases in logarithm and application;\n(f) relationship between indices and logarithm;\n(g) surds.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. apply the laws of indices in calculation;\nii. establish the relationship between indices and logarithms in solving problems;\niii. solve problems in different bases in logarithms;\niv. simplify and rationalize surds;\nv. perform basic operations on surds.\n\n \n4. Sets:\n\n \n\nTopics:\n\n(a) types of sets\n(b) algebra of sets\n(c) venn diagrams and their applications.\n\n \n\nObjectives: \n\nCandidates should be able to:\n\ni. identify types of sets, i.e empty, universal, complements, subsets, finite, infinite and disjoint sets;\nii. solve problems involving cardinality of sets;\niii. solve set problems using symbol;\niv. use venn diagrams to solve problems involving not more than 3 sets.\n\n \nSECTION II: ALGEBRA.\n\n \n1. Polynomials:\n\n \n\nTopics:\n\n(a) change of subject of formula\n(b) factor and remainder theorems\n(c) factorization of polynomials of degree not exceeding 3.\n(d) multiplication and division of polynomials\n(e) roots of polynomials not exceeding degree 3\n(f) simultaneous equations including one linear one quadratic;\n(g) graphs of polynomials of degree not greater than 3.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. find the subject of the formula of a given equation;\nii. apply factor and remainder theorem to factorize a given expression;\niii. multiply and divide polynomials of degree not more than 3;\niv. factorize by regrouping difference of two squares, perfect squares and cubic expressions; etc.\nv. solve simultaneous equations - one linear, one quadratic;\nvi. interpret graphs of polynomials including applications to maximum and minimum values.\n\n \n2. Variation:\n\n \n\nTopics:\n\n(a) direct\n(b) inverse\n(c) joint\n(d) partial\n(e) percentage increase and decrease.\n\n \n\nObjectives: \n\nCandidates should be able to:\n\ni. solve problems involving direct, inverse, joint and partial variations;\nii. solve problems on percentage increase and decrease in variation.\n\n \n3. Inequalities:\n\n \n\nTopics:\n\n(a) analytical and graphical solutions of linear inequalities;\n(b) quadratic inequalities with integral roots only.\n\n \n\nObjective:\n\nCandidates should be able to:\n\ni. solve problems on linear and quadratic inequalities;\nii. interpret graphs of inequalities.\n\n \n4. Progression: Topics:\n\n(a) nth term of a progression\n(b) sum of A. P. and G. P.\n\n \n\nObjectives: \n\nCandidates should be able to:\n\ni. determine the nth term of a progression;\nii. compute the sum of A. P. and G.P;\niii. sum to infinity of a given G.P.\n\n \n5. Binary Operations:\n\n \n\nTopics:\n\n(a) properties of closure, commutativity, associativity and distributivity;\n(b) identity and inverse elements (simple cases only).\n\n \n\nObjectives: \n\nCandidates should be able to:\n\ni. solve problems involving closure, commutativity, associativity and distributivity;\nii. solve problems involving identity and inverse elements.\n\n \n6. Matrices and Determinants:\n\n \n\nTopics:\n\n(a) algebra of matrices not exceeding 3 x 3;\n(b) determinants of matrices not exceeding 3 x 3;\n(c) inverses of 2 x 2 matrices [excluding quadratic and higher degree equations].\n\n \n\nObjectives: \n\nCandidates should be able to:\n\ni. perform basic operations (x,+,-,÷) on matrices;\nii. calculate determinants;\niii. compute inverses of 2 x 2 matrices.\n\n \nSECTION III: GEOMETRY AND TRIGONOMETRY\n\n \n1. Euclidean Geometry:\n \n\nTopics:\n\n(a) Properties of angles and lines\n(b) Polygons: triangles, quadrilaterals and general polygons;\n(c) Circles: angle properties, cyclic quadrilaterals and intersecting chords;\n(d) construction.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. identify various types of lines and angles;\nii. solve problems involving polygons;\niii. calculate angles using circle theorems;\niv. identify construction procedures of special angles, e.g. 30°, 45°, 60°, 75°, 90° etc.\n\n \n2. Mensuration:\n\n \n\nTopics:\n\n(a) lengths and areas of plane geometrical figures;\n(b) lengths of arcs and chords of a circle;\n(c) Perimeters and areas of sectors and segments of circles;\n(d) surface areas and volumes of simple solids and composite figures;\n(e) the earth as a sphere:- longitudes and latitudes.\n\n \n\nObjectives: \n\nCandidates should be able to:\n\ni. calculate the perimeters and areas of triangles, quadrilaterals, circles and composite figures;\nii. find the length of an arc, a chord, perimeters and areas of sectors and segments of circles;\niii. calculate total surface areas and volumes of cuboids, cylinders. cones, pyramids, prisms, spheres and composite figures;\niv. determine the distance between two points on the earth's surface.\n\n \n3. Loci:\n\n \n\nTopic:\n\nlocus in 2 dimensions based on geometric principles relating to lines and curves.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\nidentify and interpret loci relating to parallel lines, perpendicular bisectors, angle bisectors and circles.\n\n \n4. Coordinate Geometry:\n\n \n\nTopics:\n\n(a) midpoint and gradient of a line segment;\n(b) distance between two points;\n(c) parallel and perpendicular lines;\n(d) equations of straight lines.\n\n \n\nObjectives: \n\nCandidates should be able to:\n\ni. determine the midpoint and gradient of a line segment;\nii. find the distance between two points;\niii. identify conditions for parallelism and perpendicularity;\niv. find the equation of a line in the two-point form, point-slope form, slope intercept form and the general form.\n\n \n5.Trigonometry:\n\n \n\nTopics: \n\n(a) trigonometrical ratios of angels;\n(b) angles of elevation and depression;\n(c) bearings;\n(d) areas and solutions of triangle;\n(e) graphs of sine and cosine;\n(f) sine and cosine formulae.\n\n \n\nObjectives: \n\nCandidates should be able to:\ni. calculate the sine, cosine and tangent of angles between - 360° ≤ θ ≤ 360°;\nii. apply these special angles, e.g. 30°, 45°, 60°, 75°, 90°, 105°, 135° to solve simple problems in trigonometry;\niii. solve problems involving angles of elevation and depression;\niv. solve problems involving bearings;\nv. apply trigonometric formulae to find areas of triangles;\nvi. solve problems involving sine and cosine graphs.\n\n \nSECTION IV: CALCULUS I. Differentiation:\n\n \n\nTopics: \n\n(a) limit of a function\n(b) differentiation of explicit algebraic and simple trigonometrical functions-sine, cosine and tangent.\n\n \n\nObjectives: \n\nCandidates should be able to:\n\ni. find the limit of a function\nii. differentiate explicit algebraic and simple trigonometrical functions.\n\n \n2. Application of differentiation:\n\n \n\nTopics:\n\n(a) rate of change;\n(b) maxima and minima.\n\n \n\nObjective: \n\nCandidates should be able to:\n\nsolve problems involving applications of rate of change, maxima and minima.\n\n \n3. Integration:\n\n \n\nTopics:\n\n(a) integration of explicit algebraic and simple trigonometrical functions;\n(b) area under the curve.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. solve problems of integration involving algebraic and simple trigonometric functions;\nii. calculate area under the curve (simple cases only).\n\n \nSECTION V: STATISTICS\n\n \n1. Representation of data:\n\n \n\nTopics:\n\n(a) frequency distribution;\n(b) histogram, bar chart and pie chart.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. identify and interpret frequency distribution tables;\nii. interpret information on histogram, bar chat and pie chart\n\n \n2. Measures of Location:\n\n \n\nTopics:\n\n(a) mean, mode and median of ungrouped and grouped data - (simple cases only);\n(b) cumulative frequency.\n\n \n\nObjectives:\n\nCandidates should be able to:\n\ni. calculate the mean, mode and median of ungrouped and grouped data (simple cases only);\nii. use ogive to find the median, quartiles and percentiles.\n\n \n3. Measures of Dispersion:\n\n \n\nTopic:\n\nrange, mean deviation, variance and standard deviation.\n\n \n\nObjective:\n\nCandidates should be able to:\n\ncalculate the range, mean deviation, variance and standard deviation of ungrouped and grouped data.\n\n \n4. Permutation and Combination:\n\n \n\nTopics:\n\n(a) Linear and circular arrangements;\n(b) Arrangements involving repeated objects.\n\n \n\nObjective:\n\nCandidates should be able to:\n\nsolve simple problems involving permutation and combination.\n\n \n5. Probability:\n\n \n\nTopics\n\n(a) experimental probability (tossing of coin, throwing of a dice etc);\n(b) Addition and multiplication of probabilities (mutual and independent cases).\n\n \n\nObjective:\n\nCandidates should be able to: solve simple problems in probability (including addition and multiplication).\n\n \nRECOMMENDED TEXTS\n\nAdelodun A. A (2000) Distinction in Mathematics: Comprehensive Revision Text, (3rd Edition) Ado -Ekiti: FNPL.\n\nAnyebe, J. A. B (1998) Basic Mathematics for Senior Secondary Schools and Remedial Students in Higher/ institutions, Lagos: Kenny Moore.\n\nChannon, J. B. Smith, A. M (2001) New General Mathematics for West Africa SSS 1 to 3, Lagos: Longman.\n\nDavid -Osuagwu, M. et al (2000) New School Mathematics for Senior Secondary Schools, Onitsha: Africana - FIRST Publishers.\n\nEgbe. E et al (2000) Further Mathematics, Onitsha: Africana - FIRST Publishers\n\nIbude, S. O. et al (2003) Agebra and Calculus for Schools and Colleges: LINCEL Publishers.\n\nTuttuh - Adegun M. R. et al (1997), Further Mathematics Project Books 1 to 3, Ibadan: NPS Educational\n\nWisdomline Pass at Once JAMB."
}