{
  "chapIndex": "",
  "text": "SECTION A: RUDIMENTS OF MUSIC\n\nTopic\n\n1.The staff:\n\n(a) great staff,\n\n(b) ledger lines and spaces,\n\n(c) open score (vocal score)and\n\n(d) C clef, alto (viola clef) and tenor clef.\n\n \n\nObjectives\n\nCandidates should be able to identify all the components of the staff and their application.\n\n \n\nTopic\n\n2. Music Notes/Rests and their corresponding values.\n\n \n\nObjectives\n\nCandidates should be able to determine the relative duration of different notes and rests\n\n \n\nTopic\n\n3. Time/Time signature:(simple and compound time signatures), the correct grouping of notes and barring of unbarred passages.\n\n \n\nObjectives\n\nCandidates should be able to interpret varied rhythmic patterns.\n\n \n\nTopic\n\n4. A–Key signatures and scales:\n\n(i) technical names of the various degrees of the scale\n\n(ii) diatonic major/minor (natural,harmonic and melodic)\n\n(iii) chromatic scales.\n\nB–Determination of the key of a piece of music with or without key signature NOT exceeding two sharps and two flats.\n\n \n\nObjectives\n\nCandidates should be able to:\n\ni.ascertain names of the various degrees of the diatonic scales.\n\nii.identify simple scale passages with or without key signature.\n\n \n\nTopic\n\n(a) Keyboard setting and enharmonic equivalents\n\n(b) Accidentals\n\n \n\nObjectives\n\nCandidates should be able to identify the names of the white and black keys and their relationship, e.g. (C sharp = Bx)\n\n \n\nTopic\n\n6. Intervals:\n\n6a. Recognition of diatonic/ chromatic intervals and their inversions (e.g. perfect unison, perfect 4th, perfect 5th, perfect 8ve), major/minor 2nd, 3rd, 6th and 7th, diminished 5th and augmented 4th\n\n6b. Recognition of consonant and dissonant intervals.\n\n \n\nObjectives\n\nCandidates should be able to determine different qualities of intervals (melodic and harmonic)\n\n \n\nTopics\n\nDefinition of simple musical terms, signs and abbreviations\n\n \n\nObjectives\n\nCandidates should be able to interpret simple musical signs and terms.\n\n \n\nTopic\n\n8.(a) Transcription of music from staff into tonic solfa notation and vice-versa.\n\n(b) Transposition using the treble (G) and bass (F) staves NOT exceeding two sharps and two flats\n\n \n\nObjective\n\nCandidates should be able to:\n\ni.readmusic in any given notation.\n\nii.rewrite a music passage on a given stave.\n\n \nSECTION B: ELEMENTARY HARMONY\n\n1.Triads and their inversions in major/minor keys, NOT exceeding two sharps and two flats.\n\n(a) Primary triads in major keys.\n\n(b) Secondary triads in major keys.\n\n \n\nNOTE A:CHORD INDICATIONS\n\n(i) major triads are indicated with capital Roman numerals e.g. I(ii)minor triads are indicated with small Roman numerals e.g. ii\n\n(iii) diminished triads are indicated with small Roman numerals with a “o” sign, e.g. viio\n\n(iv) augmented triads are indicated with capital numerals with a “+”, e.g III+\n\n \n\nNOTE B:(i)In any major scale, major triads are I, IV and V(ii)minor triads are ii, iii and vi(iii)diminished triadis viio\n\nNOTE C:\n\n(i) In any harmonic minor, minor triads are i and iv\n\n(ii) major triads are V and VI\n\n(iii) diminished triads are iio and viio\n\n(vi) augmented triad is III+\n\n \n\nNOTE D: Primary triads are I, IV and V in major scales but i, iv and V in harmonic minor scales\n\n \n\nObjectives\n\nCandidates should be able to:\n\ni.identify triads;\n\nii.compare types of triads;\n\niii.determine the use of triads.\n\n \n\nTopic\n\n2.(a)Basic chord progressions in four parts vocal style (SATB) in major keys NOT exceeding two sharps and two flats.\n\n(b) Dominant 7th chord in root position only\n\n \n\nObjectives\n\nCandidates should be able to:\n\ni. determine the basic chord progressions in a music passage.\n\nii. recognize the dominant 7th chord\n\n \n\nTopic\n\n3.Kinds of motion;Parallel, similar, contrary and oblique\n\n \n\nObjectives\n\nCandidates should be able to identify the various kinds of motion in a musical passage  \n\nTopic\n\n4.Cadences in major keys NOT exceeding two sharps and two flats.\n\n(a) perfect/ full close cadence\n\n(b) imperfect/ half close/ semi cadence.\n\n(c) plagal/Amen cadence\n\n(d) interrupted / deceptive / evaded / surprise cadence\n\n \n\nObjectives\n\nCandidates should be able to identify the various types of cadences in a musical score\n\n \n\nTopic\n\n5.Non-harmonic tones/Non-chord tones; identification and application of the following:\n\n(a) neighbouring tones/auxiliary notes\n\n(b) passing tones/notes\n\n \n\nObjective\n\nCandidates should be able to relate harmonic or non-harmonic tones to the chords with which they are associated.\n\n \n\nTopic\n\n6.MODULATION\n\nSimple diatonic modulations (using a single melodic line) from any given major key NOT exceeding two sharpsand two flats to any of its closely related keys (dominant and subdominant).\n\n \n\nObjectives\n\nCandidates should be able to determine the key of a given melody and its modulation.\n\n \n\nTopic\n\n7.Elementary Composition:\n\n(a) Setting of words to written melody:\n\n(b) Recognition of suitable answers to given musical phrases\n\n \n\nObjective\n\nCandidates should be able toidentify suitable melody to given words, compatible and balanced (parallel or contrasting) phrases\n\n \nSECTION C: HISTORY AND LITERATURE OF AFRICAN MUSIC\n\nTopic:\n\n1.Nigerian folksongs, types, formsand characteristics.\n\n(a) Types: cradle, folk-tales, games, war, satirical, dirges/funeral, historical, praise and worksong,etc.\n\n(b) Forms: call and response, strophic, through –composed, etc.\n\n(c) Characteristics:\n\n(i) Vocal styles:recitative, yodeling, ululation, incantation, heaving, whistling, etc.\n\n(ii) Scales/modes: tritonic, tetratonic, pentatonic, hexatonic etc,\n\n(iii) Metre/Rhythm: Metric and non-metric, polymetric, cross rhythm, syncopation, hemiola, polyrhythm, etc\n\n \n\nObjectives\n\nCandidates should beable to:\n\ni. identify various folksongs and their types;\n\nii. define and compare their forms and features\n\n \n\nTopic\n\n2.General knowledge of the features and forms of Nigeriantraditional music andother arts.\n\n(i) Festivals: e.g. Osun, Ifa, Ogun, Ekpo, Ofala, Iri-ji (New Yam Festival), Ovia Osese, Mmanwu (Masquerade), Ila-Oso, Argungu (Fishing), Eyo/Adamu –Orisa, Gelede, etc.\n\n(ii) Dancesand other arts: Social, Ritual and Ceremonial e.g. Masquerade, Koroso, Atilogwu, Ikperikpe (Wardance), Egedeege, Kwaghir, Agbon, Nkwa Umuagbogho, Bata, Bori, Swange, Dundun, Kokoma, Abigbo, Okonko, etc\n\n \n\nObjectives\n\nCandidates should be able to:\n\ni.analyse the features and forms of Nigerian traditionalmusic and the arts;\n\nii.differentiate between the various types of festivals and dances\n\n \n\nTopic\n\n3.INSTRUMENTS:Nigerian traditionalmusical instruments:\n\nCLASSIFICATIONS:\n\n(a) Aerophones:\n\n(i) kakaki, algaita, sarewa, pedete, obati, farai, kaho, imar, mongom, taluk, damalgo, etc.\n\n(ii) oja, opi, pipilo, odu, nnuk,ofiom, akpele, etc.\n\n(iii) ekutu, teremagbe, ayeta-ode, odikakora, etc.\n\n(b) Chordophones:\n\n(i) goge, kukuma, komo, kwamsa, kuntigi, lasha, molo, garaya, gurmi, etc.\n\n(ii) une, ubo-akwara, etc.\n\n(iii) goje, molo, etc\n\n(c) Idiophones:\n\n(i) kundung, karawa, shantu, etc.\n\n(ii) oyo, ichaka, ogene, aja, ekpili, ekwe, udu, ikoro, ngedegwu, okpokoro, ekere, mgbiligba, alo, ubo-aka, etc.\n\n(iii) sekere, agogo, agidigbo, alọ, oma, aro, ukuse, eromwon, etc\n\n(d) Membranophones:\n\n(i) ganga, tambari, taushi, banga, balle, kuntuku, kalangu, gangan-noma, tandu, etc.\n\n(ii) igba, nsing, ban yogume, emoba, etc.\n\n(iii) ipese, igbin, bata, bembe, gudugudu, kanango, dundun, agidigbo, gangan, etc\n\n \n\n4.Knowledge of the lives and music of the following African traditionalmusicians:\n\n \n\nObjectives\n\nCandidates should be able to:\n\ni.differentiate between the various types and classes of musical instruments;\n\nii.classify them into their categories\n\n \n\nTopic\n\nA. NIGERIANS\n\n(i) Sani Sabulu, Sani Dan Indo, Hassan Wayam, Barmani Coge, Danlami Nasarawa, Garba Super, Dankwairo, Aminu mai Asharalle, Shehu Ajilo, Dan Maraya Jos, Dan Alalo, Mamman Shata, Haruna Uje, etc.\n\n(ii) Ezigbo Obiligbo, Seven-Seven, Morocco Maduka, Okechukwu Nwatu, Mike Ejeagha, Afam Ogbuotobo etc.\n\n(iii) Kokoro, (the blind Minstrel), Anikura, Tunde Alao,Olanrewaju Adepoju, Ademola Onibon-okuta, ElemureOgunyemi, Comfort Omogeetc\n\n \n\nB. OTHER AFRICANS\n\nVinoko Akpalu, Daniel Amponsah (alias koo Nimo), EfuaBasa, Kwaa Mensah etc.\n\n \n\nObjectives\n\nCandidates should be able to:\n\ni.identify different groups to which various musicians belong;\n\nii.trace their biographies;\n\niii.analyse their musical styles;iv.assess their contributions to the music industry.\n\n \n\nTopic\n\n5.Evolution and Development of African Popular Music:Highlife, Afro-beat, Fuji, Apala, Reggae, Makosa, Ikwokirikwo, Okukuseku, Ekassa, Akuko na egwu, Awurebe, Waka, Hiplife, Hip-hop, Jujuetc.\n\n \n\n6.Knowledge of the livesandmusic of the following African Popular Musicians.\n\n \n\nObjectives\n\nCandidates should be able to:\n\ni.differentiate one musical genre from another; ii.examine their influence on society\n\n \n\n \n\nTopic\n\n A. NIGERIANS:\n\nBongos Ikwe, Oliver De Coque, Nelly Uchendu, Osita Osadebe, Bright Chimezie, Bobby Benson, Victor Uwaifo, Sonny Okosun, Fela Anikulapo Kuti, I. K. Dairo, Victor Olaiya, Ebenezer Obey, Sunny Ade, Fatai Rolling Dollar, Bala Miller, Alhaji Uba Rawa, Zaaki Adzee, 2Face, PSquare, Djnee, Paul Play Dairo, Eedris Abdulkareem, D’Banj, SunnyNeji, Lagbaja, Zule Zoo, Daddy Showkey, Majek Fashek, Ras Kimono, Jeremiah Gyang,Flavour, Olamide, M.I, Iyanya, Wizkid,Davido, Omawunmi, Lara George, Sola Allynson, Ara, Asa, Onyeka Onwenu, Christy Essien-Igbokwe, Nasir Hausawa etc\n\nB. OTHER AFRICANS:\n\nManu Dibango, E. T. Mensah, Jerry Hansen, Kofi Olomide, Awilo Logomba, Papa Wemba, Salif Kaita, Angelina Kidjo, Lucky Dube, Yvonne Chakachaka, Brenda Fasie,Sarkodieetc.\n\n \n\nObjective\n\nCandidates should be able to:i.relate the musicians to the music they perform;\n\nii. trace their biographies;iii.examine their type of music;\n\niv. assess their contributions to the development of music.\n\n \n\nTopic\n\n7.Knowledge of the lives and music of the following African Art Musicians:\n\nA. NIGERIANS:\n\nW. W. C. Echezona, Laz Ekwueme, Sam Akpabot, Ikoli Harcourt Whyte, Joshua Uzoigwe, Mosun Omibiyi-Obidike, Tunji Vidal, Ademola Adegbite, Yemi Olaniyan, Ayo Bankole, Akin Euba, Sam Ojukwu, A. K. Achinivu, Bode Omojola, Felix Nwuba, ChristopherOyesiku, Dayo Dedeke, Adams Fiberesima, Dan Agu, Chris Onyeji, Godwin Sadoh, Meki Nzewi, etc.\n\nB. OTHER AFRICANS:\n\nJoseph S. Maison, N. Z. Nayo, J. H. Kwabena Nketia, GymahLabi,Philip Gbeho, Ephraim Amu, C.K. Adom, A.A. Mensah, C.W.K. Mereku, etc.\n\n \n\nObjective\n\nCandidates should be able to:\n\ni.relate the musicians to the music they perform:\n\nii.trace their biographies;\n\niii.examine their type of music;\n\niv.assess their contributions to the development of music\n\n \n\nTopic\n\nSECTION D:\n\nHISTORY AND LITERATURE OF WESTERN MUSIC\n\n1.(A) Historical development of Western music styles in respect of the periods\n\n(i) Medieval/Middle Age (800 –1400).\n\n(ii) Renaissance period (1400 –1600).\n\n(iii) Baroque period (1600 –1750).\n\n(iv) Classical period (1750 –1820).\n\n(v) Romantic period (1820 –1900).\n\n \n\nObjectives\n\nCandidates should be able totrace the stages of the development of western musical practice from the medieval to the end of the romantic period.\n\n \n\nTopic\n\nB. COMPOSERS\n\nPalestrina, Claudio Monteverdi, Henry Purcell, J.S. Bach, G. F. Handel, W. A. Mozart, FranzJoseph Haydn, Ludwig van Beethoven, Franz Schubert, Frederic Chopin, etc.\n\n \n\nObjecive\n\nCandidates should be able to:i.identify the composers;ii.assess their contributions.\n\n \n\n \n\n2.MUSIC FORMSAND MEDIA\n\n(i) Binary, Ternary, Rondo, SonataAllegro, Dance Suite, Canon, Free Fantasia, Theme and variation, etc.\n\n(ii) Orchestral and Band instruments and classifications\n\n(iii) The human voice (its types, ranges and qualities)\n\n(iv) Keyboard Instruments–the organ, piano and electronic keyboard, e.t.c.\n\n(v) Knowledge of the following instruments: ukulele,banjo, guitar, mandolin, harp, accordion, xylophone, marimba, etc.\n\n(vi) Computer Music Technology: software (Finale, Sibelius,Cubase, Reason,Sound Forge Nero), tuning fork, pitch pipe etc\n\n \n\nObjective\n\nCandidates should be able to:\n\ni. identify the general forms and various types of instruments in Western music.\n\nii. relate music to modern technology\n\n \n\nTopic\n\nSECTION E:\n\nCOMPARATIVE MUSIC STUDIES\n\n1.An overview of the following black musicians (composers, performers, etc) in the diaspora. Mighty Sparrow, James Brown, Bob Marley, Michael Jackson, Stevie Wonder, Lionel Richie, R. Kelly, Lorrinan Hill, Kirk Franklin, Tupac Shakur, Shabba Ranks, Quincy Jones, Boyz II Men, Sean Paul, Janet Jackson, Whitney Houston, Beyonce,Brandy, Usher, Kevin Lyttle, Bobby Brown, M. C. Hammer, L. L. Cool J., Dr. Dre, Snoop Doggy, Mary J. Blige, Jay Z, Chris Brown, Bruno Mars, Neo, Rihanna etc.\n\n \n\nObjective\n\nCandidates should be able to:\n\ni. identify the musicians in the diaspora;\n\nii.assess their musical influence on the global society.\n\n \n\nTopic\n\n2. Forms to be examined include negro spiritual, gospel music, jazz, rhythm and blues, soul, calypso, rock ‘n’ roll, reggae, afro-beat, tango, rap, chachacha, bolero, twist, hip-hop, etc.\n\n \n\nObjective\n\nCandidates should be able to:\n\ni.identify the various forms of musical genres;\n\nii.trace the origins of the musical genres.\n\n \n\nTopic\n\n3.The spirit of nationalism in Nigerian music.\n\n \n\nObjectives\n\nCandidates should be able to:\n\ni. identify some of the features and materials used by nationalist composers to create, project and sustain cultural and patriotic awareness;\n\nii. assess their roles in Nigerian nationalism.\n\n \n\n \nRECOMMENDED TEXTS\n\nAkpabot, S. E. (1986).Foundation of Nigerian Traditional Music, Ibadan: Spectrum.\n\nAssociated Board of the Royal School of Music (1958).Rudiments and Theory of Music,London.\n\nCole, W. (1969).The Form of Music, London: The Associated Board of the Royal Schoolsof Music.\n\nEchezona, W. W. C. (1981). Nigerian Musical Instruments, Enugu: Apollo Publishing Ltd.\n\nEkwueme, L. (1993).Choir Training and Choral Conducting for Africans, Lagos: Lenaus Advertising and Publishing Company.\n\nHolst, I. (1963).An ABC of Music, Oxford: Oxford University Press.\n\nHosier, (1961).Instruments of the Orchestra Oxford: Oxford University Press.\n\nHunt, R. (1960).Elements of Music.\n\nInanga, A. (1993).Music for Secondary Schools Vols. I and II, Ibadan: Spectrum\n\nKamien, R. (1990). Music: An Appreciation,London: McGraw –Hill Publishing Company.\n\nKennedy, M. (1985).The Concise Oxford Dictionary of Music, (Third Edition), London: Oxford University Press.\n\nKitson, C. H. (1978).Elementary Harmony Book 2,London: Oxford University Press.\n\nKofoworola, Z. O. And Lateef, Y. (1987). Hausa performing Arts and Music,Lagos:Nigeria Magazine.\n\nLovelock, W. (1953).A Concise History of Music,London: Bell and Hyman.\n\nLovelock, W.(1996).The Rudiments of Music, London. G. Bell and sons Limited.\n\nMachlis, J. (1977). The Enjoyment of Music,New York: W.W. Norton.\n\nMensah, A. A. (Undated) Folksongs for Schools, Accra.Morris, R. O. (1974).The Oxford Harmony, Vol. I, London: Oxford University Press.\n\nNketia, J. H. (1974).African Music,New York: W. W. Norton Company.\n\nPalmer, K. (1965).Teach Yourself Music, London: The English University Press Limited.Reed, H. O. (1954).Basic Music: A Basic Theory Text, New York:, N. Y. Mills Music Inc. Taylor, E. (1989).The Guide to Music Theory,London: The Associated Board of The Royal School of Music.\n\nWarburton, A.O. (1955).Graded Music Course for Schools, Books I –III, London: Longman"
}